[
    {
        "id": 12677,
        "title": "Stubborn Archivist",
        "author": " Yara Rodrigues Fowler",
        "description": "The book’s Stubborn Archivist is a young woman born into a mix of cultures and trying to work out her identity. I loved the beautifully written prose and jumping between time periods and perspectives of characters, in new and unfamiliar surroundings, kept the pace moving swiftly along. An enjoyable and insightful read.",
        "year": 2021
    },
    {
        "id": 12827,
        "title": "Somebody Loves You",
        "author": "Mona Arshi",
        "description": "Beautifully rendered and wryly observed, this novel touches on family, mental illness and the therapeutic properties of gardening.  The broken, fragmented narrative brings to mind a cubist painting, but this is a portrait with surprising detail and depth; a powerful coming-of-age story which rewards the reader with the rich interior world of a mute girl.",
        "year": 2021
    },
    {
        "id": 12696,
        "title": "The Cat and the City",
        "author": " Nick Bradley",
        "description": "Surprising stories about Tokyo and its interesting intertwining inhabitants, tied together with the reappearance of a calico cat. Those I found most moving were of Ohashi, a homeless man who once was a storyteller, Makoto, a game’s enthusiast with dry humour and Flo, an American translator interested in Japanese language. There is also a threatening undertone - but I found the Japanese words no obstacle to understanding and savouring the text.",
        "year": 2021
    },
    {
        "id": 13061,
        "title": "All of You Every Single One",
        "author": " Beatrice Hitchman",
        "description": "What comes across more than anything in this story is how love and affection, in spite of everything, endures. In this case it's the bond between Julia and Eve, tested against the backdrop of Vienna pre and post First World War, then again in the late 1930s and life under the Nazis. Vienna is beautifully captured in this absorbing and evocative story that doesn't shy away from addressing antisemitism, homophobia and the violence of the period.",
        "year": 2023
    },
    {
        "id": 12987,
        "title": "The Silence Project",
        "author": " Carole Hailey",
        "description": "Emilia’s grief is forced into the spotlight as she struggles to align herself with her mother, an activist who changed the world though coordinating a mass suicide. Gripping from the outset, the reader experiences the shocks, revelations and confusion with the protagonist as she compiles her memoir, recounting her struggle to separate her mother from the personality propelled and twisted by the increasingly powerful Community she left behind.",
        "year": 2023
    },
    {
        "id": 13021,
        "title": "Looking Glass Sound",
        "author": " Catriona Ward",
        "description": "Wilder, a lonely boy, spends a summer by the sea and is confronted with an intruder called the Dagger Man, several missing women and a confusing friendship. A gruesome discovery haunts him for a lifetime and is the reason for a rift between him and a friend who steals his life story. Such an intriguing, dark, spooky and exciting read, I found it a real page turner - and I didn’t see the end coming at all.",
        "year": 2023
    },
    {
        "id": 12823,
        "title": "Mrs March",
        "author": " Virginia Feito",
        "description": "A brilliant portrayal of a New York housewife whose seemingly perfect life descends slowly but surely into chaos. We witness her increasing paranoia and we desperately want to help but are powerless to prevent the unfolding tragedy.\nI loved this stunning first novel and it is so skilfully written that I was absorbed from the start to the very last page. Definitely one not to be missed.",
        "year": 2021
    },
    {
        "id": 13043,
        "title": "Traces of Enayat",
        "author": " Iman Mersal",
        "description": "This is a strange but mesmerising book. It tells of the detailed search into the life of Enayat al-Zayyat, a young Egyptian female author who committed suicide before the publication of her only novel. Also bound up with the posy-colonial politics of Egypt and, specifically, what happened to women under Nassar.  It's by no means an easy read, but it is fascinating, and shows how the struggle continues across generations.",
        "year": 2023
    },
    {
        "id": 12824,
        "title": "Night Theatre",
        "author": " Vikram Paralkar",
        "description": "This gripping and tense novel is beautifully written and kept me engaged throughout. While the plot driver might be fantastical - a murdered family returns from the afterlife and has one night for a surgeon to heal their wounds - this story is grounded in reality.  The exasperation of the surgeon at his limited equipment and the desperation of the parents wishing to save their children had me racing through to the end.",
        "year": 2021
    },
    {
        "id": 12834,
        "title": "Chouette",
        "author": " Claire Oshetsky",
        "description": "An unsettling yet arresting exploration of the ferocity of motherly love that fiercely eviscerates society’s failure to accept nonconformity. This bizarre, fantastical and disturbing book is balanced by its music, dark humour and a writing style that is poetic and oddly hypnotic. It's definitely a test of reading agility as you emotionally absorb this tale as well as turn the pages.",
        "year": 2021
    },
    {
        "id": 12790,
        "title": "Listening Still",
        "author": " Anne Griffin",
        "description": "This is a tender and gentle read set in small town Ireland and a young woman who can talk with the dead. Jeanie’s life is thrown into confusion when her parents suddenly decide to retire. Where does this leave her? I could easily identify with Jeanie’s struggle. She leads a life full of doubt and sacrifice, and fears to lose it all. But she is a strong, loving character and I was rooting for her throughout.",
        "year": 2021
    },
    {
        "id": 12686,
        "title": "The Push",
        "author": " Ashley Audrain",
        "description": "This is a story, in no uncertain terms, about the pressure on women to be perfect mothers, to love a child unconditionally whilst hostage to feelings of anxiety, guilt, and self-doubt.  Set in an unnamed city, Blythe Connor delivers her version of events with a breathy urgency; concise chapters make for a tense, pacey read.  A psychological drama which will strike a chord with many women, regardless of whether they are mothers themselves.",
        "year": 2021
    },
    {
        "id": 12570,
        "title": "My Cat Yugoslavia",
        "author": "Pajtim Statovci",
        "description": "If you have a snake phobia, this is not the book for you. Bekim's family fled from Kosovo to Finland because of the war where Bekim acquires a boa constrictor. Kosvans hate snakes and Finns don't expect to find one in an apartment. Also Kosovans despise cats, and Finns rather like them. Especially dressed to the nines in a gay club. If you like bizarre, then this is the book for you.  That is all you need to know.",
        "year": 2017
    },
    {
        "id": 12994,
        "title": "Water Shall Refuse Them",
        "author": "Lucie McKnight Hardy",
        "description": "An isolated Welsh village, the heatwave of 1976 and the grief of losing a child create a stifling atmosphere for this coming of age story. The threat and foreboding builds as neglected and isolated Nif looks for answers, drawing on superstition, folklore and a taste for cruelty. This is an unsettling read; shocking and haunting.",
        "year": 2023
    },
    {
        "id": 12837,
        "title": "Other People's Clothes",
        "author": " Calla Henkel",
        "description": "Berlin in the early 2000s plays backdrop to this story of two American art students. With nods to popular culture of the time, especially the Amanda Knox case, this is a story that slowly reveals itself, and in doing so sends both main characters on an unstoppable downward spiral into a late-night, hedonistic and unpredictable city. The story can be dark,  taking you to uncomfortable places and dumping you there, but thrilling at the same time.",
        "year": 2021
    },
    {
        "id": 12939,
        "title": "The Sweetness of Water",
        "author": " Nathan Harris",
        "description": "Despite the serious topic, I found this a lyrical story, full of hope. After the abolition of slavery two brothers turn up at George's small farm and start working for him. His son Caleb was allegedly killed in the Civil War. When August, Caleb’s lover, kills one of the brothers out of panic and hate against the freed slaves, things heat up very quickly. The strength of the novel is in the grey tones: neither side is entirely good or bad.",
        "year": 2022
    },
    {
        "id": 13033,
        "title": "Peaces",
        "author": " Helen Oyeyemi",
        "description": "Set on a mysterious luxury train, this is a high velocity, surreal romp of a story. Journeying with non-honeymooners Xavier and Otto, the reader accumulates a bizarre collection of playful, dark and strange backstories. Reality, sanity and perception come into question as connections between the characters emerge. Prepare for the unexpected: for ancestral pet mongooses, paintings that can’t be seen but can be described and an invisible son.",
        "year": 2023
    },
    {
        "id": 13055,
        "title": "Chain-Gang All-Stars",
        "author": " Nana Kwame Adjei-Brenyah",
        "description": "This is a future US where violent criminals become idols and sex symbols and compete for freedom in Hard Action Sports. Physically and mentally tortured, they must kill or be killed in televised matches. Broad in scope and told from multiple perspectives, this violent novel packs a punch as it examines sin, redemption, prejudice and privilege. It’s a discomforting read interspersed with factual footnotes that show injustice is a reality.",
        "year": 2023
    },
    {
        "id": 12568,
        "title": "Ka: Dar Oakley in the Ruin of Ymr",
        "author": "John Crowley",
        "description": "It’s up to you, as the reader, to decide on which level to accept this fantasy - as a crow’s eye view of vast swathes of human history (in which, understandably, Corvid ingenuity plays a significant role), or as the psycho-fabulous imaginings of the narrator’s mind in terminal condition, with only a bird as companion. Either way, you'll be immersed in an objective oversight of the deep ironies of humanity's obsession with afterlife.",
        "year": 2017
    },
    {
        "id": 12639,
        "title": "Exit Management",
        "author": "Naomi Booth",
        "description": "A book that will grasp you in its cold grip. Controlling Lauren, determined to succeed but haunted by her past, meets Cal, a loser drifting through life with only his friendship with elderly Jozsef to keep him going. There’s an unease in the dark beauty of the language, the fragmented sentences and unpunctuated dialogue, though the book is not without hope and compassion.  An emotionally thrilling and psychologically probing read.",
        "year": 2020
    },
    {
        "id": 12785,
        "title": "We Are Not in the World",
        "author": " Conor O'Callaghan",
        "description": "Beginning in a haulage truck on the Dover-Calais ferry crossing, this road-trip soon veers from linear chronology and fractures into memories. These most strikingly focus on protagonist Paddy's intense yet oblique relationships with his daughter, his mother, and his lover. Haunted by loss and the desolation of anonymous edgelands travelled through, the book also brims with longing and wry humour. I found this a beautiful, disorientating read.",
        "year": 2021
    },
    {
        "id": 12669,
        "title": "Slash and Burn",
        "author": "Claudia Hernandez",
        "description": "You won’t be surprised that this serious story of the El Salvador civil war demands a bit of work especially to visualise the characters and locations, deliberately left anonymous. Told objectively from the point of view of a coping, determined woman, it’s a real eye-opener on survival in a conflict zone, populated by transient and brutal male characters and complex relationships. A tough read but worth the effort.",
        "year": 2021
    },
    {
        "id": 12724,
        "title": "The Manningtree Witches",
        "author": "A. K. Blakemore",
        "description": "A gripping account of a dark period in history. Yes, it's a tale of persecution, but one which side-steps the usual heroics and hysteria to focus on the women accused. Told (mostly) through the voice of one young woman, the narrative is laced with a pleasing tone of wry wit.  This is a story that crackles and fizzes with richly observed detail: of people, time and place; an absolute belter of a book.",
        "year": 2021
    },
    {
        "id": 12959,
        "title": "A Hunger",
        "author": " Ross Raisin",
        "description": "This is a novel about love and duty: about a woman's ambition to have a career and to excel in it, and how a woman is expected to put her husband first, especially when he becomes very ill and is dependent on her. This is what Anita has to deal with - and how she copes is the story that unfolds. Sufficient to say that coping is not easy and the demands of duty are very hard indeed.",
        "year": 2022
    },
    {
        "id": 13089,
        "title": "Lublin",
        "author": " Manya Wilkinson",
        "description": "Poland, 1907, three Jewish boys set off to walk to Lublin to sell brushes. Such a simple premise for a story that, in a way, matches the innocence of the boys as they begin. Along the way there are promises of food and girls, laughs, tales of mythic villages and jokes. The boys will endear themselves to you. But as the journey progresses the veneer of innocence fades as the future begins to cast a foreboding shadow - though the jokes remain.",
        "year": 2024
    },
    {
        "id": 11733,
        "title": "Flood of Fire",
        "author": "Amitav Ghosh",
        "description": "The tensions of the previous two volumes of the trilogy reach their epic and ethical denouements, as our characters' fates are bundled together in the whirlwind of the first Opium War. All the hypocrisy of Britain's imperial adventuring is laid bare. If you find some of the transcultural and psycho-spiritual categories hard to process, keep going - it is so worth the effort.",
        "year": 2015
    },
    {
        "id": 12636,
        "title": "The First Woman",
        "author": "Jennifer Nansubuga Makumbi",
        "description": "Kirabo is part of the first generation to begin breaking free from a class system in which men have total dominance over women and children. In this coming-of-age novel, she is shocked to find her beloved grandfather has a secret past that she could never imagine.  And who is her mother? At times funny, very moving and always engaging this story will find a place in your heart. I loved it.",
        "year": 2020
    },
    {
        "id": 13018,
        "title": "Nettleblack",
        "author": "Nat Reeve",
        "description": "Hold on tight for a whimsical romp with a subversive Victorian detective agency who challenge their society’s expectations about women, sexuality and gender whilst engaged in increasingly chaotic investigations. Told with wit, eccentricity and tenderness, this mysterious farce will have you gripped until the final page.",
        "year": 2023
    },
    {
        "id": 12512,
        "title": "Love and Other Thought Experiments",
        "author": "Sophie Ward",
        "description": "An ordinary domestic situation with a same sex couple deciding to have a baby. That’s the simple bit. What then follows - a birth, a death, a resurrection together with a complete time warp into the future - makes it all slightly complicated! Clever and well written, unusual and even a wee bit funny.",
        "year": 2020
    },
    {
        "id": 12586,
        "title": "The New Wilderness",
        "author": "Diane Cook",
        "description": "A post-apocalyptic world; a struggle to survive; an experiment with human guinea-pigs - and it all goes wrong.  There are many human stories told here - love stories, power struggles and conflict. At its heart is a mother-daughter relationship. A sad, affecting tale of a young girl coming to terms with life.",
        "year": 2020
    },
    {
        "id": 13112,
        "title": "The Ministry of Time",
        "author": " Kaliane Bradley",
        "description": "You take a leap of faith in this endearing and mind-bending quasi-futuristic romcom, that dances precariously between quirky humour and thought-provoking discussion on the challenges and choices we face in life and love. Original, playfully provocative with a thunderous plot beautifully written, resulting in compulsive storytelling. A time-travelling romp of a novel that subtly speculates on the future-altering power of the past and present.",
        "year": 2024
    },
    {
        "id": 12864,
        "title": "Recursion",
        "author": " Blake Crouch",
        "description": "If you could change your past, would you? That's the question at the heart of this rip-roaring speculative novel exploring memory, grief, consequences and death. Just when you think you have a grip on the story it suddenly confounds as you hurtle towards another disaster, leaving you wondering just how are the characters going to escape. A breathless and breath-taking read that will have you racing through the pages.",
        "year": 2021
    },
    {
        "id": 13164,
        "title": "The End of Drum-Time",
        "author": " Hanna Pylväinen",
        "description": "This is like no other book I've ever read, and also like every other I've read. The setting is so alien and remote but for all their differences I learned that people are just the same the world over. The characters are so well drawn - I loved them all - but the saddest part was coming to the last page and the final twist.  An unforgettable read.",
        "year": 2024
    },
    {
        "id": 12781,
        "title": "Daughters of Night",
        "author": " Laura Shepherd-Robinson",
        "description": "In this seemingly conventional historic thriller, the 18th century is brought vividly alive like a jigsaw puzzle of a hundred short chapters. I was drawn into both the corrupt high society and the dismal lives of the prostitutes, glad that Caro is determined to fight for justice when one of their number is murdered. Her anger at those responsible became mine too. The Furies, daughters of Night, will have their revenge.",
        "year": 2021
    },
    {
        "id": 12984,
        "title": "Frangipani",
        "author": " Celestine Hitiura Vaite",
        "description": "This is an acutely observed, funny, warm hug of a book and a real celebration of women's relationships - especially that between mother and daughter. You will fall in love with Materena and Leilani as they battle their way through Leilani's teenage years. And also feel deeply for Materena as the traditional Tahiti way of life she holds so dear, clashes with her urge to ensure her clever daughter has access to every opportunity she deserves.",
        "year": 2023
    },
    {
        "id": 13179,
        "title": "Going Home",
        "author": " Tom Lamont",
        "description": "I’m not sure three guys would be allowed to look after a two-year old like this but forget the realism and enjoy the acute perceptions of relationships – friendships, fathers and sons – which are totally believable. There’s so much empathy here, and for such different stages of life, it becomes a deeply emotional read.",
        "year": 2024
    },
    {
        "id": 13005,
        "title": "The New Life",
        "author": " Tom Crewe",
        "description": "From the opening erotic scene, this book is an amazing mix of physical details, intellectual analysis and moral dilemmas.  Passion and courage blend with self-obsession and disregard for others, especially women. The evocation of a moment when things could have been different for gay people, 100 years before they were, is extraordinarily moving.",
        "year": 2023
    },
    {
        "id": 13053,
        "title": "Fish Tale",
        "author": " Matthew Yorke",
        "description": "It starts with a dream, a missing painting and a fatal fishing accident - an incident around which multiple lives over numerous generations then revolve. Gambles are taken and decisions made on the flip of a coin for which the outcomes are far reaching and unexpected. This unusual read is as slippery as a fish. It’s playful, whimsical, even absurd but also asks big questions about chance, fortune and self determination.",
        "year": 2023
    },
    {
        "id": 12678,
        "title": "Scabby Queen",
        "author": " Kirstin Innes",
        "description": "Take a canvas, add daubs of Citizen Smith, splatters of a rousing pop anthem and frame with It's a Wonderful Life.  Not only a portrait of a complex and divisive woman, but a story with plenty to say about society, gender and celebrity.  The narrative comes from multiple perspectives, drawing the reader into the lives of all the characters, even those for whom Clio Campbell was a chance encounter.  I don't normally do politics, but I loved this.",
        "year": 2021
    },
    {
        "id": 13140,
        "title": "A Botanical Daughter",
        "author": "Noah Medlock",
        "description": "This novel is an original take on Frankenstein with two sympathetic queer guys who create their own daughter.  A living plant and lots of mystery - what’s not to like? The twists and turns are surprising and I certainly enjoyed the lightly macabre storytelling.",
        "year": 2024
    },
    {
        "id": 12541,
        "title": "You Exist Too Much",
        "author": "Zaina Arafat",
        "description": "A painful search for identity as the bi-sexual narrator attempts the seemingly-impossible: to find love and to please her traditional mother. Switching between New York, Beirut, Washington and the West Bank this is an often dizzying sequence of partners, cultures and countries given an immediacy by the first person narration.",
        "year": 2020
    },
    {
        "id": 12728,
        "title": "Unsettled Ground",
        "author": " Claire Fuller",
        "description": "Get ready for a deftly written story which dispels any illusion of a rural idyll. Focusing more on the folk than the flora and fauna - inadequate housing, lack of jobs and limited public transport are the reality. Beautiful, suspenseful and deeply moving, if, like me, you are a reader who likes a book that grips whilst making you think, this is it.",
        "year": 2021
    },
    {
        "id": 12489,
        "title": "Five Days of Fog",
        "author": "Anna Freeman",
        "description": "Florrie is part of a gang, shoplifting is the family business, and her mother Ruby, 'queen' of the all-female gang, is coming out of prison. But Florrie has met Ted and hopes for a different life ....  Set in London in 1952, this entertaining book conjures up a world of family loyalties and conflict set against a backdrop of post war austerity, bomb sites and dense fog.",
        "year": 2019
    },
    {
        "id": 12782,
        "title": "Light Seekers",
        "author": " Femi Kayode",
        "description": "This intelligent thriller is a story of long-calculated revenge which stirs up the deepest fears and unhealed wounds of the Biafran war. A forensic psychologist’s investigates the motivations behind the horrific killing of the Okriki Three. While this is clear in its scope, professional roles and personal safely are held hostage by the overriding desire for retribution - making for a tense and disturbing read.",
        "year": 2021
    },
    {
        "id": 13006,
        "title": "Sell Us the Rope",
        "author": " Stephen May",
        "description": "Young Stalin in London in 1907, still with a heart, and the magnetic, legendary figures surrounding him. This short novel fizzes with politics, spying and sexual attraction. It’s direct and pacy and so believable it’s exhilarating, even in the bits you know must be invented.",
        "year": 2023
    },
    {
        "id": 12961,
        "title": "Body Kintsugi",
        "author": "Senka Maric",
        "description": "There are flashes of humour but ultimately this is an intimate and brutal novella exploring a woman’s identity through her childhood with an abusive, alcoholic father, her abandonment by her adulterous husband, swiftly followed by a breast cancer diagnosis.  The short, poetic sentences make everything immediate, so it is both easy to read and yet gruelling as we watch her endure the endless, traumatic treatment.  Devastating but compelling.",
        "year": 2022
    },
    {
        "id": 13062,
        "title": "Tell Me I'm Worthless",
        "author": "Alison Rumfitt",
        "description": "An emotional rollercoaster that is heart-wrenching and inspiring, unflinching and visceral in its exploration of identity, mental health and self-worth. Its authenticity and rawness makes it a challenging but important read, and one that will resonate long after you finish the last page.",
        "year": 2023
    },
    {
        "id": 12558,
        "title": "Friend",
        "author": "Paek Nam-nyong",
        "description": "A beautiful insight into the life and mores of a communist society. I followed a judge who has been asked to settle a divorce between a young couple, but hesitates to do so to protect their young child. The judge’s search into the possibilities and limits of giving a helping hand made me reflect on the importance of the individual versus the interests of society. Alternately compassionate, moralistic, flowery, but above all so human.",
        "year": 2020
    },
    {
        "id": 12488,
        "title": "The Sea Cloak",
        "author": "Nayrouz Qarmout",
        "description": "Beautifully written stories which at times take on an almost ethereal quality. The joy of living overwhelms the feeling of frustration and fear in an oppressive occupation. Family life and the love of the Palestinian homeland are all important and the book gives us a rare insight into what it must be like to live in Gaza today. One to put onto your 'must read' pile.",
        "year": 2019
    },
    {
        "id": 12725,
        "title": "Hot Stew",
        "author": " Fiona Mozley",
        "description": "At its heart is the eviction of a group of female sex workers from their Soho brothel. Yet this multi-layered, multi-character story is far richer than its back page description suggests. Like a giant jigsaw puzzle, the narrative threads slowly come together as each character's backstory is revealed. I was expecting a sex novel, but instead discovered a surprisingly opulent tale of friendship and courage rivalling bureaucratic greed.",
        "year": 2021
    },
    {
        "id": 13034,
        "title": "The Bee Sting",
        "author": " Paul Murray",
        "description": "This is a novel full of insightful, witty observations and is a joy to read despite the countless dramas, conflicts, contradictions and fraught relationships. The foibles and failings of the characters are handled with stylistic brilliance and insightful tenderness. We truly feel included in the moral conflicts of their lives in this masterclass of convincing, captivating writing.",
        "year": 2023
    },
    {
        "id": 12767,
        "title": "The Last One",
        "author": " Fatima Daas",
        "description": "Told through repeated refrains like a prayer recital or affirmation, this is a fast, lyrical read. Each short chapter finds narrator Fatima, French of Algerian descent, examining the different, often conflicting, layers of her identity and the rules structuring her world – her faith, sexuality and family. Fatima’s generous honesty carries us with her, and makes for a sometimes abrasive, exhilarating and enlightening sharing of experience.",
        "year": 2021
    },
    {
        "id": 12936,
        "title": "Acts of Service",
        "author": " Lillian Fishman",
        "description": "Eve is a complex character, a lesbian in a relationship with a woman, who finds herself in another, secret polyamorous relationship, engaging in mostly heterosexual acts with a rich white guy ... cue much angst and elegant late-night discussions of desire, sexual norms and power.  Questioning queerness, control, feminism and more, I felt that whilst there was no final conclusion, perhaps prompting all these questions was the author's point?",
        "year": 2022
    },
    {
        "id": 12926,
        "title": "Vagabonds!",
        "author": " Eloghosa Osunde",
        "description": "Imagine a city created by a rather malevolent god and watched over by one of his guardian angels.  That city is Lagos and the angel looks after the 'vagabonds' - people attracted to the same sex, which is illegal in Nigeria.  This is a story about how they survive, undercover of the protection of the angel. It is a story of bewilderment, of defiance, of courage and, most of all, of survival against all the odds.",
        "year": 2022
    },
    {
        "id": 12990,
        "title": "Cursed Bread",
        "author": " Sophie Mackintosh",
        "description": "Although very loosely based on historical events, this is by no means a typical historical novel.  It feels dreamlike, otherworldly - and I felt a rising sense of panic, made worse by the unreliable narrator, Elodie.  It's difficult to understand what actually happens and what Elodie has imagined, but still I found myself caught up in her life, her thwarted passions and her web of secrets.",
        "year": 2023
    },
    {
        "id": 12693,
        "title": "Act of Grace",
        "author": " Anna Krien",
        "description": "This relatively short book covers a massive breadth of human experience in Australia, Iraq and the U.S. Reading it feels like pulling together tiny threads through fog as you begin to understand the connections between the many characters and places. But that fog doesn't obscure the unflinching portrayal of the bleak realities of contemporary life among those most vulnerable, or the enjoyment of finding the end of the thread.",
        "year": 2021
    },
    {
        "id": 12855,
        "title": "Luster",
        "author": " Raven Leilani",
        "description": "Brutally honest and authentically contemporary, we follow millennial Edie who, facing insecurity in her job and flatshare, embarks on an affair with an older white man. The book unflinchingly explores the intersections of sex, violence, race and power, and the losses experienced by Edie create an unsettling sense of numbness. But there is sharp humour too, and I was left feeling astonishment at the fluid beauty of the book’s language.",
        "year": 2021
    },
    {
        "id": 12601,
        "title": "Such a Fun Age",
        "author": "Kiley Reid",
        "description": "Confident, fast and easy – and also very unsettling. Surface embarrassments become deeper self-deceptions as white wokeness gets satirised pretty comprehensively in a plot that will keep you guessing. The 3-year-old is written brilliantly too – I’d like a sequel about her growing up.  ",
        "year": 2020
    },
    {
        "id": 12546,
        "title": "Grief is the Thing With Feathers",
        "author": "Max Porter",
        "description": "Crow is one of three narrators, together with Dad and Boys, who describe the aftermath of the wife/mother's death in a poignant, blackly comic and  sometimes bewildering manner. I was swept along in the family's experience of grief and loss through this disturbing, touching, powerful and linguistically inventive prose-poetry novella.  Not an easy read, both stylistically and plot-wise, but one that will definitely stay with you.",
        "year": 2016
    },
    {
        "id": 13073,
        "title": "The Coiled Serpent",
        "author": " Camilla Grudova",
        "description": "Most of these short stories are set in Clacton, one near Winnipeg and some at unspecified locations.  They are about young (or youngish) people struggling to survive, in one case in a post-apocalyptic world.  The protagonists are invariably selfish and unpleasant. You will get the feeling that Camilla Grudova does not have an optimistic, or even hopeful, view of humanity - but that said, she has the ability to hook you into reading each story.",
        "year": 2024
    },
    {
        "id": 12875,
        "title": "Mercia's Take",
        "author": " Daniel Wiles",
        "description": "This is a compelling read, offering a glimpse into the life of a Black Country miner and a vivid snapshot of 1870's industrial Britain.  Unremittingly bleak, Michael Cash's joyless existence plays out against a Mordoresque backdrop. Events are relayed in a staccato, spare style, words are fused, while the use of local dialect conveys a feeling of authenticity.  A pacey and original story which brings history to life - brace yourself and try it.",
        "year": 2022
    },
    {
        "id": 13011,
        "title": "Whale",
        "author": " Cheon Myeong-kwan",
        "description": "This story twists and turns through a magical and sometimes grotesque world of giants, tricksters, a girl who can communicate with elephants, a crone who  controls honey bees with a whistle, the building of a cinema and the making of many bricks. Full of surprises, violence and humour, this is a page-turner on an epic scale.",
        "year": 2023
    },
    {
        "id": 12922,
        "title": "Blood & Sugar",
        "author": " Laura Shepherd-Robinson",
        "description": "Atmospheric and tense, with clever plot twists that keep coming each time you think you’ve guessed what’s going on, this is a great read. Along the way you will also pick up more about how the slave trade worked in Georgian England than you ever knew before.",
        "year": 2022
    },
    {
        "id": 13092,
        "title": "Severance",
        "author": "Ling Ma",
        "description": "This thrilling new take on the zombie genre combines social commentary on globalism, capitalism, immigration and belonging while ratcheting up tension as a group of survivors struggle in a post-apocalyptic planet ravaged by disease. The story flips between present and the near-past as we learn more about a world in the midst of collapse. You will be hooked by the main character's resilience as she seeks hope and freedom from the fever.",
        "year": 2024
    },
    {
        "id": 13177,
        "title": "Somehow",
        "author": "David Downes",
        "description": "A witty English version of noir will take you down the recognisable streets of London and Brighton. It’s surprisingly warm and builds the tension as you’ll start to care for the world-weary protagonist’s survival. Full of unexpected observations of people and what they wear, or drive, or eat, it’s a rich and funny read. It was over before I was ready so I turned back and savoured it more slowly second time through.",
        "year": 2024
    },
    {
        "id": 12950,
        "title": "Brother",
        "author": "David Chariandy",
        "description": "This is a tender, beautifully composed book, voiced from the outsider perspective of Michael as two key timelines from his family life play out. At times it is brutal and there are outbursts of devastating violence. But there is so much articulate and generous emotion that, ultimately, hope can be felt - especially in the evocation of mix-music that enables culture to creatively intersect. In this deceptively slight book, every word matters.",
        "year": 2022
    },
    {
        "id": 12659,
        "title": "The Last Good Man",
        "author": " Thomas McMullan",
        "description": "Dark and brooding, like its moorland setting, this post-apocalyptic story is unsettling throughout.  I was keen to know more about Peck who is a realistically flawed human character, though I did feel I was left with more questions than answers at the end. Moments of calm normality jangle against violent, judgemental acts as you read about this small village, ruled by the power of words, struggling to survive.",
        "year": 2020
    },
    {
        "id": 13068,
        "title": "Bridge",
        "author": " Lauren Beukes",
        "description": "A breathtaking novel set in parallel universes. Jo is a traveller between these worlds, alongside her daughter, Bridget. They use a dreamworm for their journey - a parasite, capable of spreading infection through the multiverse. Over time, Jo recruits others to use the dreamworm, but then people get sick, people die and Jo goes missing. This leaves Bridget (older and now Bridge) and her partner Dom, with the task of finding Jo. Truly gripping.",
        "year": 2024
    },
    {
        "id": 12738,
        "title": "The Other Black Girl",
        "author": " Zakiya Dalila Harris",
        "description": "Genre-wise, this is difficult to pin down.  It moves from witty office politics to chilling social commentary on racial microaggressions, spinning into a creepy magical realism/science fiction thriller!  I actually had to read it twice to really grasp what was going on, but I was gripped both times!",
        "year": 2021
    },
    {
        "id": 12633,
        "title": "Pine",
        "author": "Francine Toon",
        "description": "I found this a mysterious, atmospheric and moving story about Lauren, a young girl and her alcoholic father, living in a remote spot in the rugged Highlands. Lauren misses her unconventional mother who disappeared when Lauren was just a small child. She has few friends and when one of them goes missing in the woods strange things happen ... \nAnd that's what grabbed me, drew me in and I was hooked.",
        "year": 2020
    },
    {
        "id": 12977,
        "title": "Jackal",
        "author": " Erin E Adams",
        "description": "Horror, thriller and fantasy meet in this novel, which kept me awake through the night wanting to see how it would end. Liz, a troubled black woman, visits her nearly all-white birthplace to attend the wedding of her best friend Mel. When Mel’s young daughter disappears, it sets in motion long-forgotten memories of a creature in the woods that abducts and maims little black girls. Tense, page-turning stuff.",
        "year": 2023
    },
    {
        "id": 12900,
        "title": "The Girl With the Green Eyes",
        "author": " J M Briscoe",
        "description": "What if the reason you felt you didn't fit in was because you were engineered that way? This novel follows Bella: the result of a eugenics program creating designer babies. Through twists and turns and flashbacks to her childhood, we learn about the sinister undertones of her early years, and why, as an adult, she is running. This is a fast paced thrill of a book, with some real ethical dilemmas at its heart.",
        "year": 2022
    },
    {
        "id": 12697,
        "title": "The Nickel Boys",
        "author": "Colson Whitehead",
        "description": "I think this book might be the definition of ‘rewarding’. Every chapter is a struggle not because of the writing style, which is clear and straightforward, but because the content is so sad. There’s little hope for the characters; it’s clear that nothing will get better for them. But as a reader it’s an opportunity to learn about a dark part of America’s history and present. It’s challenging, but you come out of it angry and armed with knowledge.",
        "year": 2021
    },
    {
        "id": 11948,
        "title": "Baba Dunja's Last Love",
        "author": "Alina Bronsky",
        "description": "Even though I’m left with questions regarding plot and purpose I could only admire and love the main character, Baba Dunja, for her drive and determination to have her home in the place she loves the most. She creates an almost magical world in which the living and the dead are both real and seem to support each other. Mixed with humour and compassion it makes a very enjoyable read.",
        "year": 2016
    },
    {
        "id": 12808,
        "title": "The Wild Fox of Yemen",
        "author": " Threa Almontaser",
        "description": "In a very distinctive and unique style, mixing cultures and languages, a colourful palette of feelings - rebellion, submission, estrangement, compassion - comes to life. This powerful voice of a woman who uses metaphors and rhythm in a forceful, yet melodious way punches you  in the gut or moves you by unexpected turns of phrase. The more often you read them, the more you will discover the hidden gems within these extraordinary poems.",
        "year": 2021
    },
    {
        "id": 13069,
        "title": "Pink Slime",
        "author": " Fernanda Trías",
        "description": "This is a powerful and engaging novel set in a world that may be just around the corner. The port is is crumbling, the river is full of dead fish, and a red wind blows through the streets. Food is hard to find and those who can have  moved inland. The unnamed narrator struggles to survive whilst reflecting on her relationship with her husband and mother. A chilling tour de force as the reader feels trapped also in this shrinking world.",
        "year": 2024
    },
    {
        "id": 12522,
        "title": "The Diary of Andy Angus",
        "author": "Joe Brewer-Lennon",
        "description": "This self-published, autobiographical novel sparkles with tender honesty and nuanced black humour as Andy confides in his diary over the breakup of his long-term relationship and the succession of disastrous encounters that follow throughout 2010. By New Year 2011, you'll know the Edinburgh gay scene very well.",
        "year": 2019
    },
    {
        "id": 12576,
        "title": "The Doors of Eden",
        "author": "Adrian Tchaikovsky",
        "description": "All fantasy has a big ask in terms of credibility - this is all the more gripping for being rooted in alternative evolutionary histories which threaten to collide as the entropy point approaches. Definitely for those who like their minds opened by the doorways which connect our universe to the multiverse.",
        "year": 2020
    },
    {
        "id": 11859,
        "title": "Human Acts",
        "author": "Han Kang",
        "description": "The toxic fallout of cruelty and suffering is unflinchingly portrayed. We are the witnesses of massacre and degradation and it is as if the sentences have nerve endings and we too feel the pain. Told from the viewpoint of different characters, the writing lacerates and haunts, questioning humanity and implicating everyone. This is harrowing storytelling and yet compulsively readable and deeply resonant.",
        "year": 2016
    },
    {
        "id": 12540,
        "title": "A Burning",
        "author": "Megha Majumdar",
        "description": "With a style that put me straight into India I felt almost personally abused by the injustice and corruption that influences the lives of the underdogs in society. At the same time, it delivers a warmth of understanding human nature  that acts as an appeal for compassion for all three main characters.",
        "year": 2021
    },
    {
        "id": 12632,
        "title": "Reproduction",
        "author": "Ian Williams",
        "description": "What makes a family? This ambitious novel has an innovative experimental structure, including intertextual play, song lyrics, rap and slang, with the emphasis on character rather than plot. It’s a transformative style of storytelling which gives a fresh spin on topical themes of multiculturalism, race, me-too, and white privilege, guaranteed to challenge your expectations - if not your perceptions.",
        "year": 2020
    },
    {
        "id": 12921,
        "title": "The Lamplighters",
        "author": " Emma Stonex",
        "description": "Three men vanish from a lighthouse sounds like it’s going to be a drama of action or supernatural forces. Instead, this book will give you a quiet, intense experience of love and grief, with a depth of understanding of what goes wrong between people that makes it unforgettable.",
        "year": 2022
    },
    {
        "id": 12772,
        "title": "Checkout 19",
        "author": "Claire-Louise Bennett",
        "description": "This collection of auto-fictional anecdotes of growing up is narrated in a stream of consciousness, peppered with digressions and fascinating insights into the mundane realities of living. The intimate writing style can become mesmerising, needing much concentration on the reader’s part, but it packs a strong emotional punch. In fact, I reckon it’s the best way to getting inside another person’s mind.",
        "year": 2021
    },
    {
        "id": 12798,
        "title": "Bewilderment",
        "author": " Richard Powers",
        "description": "The natural world is the standout star of this book which tells the tale of a father, Theo, and his young son, Robin. There is no denying the beauty in the writing, which puts you right there, in the wilderness, with them. But on any page it can also deliver an emotional punch. Like the passing of a season the story slowly unravels; it is not one to race through. Instead, let the book grow and it will give you much to contemplate.",
        "year": 2021
    },
    {
        "id": 13002,
        "title": "Cuddy",
        "author": " Benjamin Myers",
        "description": "The immense personality and legacy of St Cuthbert (Cuddy) shines through every page of this alternative history of Northeast England. It could have been like a novel by Tolstoy – a saga of the significance of common people - but although epic in dimension, it defies genre. Instead it delivers a forceful fusion of scholarly hagiography, psychic poetry, wonderment at architectural triumph and a profound empathy for the victims of history.",
        "year": 2023
    },
    {
        "id": 13183,
        "title": "All the Colours of the Dark",
        "author": " Chris Whitaker",
        "description": "Patch Macaulay saves a girl only to be abducted and imprisoned himself. When he eventually escapes he is determined to find Grace, the girl who shared the darkness with him and made his captivity bearable. This is an epic love story -  and a murder mystery - spanning several decades. A big book but a real page-turner.",
        "year": 2024
    },
    {
        "id": 12940,
        "title": "Isaac and the Egg",
        "author": " Bobby Palmer",
        "description": "This is a hugely emotional read that will seep into your every waking moment – and maybe even your dreams. It's suffused with warmth and sadness but pockets of real humour bring light in the darkness. The overriding feeling is one of love, which shines as a beacon through Isaac's pain and loss. But what about the story – and who or what is the egg? Impossible to describe in a few words – so please just read the book and discover for yourself.",
        "year": 2022
    },
    {
        "id": 12907,
        "title": "Mister N",
        "author": "Najwa Barakat",
        "description": "This raw and probing novel charts the pain, suffering and cruelty of its protagonist in an unstable narrative which mirrors their mental state. A shocking, claustrophobic and destabilising read, Mister N explores physical and mental resilience and misery in a Lebanan represented as a country divided by poverty and damaged by war.",
        "year": 2022
    },
    {
        "id": 12719,
        "title": "Super Host",
        "author": " Kate Russo",
        "description": "Our hapless protagonist, going through a mid-life crisis in his love life and work, rents out his house on Airbnb - cue for an engaging series of guests and their emotional problems. The humour is subtle, underscored with character-revealing dialogue and sardonic inner musings. And although there’s a poignant underlying theme of loss and loneliness, it is entertaining, raunchy, and enormous fun - with the added bonus of lessons in creating art.",
        "year": 2021
    },
    {
        "id": 12598,
        "title": "An Unkindness of Ghosts",
        "author": "Rivers Solomon",
        "description": "An invented future world becomes an incisive commentary on the unequal history of our real world - the decks of the spaceship are literally stratified. This analysis of the multigenerational trauma of a slave society - and how people cope with it and even rebel – will draw you in with its empathy. It’s also a fast adventure story with strong, unexpected characters who will change preconceptions about gender and sexuality.",
        "year": 2017
    },
    {
        "id": 12757,
        "title": "Nightbitch",
        "author": " Rachel Yoder",
        "description": "Subversive and powerful, this one grabs you by the throat.  A young artist navigates her way through the complexities and traumas of motherhood and the physical and mental changes that threaten to overwhelm her. Mysticism and the folklore of her Appalation heritage influence her decisions in this quirky and outrageous tale. The read is intimate and graphic, earthy and darkly funny. The, at times, surreal narrative pulls no punches.",
        "year": 2021
    },
    {
        "id": 12663,
        "title": "Everything Is Going to Be Great",
        "author": " Rachel Shukert",
        "description": "These cautionary tales of a young American woman on a raunchy romp of one-night stands with dubious men is new take on the innocent abroad. The lurid details of her sexual exploits in Amsterdam and Vienna are at times buttock-clenchingly frank, but the vulgar and sometimes irreverent anecdotes are rendered highly entertaining by her self-deprecating acerbic Jewish humour.",
        "year": 2021
    },
    {
        "id": 12715,
        "title": "Red Pill",
        "author": " Hari Kunzru",
        "description": "This compelling, intelligent and thought-provoking novel demands the reader to put aside their squeamishness and confront society’s malignant reality. There is a disquieting counter-narrative that jumps and bucks with unsparing political observations. The unreliable narrator puzzles and exasperates and yet also haunts and taunts.",
        "year": 2021
    },
    {
        "id": 12982,
        "title": "History. A Mess.",
        "author": "Sigrún Pálsdóttir",
        "description": "A mistaken interpretation of a historic manuscript transports the narrator, elated in the belief she has discovered England’s first female artist. But what follows in the writing of her thesis and the realisation of the error, plummets her into freefall. As her personality disintegrates, the journey through her mindscape will chill you with its overlay of everyday relationships and the question – what is true, what is real?",
        "year": 2023
    },
    {
        "id": 12734,
        "title": "Klara and the Sun",
        "author": " Kazuo Ishiguro",
        "description": "Such a simple read but goes so deep. Gentle yet tense with what’s going on under the surface; melancholy and hopeful at the same time. Can an Artificial Friend be more loving and more generous than a real human being? Klara’s innocent voice constantly shows up the deep needs beneath the artificiality of our ordinary human relationships. Unforgettable.",
        "year": 2021
    },
    {
        "id": 13049,
        "title": "Salt Slow",
        "author": " Julia Armfield",
        "description": "Slyly beautiful, and with a teasingly unnerving relationship to reality, this short story collection will seductively detour you into the uncanny. This is a place where boundaries blur and merge: between land and sea, skin and bone, human and animal, the mythic and the everyday. The horror-lore of vampires and werewolves lurks here, but only in shadow-glimpses; what gives this collection its greatest power is its profound emotionality.",
        "year": 2023
    },
    {
        "id": 12566,
        "title": "The Death of Vivek Oji",
        "author": "Akwaeke Emezi",
        "description": "This authentic novel is based on the autobiographical experience of growing up and identifying as genderfluid in Aba, Nigeria. The intense emotion of losing Vivek washes all shades of outrage and guilt into a single portrait of a beautiful soul. A heart-wrenching universal experience of being diminished by the death of a child and friend who was never truly understood. Prepare yourself for a deeply immersive read in every way.",
        "year": 2020
    },
    {
        "id": 12924,
        "title": "Farewell Fountain Street",
        "author": " Selcuk Altun",
        "description": "You wonder if the bibliomaniac mindset, tumbling with shards of inspiration from writers celebrated and obscure, is a cover for Artvin’s disingenuous weaving of fiction into his CV. Just revel in the uncertainties as the skeletons in the Ottoman cupboards rattle their bones and create havoc in this acutely observed, mystery thriller.",
        "year": 2022
    },
    {
        "id": 12846,
        "title": "Hard Like Water",
        "author": " Yan Lianke",
        "description": "This epic story of illicit love amongst revolutionary fervour is told with such evocative beauty that even the challenging parts are a joy to read. A sharp satirical edge cuts through the text, keeping what could be a heavy read both entertaining and accessible.",
        "year": 2021
    },
    {
        "id": 12908,
        "title": "Phenotypes",
        "author": "Paulo Scott",
        "description": "Federico, mixed-race but white passing, struggles with the privilege he experiences compared to his darker skinned brother. Past incidents reveal Federico's motivations for his work for racial equality and conflicts between theory and lived experience are exposed. The stream of consciousness narrative, though challenging, gives a close connection to the protagonist and makes for an intense, thought provoking read.",
        "year": 2022
    },
    {
        "id": 13155,
        "title": "Mammoth",
        "author": " Eva Baltasar",
        "description": "A nameless young narrator seems to be on a quest to strip everything back to the elements and expose herself to nature in all its raw extremity. The first person narrative takes you deep into her psyche, but without the relief of understanding her motives - beyond the need to live life on the edge. At the end, I was keenly affected by the power and darkness of this tiny book - even though it left me comfortless. A curiously compelling experience.",
        "year": 2024
    },
    {
        "id": 12758,
        "title": "Ghost Forest",
        "author": " Pik-Shuen Fung",
        "description": "This is the story of a family who leave Hong Kong, before it was handed back to China, to settle in Vancouver. Its focus is the daughter's meditation on the death of her father and about what she learns about the rest of her family in that process. It is neither morbid, nor depressing, but instead a straightforward account of family cohesiveness. A simple tale but with great resonance.",
        "year": 2021
    },
    {
        "id": 12602,
        "title": "An American Marriage",
        "author": "Tayari Jones",
        "description": "This goes deep, what a powerful read. It has all the accuracy and sharpness of brilliant relationship dissection but set in a bigger context of terrible injustice and the burdens that creates. It is tender and dignified and beautifully told.  ",
        "year": 2019
    },
    {
        "id": 12708,
        "title": "Seven Years of Darkness",
        "author": " You-jeong Jeong",
        "description": "A young girl is found dead in Seryong Lake. Three men know part of the truth: the girl's father, and two security guards at the nearby dam. One of the guards is convicted of murder. Seven years later his son tries to piece together what really happened. A thriller with a distinctly Korean flavour. You will find yourself right inside the heads of these troubled characters as they try to survive in a world as murky as the waters of the reservoir.",
        "year": 2021
    },
    {
        "id": 12988,
        "title": "Tomorrow, and Tomorrow, and Tomorrow",
        "author": " Gabrielle Zevin",
        "description": "Moving fluidly between childhood and adulthood, this tale of bittersweet friendship, love and loss across time between indie computer game designers Sam and Sadie buzzes with breath-taking creativity and emotion. Don't feel deterred if you're not a gamer: the book is thrillingly accessible and has a huge, generous - and sometimes devastating - heart. Slot another coin in the arcade: you'll never want to leave the worlds this read creates.",
        "year": 2023
    },
    {
        "id": 12889,
        "title": "When I Sing, Mountains Dance",
        "author": " Irene Solà",
        "description": "This highly poetic novel showed me a small mountain community where people live in symbiosis with animals, nature and the spirit world. I felt the cruelty of life, the resilience of the people and the beauty of seeing and accepting what is there. Told from different perspectives, be it human or non-human, the language has a beautiful echoing rhythm, ranging from astoundingly poetic to down-to-earth, all resonating in your head for a long time.",
        "year": 2022
    },
    {
        "id": 12594,
        "title": "Mostly Dead Things",
        "author": "Kristen Arnett",
        "description": "An exploration of how grief and loss can rupture families, this book allows its characters to be flawed, ugly, and infuriating while they process the ways in which their world has changed, and the ways in which it has always stayed the same. The story wallows in the reality of the world around them, the grime, the humidity, creating a sense of claustrophobia, along with the static nature of the characters’ lives.",
        "year": 2019
    },
    {
        "id": 12985,
        "title": "Of Women and Salt",
        "author": " Gabriela Garcia",
        "description": "What a lot to pack into one short book!  I got totally caught up in each successive generation as the story moved from Cuba to Miami, El Salvador to Texas. The voices are so strong and honest, it’s a moving exploration of women’s strengths and their failures – and a quietly devastating analysis of what they are up against.",
        "year": 2023
    },
    {
        "id": 12557,
        "title": "A Man",
        "author": "Keiichiro Hirano",
        "description": "This is a story of the sins of the fathers being visited upon the sons, or, in this case, a particular son, Hiro. It is the story of how he tries to rebuild his life after his father has committed murder. It's also the story of Akira Kido, a Korean-descended divorce lawyer, who acts as a private detective to find out what had been going on.  A tale that will take you on a quest for identity into the dark heart of modern Japan.",
        "year": 2020
    },
    {
        "id": 12634,
        "title": "Black Rain Falling",
        "author": "Jacob Ross",
        "description": "Set on an imaginary Caribbean island, this second outing for Michael 'Digger' Digson and his formidable partner, Miss Stanislaus, also works as a stand-alone story. Determined and loyal, they care about each other and the people they aim to protect. The smallness of place belies a bigger world with an interesting breadth of characters; I relished too the rhythms of the local dialect.  A book which really gets under your skin, but in a good way.",
        "year": 2020
    },
    {
        "id": 11091,
        "title": "The Brothers",
        "author": "Asko Sahlberg",
        "description": "Strong and bitter as Finnish coffee; cold and beautiful like the tracery of ice over a frozen window, this story skates along the tight bonds of a farming family, and dances through the chasms that separate individuals' views of the world.",
        "year": 2012
    },
    {
        "id": 13081,
        "title": "Gaslight",
        "author": " Femi Kayode",
        "description": "This is a taut thriller set in Nigeria, where Philip Taiwo has to deal with the corruption of a major Pentecostal church, led by Bishop Jeremiah Dawodo.  When his wife Sade disappears all hell breaks loose and Philip, his family and his friends are held in a python's grip of circumstances that they have to try to control.  If you start reading this at bedtime, resign yourself to a night without sleep because it is too good to put down.",
        "year": 2024
    },
    {
        "id": 13031,
        "title": "Now You See Us",
        "author": " Balli Kaur Jaswal",
        "description": "This is a tale of the friendship group of Filipino maids working in Singapore, which would be light-hearted but for the unthinking exploitation of their employers, and the threat of execution hanging over Flordeliza when she is framed for murder. Downtrodden girl power at its best!",
        "year": 2023
    },
    {
        "id": 12986,
        "title": "Wivenhoe",
        "author": " Samuel Fisher",
        "description": "The story takes place in an alternative present; a world made small by isolation and the need to survive. A violent murder has taken place but the tale that follows contains tenderness as well as menace. It is told in turns by the perpetrator’s stepmother and brother with a beautiful honesty through which you feel their despair, anger and loss.",
        "year": 2023
    },
    {
        "id": 13039,
        "title": "Patricia Wants to Cuddle",
        "author": " Samantha Allen",
        "description": "A unique and bitingly entertaining cocktail of reality TV satire and gory body-horror, this read will gleefully keep you on your toes. Set in the final stages of a reality TV dating show, we follow the power-plays of the remaining contestants where nothing is off-limits in their bid to win. It's a thrillingly fast and wild ride, often bloody and monstrous, but ultimately a hopeful one of queer solidarity and survival, both human and Sasquatch.",
        "year": 2023
    },
    {
        "id": 12617,
        "title": "Who They Was",
        "author": "Gabriel Krauze",
        "description": "Nineteen year old student Gabriel indulges in extreme violence and crime ‘just for the fun of it’. The prison scenes are particularly brutal. I found this a difficult read not just for the content, but also for the dialect used. Having said that, there are some beautiful descriptive passages. It is worth the effort required to enter this other world - if only for as long as it takes to read the book. A debut novel and an author to watch.",
        "year": 2020
    },
    {
        "id": 13098,
        "title": "A Sign of Her Own",
        "author": " Sarah Marsh",
        "description": "Fiction, partly based on fact, and very interesting from a historic perspective, this book is a gentle exploration of Ellen's silent world as a deaf person. Alexander Graham Bell is Ellen's tutor in Visible Speech. I related easily to Ellen's struggle and her feelings towards Bell and her passion for her friend Frank. The book is no less than a triumph.",
        "year": 2024
    },
    {
        "id": 12963,
        "title": "Remarkably Bright Creatures",
        "author": " Shelby Van Pelt",
        "description": "This charming novel seems to be about a rather unlikely alliance between a captive giant octopus, nearing the end of his days and an elderly woman. But there is also a young man searching for his father. I couldn’t quite work it out, at first. But it's an intriguing, sad, funny, heart-warming, maybe slightly over the top story  - and certainly one of a kind!",
        "year": 2022
    },
    {
        "id": 12816,
        "title": "The Wrong End of the Telescope",
        "author": " Rabih Alameddine",
        "description": "You expect a book about refugee migration and medical aid might feature horrific terror, suffering and loss on an epic scale. The personal experiences of hope and passivity are brought into sharp focus by Mina's limited ability to help, with scarce supplies and compassion fatigue. For me, the telling aspect is the biting portrayal of young volunteers whose only concerns are inflating their online profiles and where their hormones might lead them.",
        "year": 2021
    },
    {
        "id": 13035,
        "title": "Mater 2-10",
        "author": " Hwang Sok-yong",
        "description": "The chatty, descriptive style helps Westerners cope with the unusual combination of beneficent ghosts, railway engineering technicalities, the brutality of Japanese occupation and exploitation, and the strength of soul shown by the Korean workers’ resistance through the generations. All credit to the painstaking translators who set out their approach in the introductory note - and the author’s afterword evidences historical and moral authority.",
        "year": 2023
    },
    {
        "id": 13108,
        "title": "Your Utopia",
        "author": "Bora Chung",
        "description": "Restlessly inventive, these short-stories offer glimpses into imagined futures: often dystopian, always influenced by now, with the pandemic a feverish influence, and the brutality of industrialisation a constant dread. This is a read that will shock and delight you in its agility, placing you in the perspective of narrators - both human and non-human - that you may never have experienced before. Breathtakingly innovative, identifiably humane.",
        "year": 2024
    },
    {
        "id": 11650,
        "title": "The Sorrow of Angels",
        "author": "Jón Kalman Stefánsson",
        "description": "I really loved this tale of life and philosophy in the frozen north, told in the historical footprints of the Icelandic Sagas. Don’t expect action adventure, think more of deep introspection and hallucinatory weather conditions. It may seem a bit hard to follow at the outset, but things will become clearer and it might help to know that it is the middle book of a trilogy.",
        "year": 2014
    },
    {
        "id": 13064,
        "title": "Semiosis",
        "author": " Sue Burke",
        "description": "This journey of survival in an alien environment across generations is both exhilirating and touching. You will flinch at the brutality of the world but be unable to put the book down until you find out how the humans will pull through. The exploration of the symbiotic relationship between the settlers and the planet's sentient plant life will fascinate anyone with an interest in climate and ecology.",
        "year": 2024
    },
    {
        "id": 12673,
        "title": "Winter in Sokcho",
        "author": "Elisa Shua Dusapin",
        "description": "I found this a quietly intense read. The cold, bleak realism of the out of season seaside town on the border of North and South Korea is the perfect setting for a disquieting exploration of identity. The young woman at the centre fights to see and be seen, working through the opposing pressures of modern and traditional societies; French and Korean culture; body image and desire. Beautiful, disturbing and very real.",
        "year": 2021
    },
    {
        "id": 12761,
        "title": "Three Rooms",
        "author": " Jo Hamya",
        "description": "What at first appears to be a novel about the problems of a self-involved millennial, slowly becomes a novel about politics, class, race and privilege.  This was a story that knew exactly how to push my buttons, candidly observed and feeling very true to life.  Certainly a book which will divide opinion, but I found myself rooting for this young woman of colour, striving to find her place.",
        "year": 2021
    },
    {
        "id": 13110,
        "title": "The Jinn Daughter",
        "author": " Rania Hanna",
        "description": "In a tale of jinns, middle-eastern mythology and the underworld, this vibrant story resonates with imagination, magic and compelling fairy-tale vibes. A moving portrait of a mother’s love and her desperation to outmanoeuvre death is presented with fascinating characters and an evocative writing style. Storytelling is at the heart of this ambitious Arabian tale in a unique exploration of the concepts of grief and the will to live.",
        "year": 2024
    },
    {
        "id": 12666,
        "title": "Hall of Smoke",
        "author": "H.M. Long",
        "description": "Long and exceedingly violent fantasy adventure with a huge cast of Old Gods, New Gods, Vestiges and various combinations of all three - together with several races of possibly humans - in a quest to find and kill a rival God.  Dramatic and vivid descriptions of the landscape, the vegetation and the animals. Definitely an escape to another world - but perhaps not one you would wish to live in!",
        "year": 2021
    },
    {
        "id": 12786,
        "title": "Mrs Death Misses Death",
        "author": " Salena Godden",
        "description": "It took me a little while to get into this unusual and imaginative novel, but then I really loved it. It’s written in a beautiful combination of poetry and poetic prose. Be aware - the language is ripe and there is much sorrow but it’s also warm and witty. And it doesn’t shy away from big, topical issues – Me Too, Black Lives Matter, anti-patriarchy. Packs a real punch.",
        "year": 2021
    },
    {
        "id": 13102,
        "title": "River Spirit",
        "author": " Leila Aboulela",
        "description": "Set in Sudan in the 1890s during the Mahdi uprising, this novel echoes with voices and stories through the ages – and all moved me. But the strongest voice for me is that of the orphan Akuany, telling her experiences. It left me feeling angry and sad that mankind never learns that war brings nothing but grief; that religion can never be an excuse to slaughter others; that skin colour does not matter and all human beings are hurt in the same way.",
        "year": 2024
    },
    {
        "id": 12284,
        "title": "Arkady",
        "author": "Patrick Langley",
        "description": "Brothers Jackson and Frank can only trust each other as they try to escape from a world of civil unrest, authoritarian government, abandoned buildings and catastrophic climate change. We are not told where or when the novel is set but it seems like London and it is certainly not very far in the future. There are some good people in this harsh world but this is a powerful warning to us all.",
        "year": 2018
    },
    {
        "id": 13141,
        "title": "Passiontide",
        "author": " Monique Roffey",
        "description": "Set on an imaginary Caribbean island, this almost-detective story spins into a vibrant protest against femicide and domestic abuse. Like a call to arms, caught up in the women’s passionate anger and fragile hope, I was ready to join them!  Somehow, the men avoid becoming the villains, instead portrayed with empathy, and the book resonates with the many systemic issues at play: colonialism and slavery, violence and poverty, race and gender.",
        "year": 2024
    },
    {
        "id": 12579,
        "title": "Mordew",
        "author": "Alex Pheby",
        "description": "Reading Mordew is akin to what I assume is a bad acid trip!  Whilst this tome of a Gothic fantasy novel is ambitious, imaginative and readable, it's also vile, nauseating, freaky with, let's be frank, obnoxious characters.  When I finished reading it it made me feel like there was dirt under my fingernails that refused to budge.  Saying that, it was actually a great book and well worth the hours it took me to finish it.",
        "year": 2020
    },
    {
        "id": 12716,
        "title": "Minor Detail",
        "author": " Adania Shibli",
        "description": "This book explores the minutiae of life under occupation, making the reader feel the fears, frustrations and brutalities. It confronts you with war's atrocities and is brave enough to withhold narrative judgment to allow you to make up your own mind. Uncomfortable and at times harrowing, yet ultimately an important novel about the forgotten voices in war that deserve to be heard.",
        "year": 2021
    },
    {
        "id": 13066,
        "title": "No One Dies Yet",
        "author": " Kobby Ben Ben",
        "description": "A thrilling, sometimes disturbing tale and an unusual take on a murder story. Three black gay Americans arrive in their ancestral home of Ghana for the 'Year of Return' celebrations, facing hostility on two fronts: for being gay and from native Ghanaians resenting outsiders taking over their homeland. Narrated in turns by their two guides, one gay and the other homophobic, their relationship is one of the most intriguing aspects of the book.",
        "year": 2024
    },
    {
        "id": 12776,
        "title": "Nervous System",
        "author": "Lina Meruane",
        "description": "Anxious astrophysicist Elle's efforts to finish her doctoral thesis are usurped in this introspective story.  Her observations and dissections of strained relationships and her experience of trauma, illness and death are revealed in a searching, often surreal, graphic narrative.  Time frames shift and and show the past and the present as physical places with much to reveal about political landscapes fraught with danger.",
        "year": 2021
    },
    {
        "id": 12495,
        "title": "Tiger",
        "author": "Polly Clark",
        "description": "Two continents and two totally different lives collide in this powerful, raw and at times, disturbing read.  It's not disturbing in a frightening kind of way, but it does concentrate on the reality and harshness of the natural world.  Entwined through the story are the Siberian tigers: majestic, ruthless, beautiful and predatory.  After reading this I'm still undecided on keeping animals captive.  I'd be interested to hear your views.",
        "year": 2019
    },
    {
        "id": 12973,
        "title": "The Things That We Lost",
        "author": " Jyoti Patel",
        "description": "Nikhil knows there is more to his father's death than his mother is telling him, but how easy is it to find out the truth when nobody wants to talk about it? The characters in this book are so real to us we love them as though they were our own. Nikhil is suffering at a vulnerable stage in his life and I just wanted to shield and protect him. A brilliant first novel \n - hopefully the first of many.",
        "year": 2023
    },
    {
        "id": 12561,
        "title": "The Silence of the White City",
        "author": "Eva Garcia Saenz",
        "description": "Tasio is in jail serving a sentence for a number of ritualistic murders committed twenty years ago but just as he is about to be released, the murders begin again. Inspector Ayala must decide whether these are copycat murders, if Tasio is controlling an assassin from within jail, or whether Tasio is an innocent man. This is a complex and compellingly intelligent crime novel. I was hooked all the way.",
        "year": 2020
    },
    {
        "id": 13047,
        "title": "Best of Friends",
        "author": " Kamila Shamsie",
        "description": "If you still have bonds with childhood friends even though you've taken different directions, this book will resonate profoundly. Its easy and thoughtful evocation of two talented women making careers and relationships across decades and continents is quietly astonishing. Perceptive, vanity-puncturing and unexpectedly hopeful.",
        "year": 2023
    },
    {
        "id": 12865,
        "title": "Supper Club",
        "author": " Lara Williams",
        "description": "Discomforting with delicious morsels, this coming of age novel is set across two formative times from protagonist Roberta’s life: the abusive, domineering relationships she experiences with men as an undergraduate, and self-assertion through food and friendship in her late twenties. Cusp-of-adulthood millennial uncertainty finds release in the physically evocative food writing. A searching, hedonistically appetising read.",
        "year": 2021
    },
    {
        "id": 12604,
        "title": "Swimmer",
        "author": "Bill Broady",
        "description": "If you've ever been obsessive about anything, you might find this book uncomfortably close to the truth. A dense, bleak tragedy, told in words which feel more like a piece of music. Written by a man, yet one of the most feminist books I've ever read. ",
        "year": 2000
    },
    {
        "id": 12954,
        "title": "Pyre",
        "author": " Perumal Murugan",
        "description": "An intimately drawn story of forbidden love set in the villages of southern India. Told in translation, the read has a powerful simplicity and growing intensity. We follow Kumaresan and Saroja, young lovers from different castes, whose relationship sees them become a target of hostility and violence. At once both a touchingly tender portrait of the resilience of love, and a horrifyingly harsh evocation of brutal societal unacceptance.",
        "year": 2022
    },
    {
        "id": 13171,
        "title": "Blood and Guts in High School",
        "author": " Kathy Acker",
        "description": "This raw and intense novel is a surreal, visceral and exhilarating read. It explores identity, sex and rebellion in an unconventional and experimental style that includes text, drawings, letters, poetry and dream visions. Fans of punk culture and feminist literature will love this book but expect your boundaries to be pushed to the limit!",
        "year": 2024
    },
    {
        "id": 12702,
        "title": "The Voice in My Ear",
        "author": "Frances Leviston",
        "description": "There's a connected, everywoman feel to these short stories with a different Claire in each one.  Whilst a couple casually wander into the realms of sci fi, fantasy and horror they are still, overall, rooted in the gritty, mundane realities of life and relationships.  Mothers feature significantly, but also other familial relations, and whilst the writing is highly descriptive, almost poetic, the tone is dark and unsettling.",
        "year": 2021
    },
    {
        "id": 12616,
        "title": "Burnt Sugar",
        "author": "Avni Doshi",
        "description": "This candid portrayal of a fraught mother-daughter relationship is unflinching in its details of bad mothering and childhood neglect, as narrated by the daughter. There is acerbic black comedy amidst the bitterness, and vivid sensual descriptions as potent and spicy as a hot curry, but some readers may be disturbed by the voyeuristic descriptions of female bodily functions.",
        "year": 2020
    },
    {
        "id": 12717,
        "title": "Upright Women Wanted",
        "author": " Sarah Gailey",
        "description": "Gun-toting queer librarians leading a spirited resistance to government propaganda? Don’t knock the concept: this gritty dystopian novella with its Wild West backdrop not only subverts that old trope but makes it relevant to contemporary problems in modern society such as perpetual war and depressed economies. Will appeal to young adults as well as the non-binary LGBOT+  audience.",
        "year": 2021
    },
    {
        "id": 12562,
        "title": "Rainbow Milk",
        "author": "Paul Mendez",
        "description": "A rags to riches story with an unexpected family twist at the end. A young, gay, black man and dedicated (‘a Disciple’) Jehovah Witness leaves his home in the UK Midlands to seek his fortune in London. Readers should be aware of the extremely graphic descriptions of the male gay scene. Great believable characters and very well described locations. A compulsive, constantly harrowing read but very well worth the concentration. Impressive debut.",
        "year": 2020
    },
    {
        "id": 13131,
        "title": "Chopin in Kentucky",
        "author": " Elizabeth Heichelbech",
        "description": "Marie has always wanted to be a ballerina but even she thinks the chances are slim. Chopin, who provides a commentary and the backing track to this very funny novel, is hilariously sceptical. Is he a ghost, an imaginary friend? No, he is in his own words -  'real, though as you know, I suffered a horrible death in Paris over a hundred years ago'.\nAn absolute joy to read, I loved this book.",
        "year": 2024
    },
    {
        "id": 12507,
        "title": "QualityLand",
        "author": "Marc-Uwe Kling",
        "description": "If algorithm has become a dirty word, imagine a near future in which all of life is ruled by one. But don't worry, because this nightmare dystopia is suffused with gorgeously biting satire about the manipulation of history and personal data profiles, and you always know that the rebel human will emerge triumphant. Orwell for iGeneration+.",
        "year": 2020
    },
    {
        "id": 13054,
        "title": "Rouge",
        "author": " Mona Awad",
        "description": "Belle, a woman of mixed ethnicity, is obsessed by beauty. After the death of her French, perfect, nymphomaniac mother she gets in an emotionally unbalanced state. When she decides to try a free treatment in a sinister wellness centre things get more and more dark. I found this a terrible, weird, haunting and creepy read, something to devour at Halloween.",
        "year": 2023
    },
    {
        "id": 12857,
        "title": "The Memory Police",
        "author": " Yoko Ogawa",
        "description": "Told by an unnamed narrator, and taking place on a remote island, this dystopian fable is both generously accessible and beguilingly enigmatic. Despite the title suggesting otherwise, the focus of the book is the personal, physical experience of oppression and loss, rather than the machinations of the totalitarian Memory Police. Breathtakingly beautiful even at its most hauntingly destructive, this gently shattering read is unforgettable.",
        "year": 2021
    },
    {
        "id": 12559,
        "title": "American Spy",
        "author": "Lauren Wilkinson",
        "description": "In a letter to her sons Marie reveals how she became an FBI agent. Inspired by her dead sister's dream, she goes and works as a fed in an all male, all white bureau in New York. The only black woman there. She gets assigned to infiltrate and seduce Thomas Sankara, the leader of the military coup in Burkina Faso. Lots of intrigue, secrets and lies. I wondered if any of this actually happened. <br />",
        "year": 2019
    },
    {
        "id": 12792,
        "title": "Winter Counts",
        "author": " David Heska Wanbli Weiden",
        "description": "A propulsive read. We follow local vigilante Virgil in his attempts to cleanse the Rosebud Reservation of drug gangs. Vivid descriptions of Native American spirituality are mixed with hard-boiled noir, as Virgil navigates the conflicting elements of his identity. The combination is memorable, delivering both the punch of a crime thriller, and an enlightening insight into systemic challenges facing contemporary indigenous American life.",
        "year": 2021
    },
    {
        "id": 12681,
        "title": "The Honjin Murders",
        "author": "Seishi Yokomizo",
        "description": "One to get the little grey cells working. First published in 1973 but not published in English until 2019 - this book is set in traditional hierarchical Japan in 1937. A gruesome double murder, a large cast of suspects, an eccentric amateur detective and a classic 'locked room' mystery - what more can you ask for?  Elegant writing style - very intriguing and can be read at one sitting. Hopefully there will be more translations of Yokomizo’s work.",
        "year": 2021
    },
    {
        "id": 12497,
        "title": "The Heavens",
        "author": "Sandra Newman",
        "description": "As someone who has vivid dreams, I was intrigued by the premise of this novel. Dreams are the vehicle which transport Kate across four hundred years. The transition between time zones is seamless, yet I felt more at ease in Elizabethan England than contemporary New York. A genre-defying fusion of love, time travel and mental illness, there's much to take from this book.  Certain to promote a lively and lengthy discussion.  <br />",
        "year": 2019
    },
    {
        "id": 12817,
        "title": "Burntcoat",
        "author": " Sarah Hall",
        "description": "I really engaged with this beautifully written, poetic tale of survival and death during a pandemic (not Covid). It’s hard to say that I enjoyed it because it is distressing but also uplifting in many ways. Be prepared for detailed sex scenes, delivered in forthright, language, from a woman’s point of view.",
        "year": 2021
    },
    {
        "id": 12778,
        "title": "Plain Bad Heroines",
        "author": " Emily M. Danforth",
        "description": "Almost every character is queer in this enormously brave multi-layered story inside a story inside a story.  The lives of the girls and women, from a 19th century gothic horror setting to the present day cursed movie set, are gathered by an omniscient narrator who throws in their thoughts along the way. Don’t let the size put you off - remarkably, it only slows in a few places. But you may be wary of even the hint of a buzzing wasp for some time!",
        "year": 2021
    },
    {
        "id": 13093,
        "title": "All the Little Bird-Hearts",
        "author": " Viktoria Lloyd-Barlow",
        "description": "Autistic mother Sunday lives with her teenage daughter, Dolly, in a small cottage in the Lake District. When outwardly polished and seemingly charming couple, Vita and Rollo, come to live next door, Dolly and Sunday soon come under their spell. I loved the brooding atmosphere in the book, as much as the voice of Sunday who is brutally honest telling the story.",
        "year": 2024
    },
    {
        "id": 12524,
        "title": "Deacon King Kong",
        "author": "James McBride",
        "description": "A drug dealer is shot in the Cause Houses housing project in New York in 1969, the gunman an elderly drunk and church deacon who taught him baseball. There is violence, poverty and racism here - but it’s also warm and funny. The story reveals that everybody - blacks, whites, Italians, Spanish, church goers and criminals -  are united by a shared history and common humanity and they are all described with humour and affection.",
        "year": 2020
    },
    {
        "id": 13040,
        "title": "Open Throat",
        "author": " Henry Hoke",
        "description": "There are things living under the Hollywood sign that you may not wish to think about, especially if you are hiking there.  There is a bull-necked man who has some peculiar tastes and hates squatters. Plus a cougar and a young woman, who meet up and become friends with disastrous consequences. The story is told by the cougar - a metaphor for the conquest of the West and Trump's America.",
        "year": 2023
    },
    {
        "id": 12969,
        "title": "The Furrows",
        "author": " Namwali Serpell",
        "description": "Cassandra is twelve and often takes her little brother Wayne swimming in the sea. Until the day he gets into difficulty and Cassandra tries and fails to rescue him. His body is not found so is he missing - or dead? Cassandra and her mother dedicate themselves to searching for Wayne resulting in a searing study of guilt and loss.",
        "year": 2022
    },
    {
        "id": 13162,
        "title": "One of Our Kind",
        "author": " Nicola Yoon",
        "description": "A sort of reverse Black Lives Matter novel - which gave me pause for thought. A socially-minded black family moves to a very wealthy, all-black, isolated community in California. The woman has her reservations and soon she receives signals that something is very wrong with the residents.  This book has such a creepy vibe - I stayed up late to read the bitter ending.",
        "year": 2024
    },
    {
        "id": 12671,
        "title": "The Prophets",
        "author": " Robert Jones Jr.",
        "description": "This is a novel that is epic in scale, yet also tied to the minutiae of daily life.  Scattered chapters throughout look to an African past, and a polyamorous King who goes by she and her, but they jar against the bleak plantation life, and the plethora of characters we meet living there. Perhaps the unsettled feeling for the reader is intentional?  At its heart shines the tale of black, queer love between two young men, Samuel and Isaiah.",
        "year": 2021
    },
    {
        "id": 13045,
        "title": "The Fish",
        "author": "Joanne Stubbs",
        "description": "Tenderness and beauty turn to division and turmoil as environmental, world-wide crises wreak havoc for three diverse characters. This cautionary tale on climate has elements of the fantastical but its authenticity is undeniable. This is a unsettling reflection on humanity’s denial of the damage being caused to our planet",
        "year": 2023
    },
    {
        "id": 13101,
        "title": "Barcelona",
        "author": " Mary Costello",
        "description": "This collection of stories is the stage for disturbing family relations, unsettling marriages and cruelty against animals. All are written with powerful feeling for and understanding of the unspoken and inner thoughts of the protagonists. At times, I had to take a break - but I was still intrigued enough to pick it up again and continue reading.",
        "year": 2024
    },
    {
        "id": 13024,
        "title": "Of Cattle and Men",
        "author": "Ana Paula Maia and translated by Zoë Perry",
        "description": "A sparse and brutal read with an almost biblical sense of allegory. We are immersed, gut-deep, in the bloody reality of a slaughterhouse. We smell and sweat, kill and emote with the workers. The story that emerges is one of mystery - as cattle begin to behave strangely, the workers attempt to understand why. But this read is more one of sensory experience than plotting: it's as short and powerful as a stun-gun, but not without tenderness.",
        "year": 2023
    },
    {
        "id": 13181,
        "title": "Juice",
        "author": " Tim Winton",
        "description": "This book made a strong impression on me. As I see it, this story is an homage to people who, in times of destruction and violence, strive to keep their humanity and tolerance of those around them. This is the lot of the nameless man who tells his life’s story in this dystopian tale. We walk beside him as he tries to survive the heat and the greed of others - the ones who were responsible for the terrible situation the earth is in.",
        "year": 2024
    },
    {
        "id": 11388,
        "title": "The Orchard of Lost Souls",
        "author": "Nadifa Mohamed",
        "description": "This book is beautiful but hard to read. It's the story of how three women, of different ages, survive the civil war in Somalia. It weaves the stories of Kawsar, Diqo and Filsan together through chance and circumstance. Kawsar is a widow, Diqo a 9 year old refugee and Filsan a soldier in the national army. Fate brings them together in Hargeisa, a northern city and the three become entrapped in a battle. The question is this: will they survive?",
        "year": 2013
    },
    {
        "id": 12762,
        "title": "The Coward",
        "author": " Jarred McGinnis",
        "description": "A car accident leaves Jarred unable to walk again. And to make matters worse, he will now have to live with his father. This sets the tone for a book that is as candid as anything you're likely to read on family relationships, disability and coming to terms with life pre and post accident . Punctuated with some bitingly funny humour, Jarred will be a character you will want to get to know and cheer for.",
        "year": 2021
    },
    {
        "id": 12929,
        "title": "The Rabbit Hutch",
        "author": " Tess Gunty",
        "description": "The Rabbit Hutch is the tower-block in which the characters of this novel reside: living in close proximity yet at a distance from one another. There is mundanity, the extraordinary and trauma in the lives depicted, which all converge in a single moment, the moment the novel starts, when the main character 'exits her body'. Shocking from the start, this is a provoking, tumultuous read. It will make you think, laugh and despair in equal measure.",
        "year": 2022
    },
    {
        "id": 12646,
        "title": "My Darling from the Lions",
        "author": "Rachel Long",
        "description": "Fascinating poetry, full of grit and astute observation. Each poem has a vivid story to tell, sometimes funny, sometimes outrageous, always insightful and politically aware. You feel disarmed as the poems take stabs at life’s messy muddle and the evils of society. This is a razor-sharp collage enlightened with comedy and wide-awake reflection.",
        "year": 2020
    },
    {
        "id": 12670,
        "title": "Detransition, Baby",
        "author": " Torrey Peters",
        "description": "The intense New York conversations between trans Reese, ex-trans Ames and cis Karina take some following.  The story gradually and elaborately reveals a world in which trans characters struggle for acceptance whatever they do. The doubts, fears and desires of motherhood are very relatable for cis readers as well as trans ones.",
        "year": 2021
    },
    {
        "id": 10938,
        "title": "In the Shadow of the Banyan",
        "author": "Vaddey Ratner",
        "description": "Set in Cambodia during the regime of the Khmer Rouge, this book hits its stride at around midpoint.  Raani's narrative deploys a vocabulary that belies her age, yet retains a child's curiosity and innocence.  Her descriptions of the natural world are beautiful and vivid, contrasting sharply with later depictions of human deprivation, cruelty and violence.  Few stories have moved me to tears, but this saga of human resilience almost succeeded.",
        "year": 2012
    },
    {
        "id": 12822,
        "title": "Domestic Bliss and Other Disasters",
        "author": " Jane Ions",
        "description": "Sally tells the story of her mid-life antics involving her 'creative' son, her overwhelmed new-mum daughter, her politician spouse, a rat-catching lodger, two long-standing friends, and a neighbour with an unhealthy interest in rhubarb leaves. Sally's life is all wrapped up in a comical coat of witty observation and good old-fashioned British humour guaranteed to raise a smile (and an eyebrow).",
        "year": 2021
    },
    {
        "id": 12687,
        "title": "A River Called Time",
        "author": " Courttia Newland",
        "description": "Plunge into this refreshing new version of world building - an example of ‘African futurism’ - SF, where Black people have rarely figured till now. Multiple timelines deliver a near-future, alternative reality of the world without racism and colonialism – but familiar dystopian themes. I found it a  provocative but rewarding read – but there are elements of animal cruelty some readers might find upsetting.",
        "year": 2021
    },
    {
        "id": 12841,
        "title": "The Khan",
        "author": " Saima Mir",
        "description": "This book delivers the authentic feel of the heart of the Pukhtun community in a city like Bradford with the emotional tension of a single woman escaping that life to be a successful lawyer in London. The fast-driven plot hardly leaves you breath to absorb the back story before you are dragged with Jia back into the whirlpool of conflicting loyalties as she seeks justice for her murdered father -  or is it darker revenge of her own?",
        "year": 2021
    },
    {
        "id": 12743,
        "title": "The Boat People",
        "author": "Sharon Bala",
        "description": "Mahindan and his young son, Sellian, flee their war-torn homeland of Sri Lanka and board a boat to Canada, hoping for a better life there. As Mahindan waits in jail for his lawyer and the adjudicator to decide his future, Sellian is taken into foster care where he begins a new life in a democratic society. This candid insight into the desperation of asylum seekers was sobering, so be prepared to be moved by this timely tale, just as I was.",
        "year": 2021
    },
    {
        "id": 12860,
        "title": "Blacktop Wasteland",
        "author": " S. A. Cosby",
        "description": "When ex-con Beauregard tries to do everything right for his family, everything goes wrong. With nightmarish inevitability all his struggles bind him closer to the bad old ways. Enjoy the twists and turns, knowing of course that all will come right in the end, but at what cost to his wife and friends?",
        "year": 2021
    },
    {
        "id": 12965,
        "title": "How Not to Drown in a Glass of Water",
        "author": " Angie Cruz",
        "description": "The progress of Cara Romero's Senior Workforce Program notes highlights the truth about the fragility of life for immigrants living in New York today. Cara is a great character who turns this sometimes uncomfortable tale into a touching and often hilarious novel.",
        "year": 2022
    },
    {
        "id": 12582,
        "title": "Piranesi",
        "author": "Susanna Clarke",
        "description": "Piranisi shares his castle home with the sea, the birds, the fish, the statues, the skeletons and one other person simply named the ‘Other’. However, times are changing and strange things are happening: they may no longer be alone. A magical, beautiful and atmospheric novel with a revelatory ending. One to read as much for the writing as the story. I absolutely loved it. ",
        "year": 2020
    },
    {
        "id": 12529,
        "title": "Cleanness",
        "author": "Garth Greenwell",
        "description": "Thrumming with life’s questions, we watch the narrator wrestle in shameless clarity with his own intimate desires, inviting us in and yet held at arm’s length by his sense of private pain. Stand-alone chapters magnify and crystallise his raw anguish and alienation. An unsettling, illuminating exploration of love and anonymity; fear and solitude, crafted in heat-seeking prose.",
        "year": 2020
    },
    {
        "id": 13050,
        "title": "This Other Eden",
        "author": " Paul Harding",
        "description": "After the arrival of the well-meaning but racist Reverend Diamond and a bunch of civil servants and scientists, the Apple Island people are labelled as backward people who need to be civilized as quickly as possible. The subjects addressed, like racial inequality and intolerance, are timeless. I loved the lyrical style and the lively characters, - which made the book despite its serious issues, more enjoyable.",
        "year": 2023
    },
    {
        "id": 12933,
        "title": "Venomous Lumpsucker",
        "author": " Ned Beauman",
        "description": "This is a thrilling cli-fi read that borders on the absurd. Two individuals with contrasting motives grudgingly cooperate, taking increasingly extreme measures to locate a species teetering on the brink of extinction. It’s a humorous and adventurous meditation on humanity’s impact on the planet and personal reactions to it.",
        "year": 2022
    },
    {
        "id": 13169,
        "title": "Black River Orchard",
        "author": " Chuck Wendig",
        "description": "'An apple a day keeps the doctor away' doesn’t apply to this book. This gothic horror novel begins quite innocently when Dan, an apple farmer from Pennsylvania, miraculously regains the rights to his father's apple orchard. Its seven trees produce blood-red, delicious apples - and anyone who eats them is miraculously transformed. Needless to say things go from worse to grim. A delicious, fat page-turner, but I’m off apples for some time.",
        "year": 2024
    },
    {
        "id": 12638,
        "title": "Reality, and Other Stories",
        "author": "John Lanchester",
        "description": "Eight entertainingly creepy short stories.  A ghost looks for a phone signal, a woman is stranded in what seems to be the Big Brother house, text messages are sent from beyond the grave and a selfie stick has evil powers. Not a cobweb in sight as technology meets the paranormal!",
        "year": 2020
    },
    {
        "id": 12828,
        "title": "Poso Wells",
        "author": " Gabriela Alemán",
        "description": "An ironic, satirical and slightly absurd story which you want to keep on reading even though it concerns a situation in which corruption, manipulation, exploited resources, misuse of power and other characteristics of a country in disarray are so obvious. With the help of some interesting characters and the hand of fate, many problems can be solved. Inexplicably, the unbelievable becomes real though the underlying truth cannot be forgotten.",
        "year": 2021
    },
    {
        "id": 12927,
        "title": "Memphis",
        "author": " Tara M Stringfellow",
        "description": "A saga of three generations of Black lives in the South, with the classic drivers of racial hatred and violence, rights campaigns and female survival through inner strength. The flashback format will require you to master the chronology, and some of the cultural references may challenge British readers, but it’s so worth it. Just imagine Oprah, Halle and Latifah starring in the film …",
        "year": 2022
    },
    {
        "id": 12592,
        "title": "Little Blue Encyclopedia",
        "author": "Hazel Jane Plante",
        "description": "This story of a transwoman's grief for her friend, Vivian, is uniquely structured and unashamedly honest. Akin to a love letter, the grieving woman pays homage to Vivian through a series of encyclopedia entries based upon her favourite TV series. Through the narrator's writing, we learn about her life as a transwoman, as well as the colourful life led by Vivian. While loss is the backbone of the story, the author offers the reader so much more.",
        "year": 2019
    },
    {
        "id": 12840,
        "title": "The Snow Line",
        "author": " Tessa McWatt",
        "description": "A beautifully written, meditative story of identity, belonging and love.  Though shifting perspectives and time slips can be disorientating, the real power of the novel lies in its keenly observed and evocative sense of place.  Weddings have a knack of throwing unlikely people together and although there's not much in the way of a plot, I found this a surprisingly suspenseful and emotional read.",
        "year": 2021
    },
    {
        "id": 13097,
        "title": "About Uncle",
        "author": " Rebecca Gisler",
        "description": "This strangely beautiful, claustrophobic little book drops you deep into the tiny home and day-to-day life of Uncle and his nephew and niece. Uncle is quite a repellent concoction of excess and loud, smelly bodily functions. The 'yuk' factor is high. Yet his nephew (at first) and niece (later on her own) look after him, with care and even tenderness. It made me wonder why - and think hard about what binds any of us together as family.",
        "year": 2024
    },
    {
        "id": 12701,
        "title": "Lot",
        "author": " Bryan Washington",
        "description": "Growing up black and queer in Houston, Texas, is not the easiest thing in the world, especially when you are also a sex worker during the AIDS pandemic. There are also gradations of blackness that have to be worked through so that you know what your worth is in society. This is not an easy read, but at the end of it you will have a greater understanding of the complexities in which we all live.",
        "year": 2021
    },
    {
        "id": 13204,
        "title": "Alone With You in the Ether",
        "author": "Olivia Blake",
        "description": "Two complicated and unconventional young people, one bipolar, the other a gifted mathematician, enter into a relationship with many ups and downs, hampered by their many personal challenges. Some readers may find both Aldo and Regan a bit intense – even self-centred - but their discussions are lively and intimate making for an engaging and addictive read.",
        "year": 2025
    },
    {
        "id": 12871,
        "title": "Doggerland",
        "author": " Ben Smith",
        "description": "Set in an unspecified future, on a vast, corroding windfarm far out in the North Sea, this is a poetic, claustrophobic read. Above sea-level, we follow the storm-blasted routines of the boy and the old man, maintenance workers imprisoned by wind turbines and each other. Below the surface, the book plays out on a different timeline, elegantly charting geological periods and the fluidity of landmass. The result is affecting and quietly profound.",
        "year": 2022
    },
    {
        "id": 12472,
        "title": "Disappearing Earth",
        "author": "Julia Phillips",
        "description": "Think of a flower: the stem is the crime of the abduction of two sisters and the petals are the lives of residents in the city of Petropavlovsk and town of Kamchatsky who are tentatively involved with the main story. It's written in such a way you feel you're snooping into the lives of others which I find a bit uncomfortable.  But a very interesting concept with an intriguing ending – so hang on in there.",
        "year": 2019
    },
    {
        "id": 12661,
        "title": "Little Bandaged Days",
        "author": " Kyra Wilder",
        "description": "Erika's husband gets a demanding new job in Geneva and she finds herself isolated in a flat with two small children. Whilst he starts early, finishes late and often goes away for days on end she must fill her days with food shopping and coping with the children. Told entirely by an increasingly desperate Erika this book charts her gradual decline and hints at something much darker. An intense and claustrophobic read.",
        "year": 2020
    },
    {
        "id": 12536,
        "title": "Pew",
        "author": "Catherine Lacey",
        "description": "You may struggle to understand Pew's personality, their central identity of memory, gender and race wiped. But then understanding dawns that such neutrality is a window through which to see the community of would-be rescuers, and a mirror to visualise the cultic dark side when best intentions turn pathological. Small town America at its most filmable.",
        "year": 2020
    },
    {
        "id": 12883,
        "title": "Our Wives Under The Sea",
        "author": " Julia Armfield",
        "description": "Part supernatural thriller, part intimate love story: this novel explores the fallout following a disastrous mission on board a submarine.  A duel narrative charts life above and below the sea, taking the reader on a claustrophobic journey.  There is often an element of unease in leaving your comfort zone and this slow-burning masterpiece of suspense is not a book I will forget in a hurry.",
        "year": 2022
    },
    {
        "id": 13022,
        "title": "Western Lane",
        "author": " Chetna Maroo",
        "description": "Deceptively simple, this short novel doesn’t need prior knowledge of the game of squash. The game highlights how this British Pakistani family is dealing with their collective grief, and we watch their emotions unfold through small gestures, overheard conversations and familial obligations, hiding their heartbreak. A great deal is revealed in the silence between them. I was thinking of Gopi and her sisters long after I finished reading.",
        "year": 2023
    },
    {
        "id": 12788,
        "title": "The Warlow Experiment",
        "author": " Alix Nathan",
        "description": "An intense claustrophobic and uneasy fascination surround the hook of this story - a kind of extreme English country house upstairs/downstairs narrative. Class struggle, power subversion and obsession stalk the floors of Moreham House. I found it a gripping read and ultimately quite devastating.",
        "year": 2021
    },
    {
        "id": 12901,
        "title": "Rabbits",
        "author": " Terry Miles",
        "description": "A parallel story to the podcast of the same name, this novel is an edge of your seat thrill ride through the worlds of a dark and mysterious alternate reality game. With a backdrop of pop culture references and vintage tech, cryptic clues are gathered and solved moving the game forward and as things begin to get scary, the boundaries between play, reality and possibility become blurred.",
        "year": 2022
    },
    {
        "id": 12618,
        "title": "Real Life",
        "author": "Brandon Taylor",
        "description": "Wallace has escaped his abusive small town past in the south by travelling light years to study in the Midwest. But what should feel like a success brings unhappiness and frustration with the underlying racism he encounters every day in his tutors, fellow students and even his so called friends. The atmospheric writing creates a tension that simmers in the heat of summer by the lake. I was totally immersed in this beautifully crafted novel.",
        "year": 2020
    },
    {
        "id": 12644,
        "title": "All the Water in the World",
        "author": "Karen Raney",
        "description": "Told through the dual-voice, non-linear narration of mother Eve and her daughter Maddie, this novel is particularly brilliant in capturing the presence of terminally ill teenager Maddie. Sadness is never hidden, but never exploited either. The exploration of responses to bereavement and actions born from grief feels utterly authentic. This is a heart-breaking book, but not a downer: its humanity, honesty and humour offer respite and hope.",
        "year": 2019
    },
    {
        "id": 12647,
        "title": "Citadel",
        "author": "Martha Sprackland",
        "description": "The lives of two very different women are captured in poetry form. Spanning five hundred years, the women are linked through verse as their stories play out in their respective homelands of England and Spain. Although the ambiguity of the verse made this an intellectually challenging read, it was nevertheless easy to enjoy the beautifully descriptive language of this collection.",
        "year": 2020
    },
    {
        "id": 13107,
        "title": "Glorious People",
        "author": " Sasha Salzmann",
        "description": "Spanning decades from Soviet-era to now, this novel is both expansive yet deeply personal. Moving between Ukraine and Berlin, but grounded in a pair of interlinked mother-daughter relationships, the background of political and social upheaval takes shape in inter-generational trauma. A constant undercurrent of alienation, especially around personal identity, makes this a read with no easy answers and powerful emotional truths.",
        "year": 2024
    },
    {
        "id": 11542,
        "title": "The Wake",
        "author": "Paul Kingsnorth",
        "description": "An uncomfortable, lucid, robust read that tosses you right into the muddy aftermath of the invasion of England in 1066, showing how quickly freedoms are lost and how very hard it is to get them back. Here is a fierce, compelling voice opening up an ancient way of thinking. Read it out loud and suddenly you can hear the man clearly. It has much of relevance to say about truth, belief, human frailty and what being English might really mean.",
        "year": 2014
    },
    {
        "id": 12588,
        "title": "A Girl Made of Air",
        "author": "Nydia Hetherington",
        "description": "Roll up for a magical mystical tour with the travelling circus! The unusual hybrid of genres reflects the weird and wonderful circus acts and the dual life of the performing artistes. Dickensian melodrama blends with Gothic fable, myth and folklore, whilst underneath the glamour of the Big Top and the spell of the dreamlike prose lie nightmare topics - suicide, sexual abuse and childhood neglect - so best not to read before bedtime.",
        "year": 2020
    },
    {
        "id": 12684,
        "title": "The Disoriented",
        "author": " Amin Maalouf",
        "description": "Through a combination of journal entries and third person narrative the reader accompanies Adam on his return to Lebanon after a 25 year absence. He analyses his struggle with his own choices and identity through comparisons with the paths his friends have taken and how they are impacted by war, race, religion and politics. This novel is big in both themes and scope, but also offers intimate moments of beauty and tenderness.",
        "year": 2021
    },
    {
        "id": 12895,
        "title": "Here Comes the Miracle",
        "author": " Anna Beecher",
        "description": "This is a poignant and very intimate narrative of loving sister Emily and musical talented brother Joe when he gets cancer, and the impact it has on the family. Interspersed with it is the story of their grandfather, homosexual Edward and his wife Eleanor in the fifties. A story of death, love, music and survival. It affected me to the point where I had difficulty reading any further.",
        "year": 2022
    },
    {
        "id": 13028,
        "title": "The Secret Book of Flora Lea",
        "author": " Patti Callahan Henry",
        "description": "After finding a fairytale written by an unknown American writer in the antiquarian bookshop where she works, Hazel  embarks on a journey to find her long lost sibling. I found this a lovely tale of lost innocence, true friendship and the consolation of fantasy and nature.",
        "year": 2023
    },
    {
        "id": 12640,
        "title": "Missionaries",
        "author": "Phil Klay",
        "description": "This novel spans three decades of conflict in Iraq, Afghanistan and Colombia and tells the story through three main characters. Lisette is an American news reporter, Mason an American soldier turned military advisor, and Abel who is forced to become a child soldier after his family is killed. A complex story is pulled together and made so personal. Thought-provoking and timely.",
        "year": 2020
    },
    {
        "id": 13154,
        "title": "Un Amor",
        "author": "Sara Mesa",
        "description": "Nat is a single, vulnerable woman for whom life has clearly been unkind - full of if-onlys. These continue into her new life with a tragic inevitably, culminating in a fall from grace in her relationship with the Faust-like Andreas. You’ll meditate on all the motives and consequences of her too-quick and too-long-delayed decisions, and feel her depth of feeling in heart and soul as everyone and everything conspires against her.",
        "year": 2024
    },
    {
        "id": 12890,
        "title": "Glory",
        "author": " NoViolet Bulawayo",
        "description": "I just cannot describe the magnitude of this book. A Zimbabwean allegory, featuring an animal population, it is poignant, humorous, elaborate, mocking, sad, intense, and above all, written in the true tradition of oral storytelling. Violence, inflicted by the government, is met by resilience, magic and compassion in this dictatorial state.  Seen through the eyes of all those concerned, you can only wish for peace for everyone, and justice done.",
        "year": 2022
    },
    {
        "id": 13052,
        "title": "Such Sharp Teeth",
        "author": "Rachel Harrison",
        "description": "This book presents as a violent and gory werewolf horror, but it’s more than that. The grisly attack that the protagonist suffers is life changing. It undermines her bodily autonomy and forces her to face her vulnerabilities, drawing parallels to childhood abuse and her sister’s pregnancy. It's a horrific but darkly comic tale and extremely thought provoking. Not for the faint hearted.",
        "year": 2023
    },
    {
        "id": 13072,
        "title": "Kibogo",
        "author": "Scholastique Mukasonga",
        "description": "For a lighthearted tour through Rwandan folklore, it starts darkly enough with the children being taken away under pretext of the war effort. The Belgians treated the populations of their colonies as slaves, which explains why Rwandans found it hard to exchange their heroes like Kibogo for the priests’ Yezu and Maria. My delight in their irrepressible spirit mirrored my anger at the cynical efforts of colonists and academics to exploit them.",
        "year": 2024
    },
    {
        "id": 13063,
        "title": "The Postcard",
        "author": " Anne Berest",
        "description": "Real and imagined family stories are woven together to bring to life the author’s own family’s trauma.  Both painful and beautiful, it’s a gripping investigation into her family history -  a tale of refugees, of the holocaust, of French complicity and French resistance, as well as the usual family conflicts and misunderstandings.  Although the structure was a little unsettling at times, it is brilliantly translated, and an emotional read.",
        "year": 2024
    },
    {
        "id": 13087,
        "title": "She's A Killer",
        "author": " Kirsten McDougall",
        "description": "Despite being almost a genius (and perhaps a sociopath) Alice has done nothing with her life. In her thirties she still lives with mother.  Climate change has rendered large parts of the world uninhabitable so the rich are flocking to New Zealand and taking over. Alice finds herself drawn into taking direct action against these 'wealthugees' when she meets a teenage genius and killer! A  deeply weird, darkly funny and timely page-turner.",
        "year": 2024
    },
    {
        "id": 13058,
        "title": "The Glutton",
        "author": " A. K. Blakemore",
        "description": "Tarare, cursed by the circumstance of poverty lives a life blighted by violence and want. Naive and vulnerable, he is exploited by society, his insatiable hunger used as a side show, a scientific curiosity and tool of war until he comes to embody the monstrosity of what he has experienced. Though dark and gory, this book is also full of beauty, humour and tenderness. Bizarre at times, this unique read is one you’ll want to gorge on!",
        "year": 2023
    },
    {
        "id": 13060,
        "title": "The Fugitives",
        "author": " Jamal Mahjoub",
        "description": "If you are in need of an uplifting, heart-warming book then meet up with the newly reformed Kamanga Kings and join their journey from Sudan to the USA. It's a story of friendships, music, tradition, and one of overcoming adversities in life, told with humour and an abundance of affection for the characters. The rhythms and the tunes of the Kamanga Kings will be playing in your imagination on every page.",
        "year": 2023
    },
    {
        "id": 12688,
        "title": "Memorial",
        "author": " Bryan Washington",
        "description": "When a crisis throws them apart, two men at a crossroads in their relationship reflect on their lives and dysfunctional relationships with their respective families. Both wise in its reflectiveness and unsettling in the lack of answers it provides, this is authentic, contemporary storytelling, told with stunning honestly, wry humour and frank, uncompromising use of language.",
        "year": 2021
    },
    {
        "id": 12742,
        "title": "Daughters of Smoke and Fire",
        "author": " Ava Homa",
        "description": "This is a necessary book about a very hard topic: the fate of the Kurds in Iran. A young woman, who wants to be a documentary maker, experiences things no one should be submitted to. I found it a hard read, not because of the language, but emotionally draining. That said: it’s well worth the effort. It gave me an insight into a brave and resilient people.",
        "year": 2021
    },
    {
        "id": 12505,
        "title": "Escape Routes",
        "author": "Naomi Ishiguro",
        "description": "I loved these surreal and quirky short stories. Naomi Ishiguro has the knack of making the dream-like seem remarkably normal and feasible.",
        "year": 2020
    },
    {
        "id": 13084,
        "title": "Delivery",
        "author": "Margarita García Robayo",
        "description": "The line between what’s real and what’s imagined blurs wildly in this short, impactful story where a writer, who is far from home, battles with the scars she carries from her fractured family relationships.  Whilst it looks at motherhood, loss and belonging you never feel that it is a novel of themes. Instead I was caught up in the day to day life of this writer, and her spiralling descent from reality.",
        "year": 2024
    },
    {
        "id": 13090,
        "title": "The Hunger of Women",
        "author": "Marosia Castaldi",
        "description": "Rosa combats her loneliness with a frenzied cooking spree. The locals, following the exquisite fragrances, flock to her home to indulge in sumptuous feasts of food and love. A mouth watering and sensual celebration of gluttony and passion - what's not to love? The move away from traditional sentences and punctuation may seems strange at first -  but I found it really helps the narrative to flow.",
        "year": 2024
    },
    {
        "id": 12581,
        "title": "Blue Ticket",
        "author": "Sophie Mackintosh",
        "description": "In an unnamed country, but probably the USA, in an unspecified period, but probably modern, young girls are allocated the right or not to motherhood. No arguing, no escape except exile. Atmospheric, exciting, scary, (travelling by bus at night alone, being afraid of pursuit.) The reader may well feel total empathy with the heroine. A great read in a dystopian setting.<br /> ",
        "year": 2020
    },
    {
        "id": 12869,
        "title": "Send Nudes",
        "author": " Saba Sams",
        "description": "A strikingly poetic short story collection that offers both a dreamy and starkly honest exploration of young women's relationships with family, friendship and their own bodies. Set in an instantly recognisable present of dating apps, lockdown and sourdough starters, these are characters sidelined by absences in their lives, and desperate for connection. Despite an undercurrent of loss, there is hope here - sometimes momentary, always authentic.",
        "year": 2022
    },
    {
        "id": 12956,
        "title": "Leech",
        "author": " Hiron Ennes",
        "description": "This eerie and intriguing novel keeps you turning pages with its twists and revelations while deeply immersing you in its beautifully written and atmospheric world. It will especially appeal to fans of gothic horror, fantasy and science fiction, and anyone who enjoys dark but thoughtful explorations of humanity and survival.",
        "year": 2022
    },
    {
        "id": 12803,
        "title": "Winter Flowers",
        "author": " Angelique Villeneuve",
        "description": "In this beautiful and intense slow burner, war wounded Toussaint Caillet returns home from hospital and the battlefields of the First World War.  The tender narrative tells, through the eyes of his wife Jeanne, of the journey back to family life as they begin to build a new understanding of each other and their community.  Scarred by the emotional and physical consequences of war, their road to recovery offers the promise of hope for the future.",
        "year": 2021
    },
    {
        "id": 13197,
        "title": "The Twilight Zone",
        "author": "Nona Fernández",
        "description": "This meditation on the collective traumatic memory of Pinochet's dictatorship is told through the narration of a documentary maker, and their imagined dialogue with The Man Who Tortured People - a member of the secret police. The threat of state violence runs throughout, as acts of torture merge into the everyday. This stark read blends fact with poetry to push into disturbing psychological spaces that museums and archives cannot reach.",
        "year": 2025
    },
    {
        "id": 13106,
        "title": "My Father's House",
        "author": " Joseph O'Connor",
        "description": "What a thrilling ride this book is - breakneck speed, breath-holding tension and characters you really care about. The pervading fear created by the Nazi occupation of Rome, the night-time missions in the backstreets, the bravery of everyday folk - all so authentic.  I welcomed the polyphonic voices - they gave the narrative a special depth and meaning; each member of the 'choir' adding to the experiences and actions of their fellow choristers.",
        "year": 2024
    },
    {
        "id": 12932,
        "title": "The Coven",
        "author": " Lizzie Fry",
        "description": "This is an urgent, dark and vividly told adventure which will drawn you in for a provocative thrill ride. Set in an alternate reality where magic is real and witches are violently persecuted, the story follows two witches coming to terms with their power and discovering their responsibility in establishing a just society.",
        "year": 2022
    },
    {
        "id": 12749,
        "title": "Stromness Dinner",
        "author": "Peter Benson",
        "description": "If you have ever enjoyed a quiet hour in a park or café people watching then you will find lots to like in this book. It gives us a delightful, humorous and often quirky window into the lives of the characters, led by Ed - a London kitchen fitter - and a view of Orkney that will have you thinking about taking your next holiday there. Once read it will be a book to look back on with good memories.",
        "year": 2021
    },
    {
        "id": 13105,
        "title": "Boundary Road",
        "author": " Ami Rao",
        "description": "Aron and Nora travel on the number 13 bus across London during the rush hour. What emerges is a vivid and compassionate portrait of multi-cultural London. They talk to some passengers and observe others. An unexpected page turner and you will find yourself caring about everyone you meet on the journey.",
        "year": 2024
    },
    {
        "id": 12848,
        "title": "Bullet Train",
        "author": " Kotaro Isaka",
        "description": "Five killers board the same train from Tokyo. A teenage psychopath, a father seeking revenge, an unlucky professional hitman, and Tangerine and Lemon who mix violence with chat about Thomas the Tank Engine! There is nowhere to hide on the bullet train as they pursue each other from carriage to carriage. This is a read full of twists and turns, violence and a lot of humour.",
        "year": 2021
    },
    {
        "id": 13196,
        "title": "The Fresh Dirt From the Grave",
        "author": "Giovanna Rivero",
        "description": "I really enjoyed these subtle horror stories. They’re not ‘in your face’ but let you slowly in on the terrible fate of ordinary people. A shipwrecked man who is a survivor and visits a mother of a drowned son who asks difficult questions, a Japanese woman who gives origami classes in a woman’s prison and siblings living near a Métis reservation in Canada. The beautiful language is a breath of fresh air despite the uncomfortable subject matter.",
        "year": 2025
    },
    {
        "id": 12941,
        "title": "Nightcrawling",
        "author": " Leila Mottley",
        "description": "Stories about sexual violence and police corruption do not make for easy reading and the young black woman at the centre of this story is faced with a relentless reality of exploitation. That said, the lush writing, though intense, is never sentimental and Oakland's diverse landscape is vividly brought to life.  This novel was inspired by real events, which lends it, I think, an added poignancy.",
        "year": 2022
    },
    {
        "id": 12789,
        "title": "The Eden Legacy",
        "author": "Will Adams",
        "description": "A fast-paced thriller about treasure hunting in the beautiful marine landscape of Madagascar. This unique and exciting read challenges centuries old assumptions and made me question how you can 'discover' a country that's already been discovered? I couldn’t put the book down until I knew the truth.",
        "year": 2021
    },
    {
        "id": 12740,
        "title": "Sankofa",
        "author": " Chibundu Onuzo",
        "description": "Tinged with melancholy, this story follows a middle-aged, mixed race woman as she tries to connect with her black heritage in the wake of her white mother's death. There are big themes at work in this book - identity, family, connection - and Anna's journey is incredibly broad in scope - from suburban London to a fictionalised west African dictatorship - but it's always profoundly human.",
        "year": 2021
    },
    {
        "id": 12706,
        "title": "The Only Good Indians",
        "author": "Stephen Graham Jones",
        "description": "This book is a Jacobean bloodbath driven by a supernatural Elk seeking retribution from the Indian community. The light-touch but intimate feel of Native American life, with all its heritage or baggage, brings home the failings and longings of the human characters, as the animal spirit reeks its revenge. A haunting, unusual and brutal novel.",
        "year": 2021
    },
    {
        "id": 13046,
        "title": "The Love of Singular Men",
        "author": "Victor Heringer",
        "description": "Camilo uses crutches, his parents are always fighting, the heat is oppressive.  Everything changes when his father brings a mysterious boy, Cosme, to live with them. This is a moving novella of first love and loss, perfect to read in one sitting.",
        "year": 2023
    },
    {
        "id": 13088,
        "title": "The Home Child",
        "author": " Liz Berry",
        "description": "Written with soaring imagery, this is a haunting, disturbing novel in verse; an historical tale but one with timeless resonance. We feel the longing of the children uprooted from their families and are amazed by their resilience, somehow fuelled by the wild beauty of the countryside. The sequence of lyrical snapshots juxtaposes the voice of officialdom with the use of dialect, which emphasises the sense of dislocation of being a home child.",
        "year": 2024
    },
    {
        "id": 12565,
        "title": "How to be a Kosovan Bride",
        "author": "Naomi Hamill",
        "description": "While reading this book I wondered how your culture, or the past, can affect your life or marriage? In a style which is at once detached but which also draws you in, the reader is shown, on a personal female level, the complexity of a traditional society on the rebound from a cruel war. Interwoven with history it tries to capture both sides, old and new, without favouring one or the other. A unique portrait of an age-old plight.<br />",
        "year": 2017
    },
    {
        "id": 12739,
        "title": "The Hummingbird",
        "author": " Sandro Veronesi",
        "description": "Described as a ‘reinvention of the family saga’, this story goes backwards and forwards in time, from the 1970s to the future of 2030. With fabulist and philosophical elements, the novel explores the existential issues of our times, using dialogues, letters and chat sessions. As a tragi-comedy of stoicism, it is both playful and profound and a cathartic reading experience.",
        "year": 2021
    },
    {
        "id": 12730,
        "title": "Transcendent Kingdom",
        "author": " Yaa Gyasi",
        "description": "Gifty and Nana are Ghanaian children growing up in Alabama, like fish out of water.  This is the story of how it all goes wrong for Nana, and how Gifty and her mother are traumatised by events, and have to learn to cope in their own very different ways.  A harrowing, heart-rending but ultimately heart-warming story.",
        "year": 2021
    },
    {
        "id": 12660,
        "title": "A Season on Earth",
        "author": "Gerald Murnane",
        "description": "Plagued by sexual obsession, fantasies and guilt, an imaginative Melbourne teenager grows up in a narrow-minded and old-fashioned Catholic environment. Adrian's thoughts and dreams are so over the top that they sometimes become funny. But I did wonder if he ever could be happy in the 'real' world.",
        "year": 2020
    },
    {
        "id": 12615,
        "title": "The Bitch",
        "author": "Pilar Quintana",
        "description": "Damaris unflinchingly describes a lifetime of abandonments and disappointment and hopes to have found a subject for her affection in a puppy named after the daughter she never had. The ever present threat of the jungle and the sea add to the uneasy atmosphere. This is not a light-hearted read about a cute puppy, but a harsh, direct story of grief and guilt and how they can shape people.",
        "year": 2020
    },
    {
        "id": 12951,
        "title": "The Last Goddess",
        "author": " Kateřina Tučková",
        "description": "This interesting novel gains credibility because you dig into the past with Dora by reading official reports, letters and documents. She is an ethnographic scientist and descendant of a wise woman from the Carpathian mountains. Step by step, she unravels the hectic and violent past of two families and she discovers a terrible secret. It opened my eyes to the atrocities done to women that happened not so long ago.",
        "year": 2022
    },
    {
        "id": 13074,
        "title": "Sira",
        "author": " María Dueñas",
        "description": "The life of Sira, an ex-spy for the British in the Second World War, is turned upside down when her husband dies in a Israeli bomb attack in 1947. This book consists of four abundant parts and there was enough material for three novels. I found this both a vivid account of the cause of the Palestinian-Israeli conflict but also of the bravery of an independent woman.",
        "year": 2024
    },
    {
        "id": 12870,
        "title": "Foolish Heroines",
        "author": "June Wentland",
        "description": "This bizarre story combining domestic drama with a liberal sprinkling of magical realism makes for an entertaining read.  Following a disparate group of women as they embark on journeys of discovery, empowerment and friendship, it yanks the reader into their lives and any resistance soon becomes futile.  Absurd though it may be, it is also funny, uplifting and refreshingly different.  By the end of the book I too felt like I was one of the gang.",
        "year": 2022
    },
    {
        "id": 12694,
        "title": "Good Citizens Need Not Fear",
        "author": " Maria Reva",
        "description": "The crumbling of the Soviet Union is reflected in the the decaying tower blocks of the Ukraine, but this is no grim slice-of-realism record. You know from the start that these lovable characters will win through with gritty determination in spite of the black absurdities of their circumstances. Just a few small episodes in their lives have enough authenticity and emotion to fill your soul.",
        "year": 2021
    },
    {
        "id": 12836,
        "title": "Gold Diggers",
        "author": " Sanjena Sathian",
        "description": "This debut novel combines alchemy with the background of the Gold Rush. Set in Silicon Valley-era California, with the emotional driver of the identity issues of young members of the close-knit expat Indian community, it delivers a powerful yarn sparkling with all the cultural values of gold.",
        "year": 2021
    },
    {
        "id": 13202,
        "title": "City of Nightbirds",
        "author": "Juhea Kim",
        "description": "The life of a prima ballerina is no fairy tale. Natalia works hard on her come-back after a two year break following a severe accident. Not only has she had to come to terms with that, but also with the fact that her loving partner betrays her with a competitor, devious Dmitri. Love, jealousy and pain are all in the game for these artists. A book for true ballet aficionados - and those curious to learn more about this world.",
        "year": 2025
    },
    {
        "id": 13048,
        "title": "Cursed Bunny",
        "author": "Bora Chung",
        "description": "From contemporary body horror to timeless fable and epic fantasy, these ten short stories will thrill you in their exhilarating shifts across genre and style. Disorientating as a reality-melding fever dream, a deep sense of terror will grip you as recurrent themes of misogyny, gaslighting and generational trauma emerge, shaping the monsters that lurk within these pages: darkly funny, menacingly off-kilter and grotesquely human.",
        "year": 2023
    },
    {
        "id": 12591,
        "title": "Honey Walls",
        "author": "Bones McKay",
        "description": "I loved this fairy-tale story of transgender alienation and learning to feel again. It’s a little confusing at first but stick with it. It’s easy to read if you go with the flow and well worth the effort.",
        "year": 2019
    },
    {
        "id": 12521,
        "title": "Tyll",
        "author": "Daniel Kehlmann",
        "description": "Germany during the Thirty Years' War was a hell on earth. Tyll Ulenspiegel survives because he refuses to die. He betrays his father, runs away and becomes a mountebank - all because he refuses to die. He meets all sort of people - Dr Tesimond, the only surviving Gunpowder Plotter, Athanasius Kircher, an academic, and Elizabeth, Queen of Bohemia. And still Tyll refuses to die. This is a sardonic, darkly humorous tale of survival..",
        "year": 2020
    },
    {
        "id": 12914,
        "title": "The Whale Tattoo",
        "author": "Jon Ransom",
        "description": "Much like the sea in the book, the language ebbs and flows, so whilst there is much that may offend such as strong swearing, explicit sex and bodily fluids, at the same time there’s a lyricism to the story.  Both gritty and gripping, it is all about trauma and family, revenge and forgiveness.  In some moments I was drowning in plot, unsure of what was happening, or had happened, but I slowly untangled the truth, carried away through to the end.",
        "year": 2022
    },
    {
        "id": 12585,
        "title": "Between Beirut and the Moon",
        "author": "A Naji Bakhti",
        "description": "These tragi-comic anecdotes related by our engaging adolescent narrator paint a vivid picture of growing up in a multi-faith society (and family). Against the backdrop of a city torn apart by sectarian and political violence, his testimony of normal youthful escapades resonates powerfully with the reader, bridging the gap between his world and ours. I would definitely recommend the audio version.",
        "year": 2020
    },
    {
        "id": 13091,
        "title": "Verdigris",
        "author": " Michele Mari",
        "description": "Monstrous and beguiling, tender and humorous, this is the story of an unlikely friendship between an older man suffering a decline of memory and a young boy growing into adulthood. As Felice unravels, Michelino draws the threads of his life together and the old man’s madness begins to become a dark reality.",
        "year": 2024
    },
    {
        "id": 12682,
        "title": "Fake Accounts",
        "author": " Lauren Oyler",
        "description": "What is the truth? Is it what you see, what you believe you see or what someone else wants you to see? This book is set in a world of online posturing and fake news.  Boyfriend Felix is not all he seems and our protagonist adopts a number of imaginary identities to set about replacing him. Funny and touching, I immediately engaged with the complex humour and was impressed by this debut novel.",
        "year": 2021
    },
    {
        "id": 12662,
        "title": "The Lying Life of Adults",
        "author": " Elena Ferrante",
        "description": "This is raw emotion pinned down into precise social context in the Naples of the 1990s - a fast read where you worry for Giovanna on every page. Ferrante is brilliant on sex, friendship, envy, aspiration - complicated and blunt at the same time. It's not just the lies the adults round you tell, it's the lies you tell yourself as you grow up. Can't wait for a sequel.",
        "year": 2021
    },
    {
        "id": 12768,
        "title": "Just the Plague",
        "author": "Ludmilla Ulitskaya",
        "description": "Fascinatingly imbued with ominous political irony, this balance of absurd and sombre realism is a hard-hitting evocation of past and present. Written with a brisk rhythm and fragmentary structure with stark language and characters that are no more than brief sketches, the cinematic style still captures an oppressive atmosphere and provides food for thought.",
        "year": 2021
    },
    {
        "id": 12968,
        "title": "The Pachinko Parlour",
        "author": " Elisa Shua Dusapin",
        "description": "The simplicity of language reveals Claire’s soul - finding her way as a new adult, but filled with devotion to her grandparents and determined to make their nostalgic dream of revisiting Korea a reality. Her conflicting emotions are no surprise – but the journey inside the mind of this young woman, struggling to reconcile the different cultures of her upbringing, make for an affecting and rewarding read.",
        "year": 2022
    },
    {
        "id": 13113,
        "title": "Days at the Morisaki Bookshop",
        "author": " Satoshi Yagisawa",
        "description": "This heartwarming story follows Takako as she overcomes a break up and learns more about love and life while helping run her uncle's store. All book lovers will recognise the vivid descriptions of finding sanctuary in a book store while falling for the quirky characters that inhabit it. A lovely warm hug of a novel!",
        "year": 2024
    },
    {
        "id": 13157,
        "title": "A Little Trickerie",
        "author": " Rosanna Pike",
        "description": "Told through the irreverent eyes and potty-mouthed words of young narrator Tibb, a vagabond orphan, this is a pacily entertaining and richly moving slice of Tudor life, muddy with the grime of poverty. You'll love your time with Tibb, as she lives off her wits to survive and thrive, building her ragtag band of outcasts, attempting to evade the judgements of a brutally orthodox and punitive Church. Sweary, funny and with a massive heart.",
        "year": 2024
    },
    {
        "id": 13023,
        "title": "The Lost Wife",
        "author": " Susanna Moore",
        "description": "Ostensibly a rather factual, sometimes slightly understated and apparently non- judgemental story that nonetheless creeps under your skin. Through the description of the Sioux uprising of 1862, which causes Sarah, a young white woman, to question her identity and loyalty, I witnessed the effect of war on people who only wish to live in a peaceful, fair co-existence.",
        "year": 2023
    },
    {
        "id": 12571,
        "title": "Heartbreaker",
        "author": "Claudia Dey",
        "description": "Three starkly different but linked characters narrate the story of Billie Jean's life. They use a conversational tone that is punctuated with dark and sometimes comedic wit. Her inexplicable arrival to an isolated and strange town locked in its own disturbed dysfunctional bubble, triggers tragic events and betrayals that affect everyone. Her sudden and mysterious departure however heralds, in contradiction, the hope of redemption and healing.",
        "year": 2018
    },
    {
        "id": 12560,
        "title": "Dear Child",
        "author": "Romy Hausmann",
        "description": "Creepy thriller about an abduction, partly narrated by a small child - Lisa. In this case the house in the woods is lived in by a male ‘witch’ with a God syndrome - with Lisa is his 'Gretel' victim. Also it is about family values and the power of the media to manipulate people’s opinion of the crime. The voice of the child makes it even more haunting and I finished this in no time.",
        "year": 2020
    },
    {
        "id": 12886,
        "title": "Open Water",
        "author": " Caleb Azumah Nelson",
        "description": "Charting the emergent love of two young Black artists in South East London - a photographer and a dancer - this is an exquisitely emotional read. Underlying the book's personal intimacy is a constant trauma that terrorises the unnamed protagonist - power structures constraining and controlling the Black body. Slight but tenderly powerful, with it's cultural influences front and centre - I recommend reading Open Water with Spotify ready to play.",
        "year": 2022
    },
    {
        "id": 13148,
        "title": "Asa: The Girl Who Turned into a Pair of Chopsticks",
        "author": " Natsuko Imamura",
        "description": "There are all sorts of elements in these three stories which appeal to me: e.g. absurdism, imagination, humour, deviousness. All three main characters have something that makes them an outcast, sometimes hit hard by their reality, but with unexpected twists that usually make you either smile or wonder which trick has been played on you.",
        "year": 2024
    },
    {
        "id": 12751,
        "title": "Easy Meat",
        "author": "Rachel Trezise",
        "description": "This is a gritty snapshot of a young Welshman's desire to overcome barriers and change himself for the better. I empathised with his struggles and frustrations, grimacing as another challenge dragged him down, but cheered as he found a way to pull himself through. A brief and unflinching slice of Valley life with a unique voice.",
        "year": 2021
    },
    {
        "id": 13182,
        "title": "Yr Dead",
        "author": "Sam Sax",
        "description": "Ezra is a 27-year-old non-binary gay Jew who has a serious identity crisis. He tries a terrible suicide attempt, after which his life flashes before him in fragments. I could tell this writer is a poet, his viceral use of language is testament to that. But at times it makes the novel feel a bit unhinged - which is unsettling and probably rightly so, judging from Ezra's state of mind.",
        "year": 2024
    },
    {
        "id": 12809,
        "title": "Ballad of a Happy Immigrant",
        "author": " Leonardo Boix",
        "description": "Forget any expectations of voyages filled with suffering and experiences of racist rejection. This unusual poetry collection is a joyful celebration of cross-cultural inheritance and identity, gay freedom and word-popping delight in the everyday things of a new life. An absolute delight.",
        "year": 2021
    },
    {
        "id": 12641,
        "title": "These Violent Delights",
        "author": "Chloe Gong",
        "description": "Readers will find a bit of everything needed in a novel in this promising debut. An exotic setting - Shanghai in the 1930s - great atmosphere, gang warfare, a Romeo and Juliet romance, intrigue, murder, and a river monster. The story moves along apace and keeps you guessing. Extremely violent, but somehow the violence seems incidental and remote as the victims are always viewed at a distance and one murderous gang is as bad as the other.",
        "year": 2020
    },
    {
        "id": 12548,
        "title": "The World to Come",
        "author": "Jim Shepard",
        "description": "A compelling collection of ten stories told in a range of diverse voices mainly based on real events such as a volcanic eruption in 1600BC Crete, a cyclone in 1900s Queensland, an exploration of the Northwest Passage in 1845. Full of descriptive language, there is a sense of foreboding as these dramatic and tragic tales unfold.",
        "year": 2017
    },
    {
        "id": 12707,
        "title": "The Rain Heron",
        "author": " Robbie Arnott",
        "description": "You'll need to work hard to fit the magical, dangerous figure of the heron into a modern-world setting.  I found myself searching for a moral outworking of the violence suffered and inflicted by these very human characters. But it's so worth it - for  the beauty of imagery and in the emotional depth of the final reconciliation.",
        "year": 2021
    },
    {
        "id": 12904,
        "title": "The Bread the Devil Knead",
        "author": "Lisa Allen-Agostini",
        "description": "I really enjoyed the authentic voice of Alethea in this novel. Despite the terrible life she has, there is hope to be found in friendship and the strong bond of family. Her love for her work in a clothes shop gives her a new perspective to escape her abusive boyfriend. But even so, I found the scenes of abuse tough to read.",
        "year": 2022
    },
    {
        "id": 12882,
        "title": "Woman, Eating",
        "author": " Claire Kohda",
        "description": "Sensual, striking and funny, this novel examines the vampire genre through a modern lense. Lydia explores her dual identities of demon and human, and Asian and British, searching for belonging in food, art and relationships. This is a gripping, thrilling and immersive read to sink your teeth into.",
        "year": 2022
    },
    {
        "id": 12993,
        "title": "Intimacies",
        "author": " Katie Kitamura",
        "description": "Intimate relationships and a search for identity form the core of this contemplative and captivating story. But who is the central character?  She is nameless yet so present  - observing life in a city and country she does not know and drawn into the simmering personal dramas of the people she meets -  both privately and in her job as an interpreter at the International Criminal Court. A intriguing story which delivers a deep and affecting read.",
        "year": 2023
    },
    {
        "id": 12854,
        "title": "Summer Brother",
        "author": "Jaap Robben",
        "description": "I just couldn’t stop reading - I became immensely involved in the story about this dysfunctional family, with the seriously disabled Lucien, the heroic, heart-warming, endearing but also clumsy efforts of 13-year old Brian to look after him, as well as the frustratingly neglectful behaviour of Maurice, their father. But despite the dismal situation I felt compassion, love and care take the lead. Lightness prevails where awkwardness threatens.",
        "year": 2021
    },
    {
        "id": 13170,
        "title": "Lula Dean’s Little Library of Banned Books",
        "author": " Kirsten Miller",
        "description": "A joke involving banned books results in a surprising twist in the lives of the conservative residents of a Southern town in America. The writer tries to make a statement for more tolerance with humour - but with a serious undertone. Many readers have found it gripping and deeply moving - but the ending of the book is a bit too much for me.",
        "year": 2024
    },
    {
        "id": 13020,
        "title": "The Housekeepers",
        "author": " Alex Hay",
        "description": "This  joyful romp of a book delivers an Edwardian heist fronted by an team of amazing women.  The plotting is whip-smart and, as the action hots up, it delivers  a high octane blast of energy. The lightness of touch belies a dark underbelly which will have you shouting for justice for the vulnerable and wronged.  But the overall experience in one of pure entertainment building to a hugely satisfying climax.  Hail the housekeepers.",
        "year": 2023
    },
    {
        "id": 12509,
        "title": "Death Is Hard Work",
        "author": "Khaled Khalifa",
        "description": "A Kafka-style waking nightmare, but this is Syria now, with the black absurdity of everyday life being much rarer than everyday death. The style borders on current affairs commentary, the dry facts matching dried-out emotions: when all feeling has gone, the corpses by the roadside have less significance than the concrete blocks by the militia checkpoints. Choose this to challenge just how much human sympathy can you spare.",
        "year": 2020
    },
    {
        "id": 13153,
        "title": "Purity",
        "author": " Andrzej Tichý",
        "description": "If you relish a challenge, look no further. These short stories will take you deep into abused and troubled minds, and who knows what reality will survive. A read that is less Nordic Noir, more Scandi Schizoid – and you may need to return to the ‘good enough’ of your own normality along the way, rather than consuming the whole in one go.",
        "year": 2024
    },
    {
        "id": 13019,
        "title": "Dryland",
        "author": "Sara Jaffe",
        "description": "A hazy and fluid coming of age story told from the perspective of 15 year old Julie, at the moment of her own queer sexual awakening. Evocatively set in the early 1990s, REM, skater culture and the smoke-blur of clove cigarettes run throughout. The read is gentle, dreamlike and detached, as Julie is haunted by the absence of her swimming superstar brother and seeks to re-discover him - and herself - in the depths and rhythms of the swimming pool.",
        "year": 2023
    },
    {
        "id": 12955,
        "title": "HellSans",
        "author": " Ever Dundas",
        "description": "The population is controlled by a typeface called HellSans - just reading it keeps you happy and docile. This is a world where miniature personal computers follow their owners everywhere. They prepare food, monitor your health, direct your car: and inform the government of your every thought. If you wonder about AI and driverless cars and worry that Alexa is listening all the time: this world is only a little ahead of ours!",
        "year": 2022
    },
    {
        "id": 12898,
        "title": "The Transformation",
        "author": " Mette Newth",
        "description": "Reading this book is like walking into a mighty and overwhelming landscape. It also made me very, very frozen. But soon, glimpses of hope and warmth and love come through, tiny and not easily achieved. Navarana, a young Inuit girl, has the spirit of an ice bear, her strength from the old religion and a helper in a gentle Irish monk. But can she save a way of life?",
        "year": 2022
    },
    {
        "id": 12517,
        "title": "Gathering Evidence",
        "author": "Martin MacInnes",
        "description": "A wide ranging futuristic novel covering, religion, philosophy, war, weapons of mass destruction, zoology and murder. But the subjects are secondary to the incredible atmosphere of ‘the unknown’ which is layered and built up throughout the book. Whether set in urban England or in an equatorial jungle, fear is all around. The reader will feel they are watching a superb horror movie dealing with human rather than supernatural terror. Excellent.",
        "year": 2020
    },
    {
        "id": 12910,
        "title": "Time Shelter",
        "author": " Georgi Gospodinov",
        "description": "I never quite knew where this book was going, and it somehow manages to be at once all the genres and yet none of them!  Whilst it has moments of satire, I mostly felt unsettled as I read, and it often seemed more like strangely connected short stories than a complete novel.  Revolving around ideas of memory and forgetting, it left me thinking about the dangers of reaching back towards supposedly happier times and the politicisation of nostalgia.",
        "year": 2022
    },
    {
        "id": 12690,
        "title": "Should We Fall Behind",
        "author": " Sharon Duggal",
        "description": "An optimistic story of life in modern, urban middle-England. A young man is on a quest to find a female friend and ends up in conflict with the community he enters. However, this is not a grim tale and really emphasises the value of communication for reconciliation and resolution.",
        "year": 2021
    },
    {
        "id": 12880,
        "title": "Grey Bees",
        "author": " Andrey Kurkov",
        "description": "Set after the Russian invasion of Crimea in 2014, we follow beekeeper Sergeyich, an inhabitant of the war-battered eastern Grey Zone, as he journeys through Ukraine to seek a safe location for his beehives. His quest navigates us through the complexity of contested territory, where nature, surreal humour and stoic kindness lift an undercurrent of shell-shocked numbness. An illuminating, humane read of care and survival within unending conflict.",
        "year": 2022
    },
    {
        "id": 13015,
        "title": "Black Butterflies",
        "author": " Priscilla Morris",
        "description": "Gently beautiful writing that captures the desperate, devastating effects of the outbreak of war in Sarajevo in 1992.  The helplessness of people trying to continue their normal lives as societal structures collapse around them was very moving and the speed of that collapse was terrifying.  I found it a compelling read, very hard to put down, and Zora was alive in my head and my heart and will stay there for some time.",
        "year": 2023
    },
    {
        "id": 11707,
        "title": "The Buried Giant",
        "author": "Kazuo Ishiguro",
        "description": "Arthur is dead. The land is swathed in a Lethe-like mist. Two old people set out from their village to find their son. This is a tale of a journey, and the encounters upon the way. But it is a difficult journey because memory fails, under the spell cast by a great magician, using the power of a dragon. And journey's end is not their son's home, but another country entirely. This is an elegiac, poetic account of our relationship with death.",
        "year": 2015
    },
    {
        "id": 13044,
        "title": "Your Show",
        "author": " Ashley Hickson-Lovence",
        "description": "Forget over-hyped sports memoirs, this is a fast, pacy novel that conveys what football is really like. It focuses on the ref – the figure hated by pretty much everyone. Plus this ref is Black – the only one in the League. I didn’t know Rennie, I looked him him up when I finished and found out the whole story is true – even more respect for that.",
        "year": 2023
    },
    {
        "id": 12813,
        "title": "The Mercies",
        "author": " Kiran Millwood Hargrave",
        "description": "Life is hard for the women of Vardo, harder still after a freak storm drowns the men of the village. The women find new ways to survive, but the arrival of a witch hunting commissioner and his young wife, threaten everything that island life has been. Like the landscape, emotions and relationships are raw and wild and I was captured by the tension and threat of this story. This is a harsh and emotionally stirring read inspired by true events.",
        "year": 2021
    },
    {
        "id": 12535,
        "title": "One Year of Ugly",
        "author": "Caroline Mackenzie",
        "description": "My eyes were on stalks as I read this story about a family of Venezuelan illegal immigrants living under the radar in Trinidad.  The romance between Yola and Román is tenderly portrayed, the lush beauty of the island vividly evoked.  Bawdy and irreverent?  Perhaps.  Nevertheless, it's a rare treat of a book which tackles some weighty issues in a very entertaining way.",
        "year": 2020
    },
    {
        "id": 12735,
        "title": "Ghosted",
        "author": " Jenn Ashworth",
        "description": "With possibly the most unreliable narrator ever, an underlying supernatural menace pervades this gothic-style novel of buried trauma and grief. The urban working-class setting is a refreshing take on the usual middle class trope of marital disharmony and breakdown. Is it a love story, a mystery or a ghost story? You decide.",
        "year": 2021
    },
    {
        "id": 12797,
        "title": "The Fortune Men",
        "author": " Nadifa Mohamed",
        "description": "Mahmood Mattan left his native Somaliland and went to sea. He became a chancer, and gambler  with little respect for authority. Living in Cardiff's Tiger Bay in 1952 he is arrested for the murder of a shopkeeper. Though innocent, he slowly realises this may not be enough to save him. Based on fact, this book certainly suggests Black Lives did not Matter much in 1950's Britain.  A powerful and timely read.",
        "year": 2021
    },
    {
        "id": 12799,
        "title": "Great Circle",
        "author": " Maggie Shipstead",
        "description": "Hold your breath and get on for the ride. This book goes from 1909 to 2014 with every place and every character brilliantly realised. It soars and dips with exhilarating power as it parallels the lives of 2 strong women: Marian Graves, a pioneering aviator, and Hadley Baxter, a teen superstar making a film about Marian. It’s perceptive, rich and surprising - and will catch at your throat too.",
        "year": 2021
    },
    {
        "id": 12750,
        "title": "Death Drives an Audi",
        "author": "Kristian Bang Foss",
        "description": "A dark vein of satire definitely hits the mark in this road trip novel. A journey of self-discovery is peppered with screwball surrealistic descriptions of the minutiae of life that is absurd, tender and indignant. The social reality is the beating heart of this light yet thoughtful read, enhanced by the needling, genuine friendship of the characters and some colourful writing.",
        "year": 2021
    },
    {
        "id": 12752,
        "title": "Hummingbird",
        "author": "Tristan Hughes",
        "description": "A stunningly beautiful, elegaic account of a small community in Northern Ontario, where everyone is bereaved in some kind of way, and is coping as best they can. Zachary is at the heart of the story, dealing with his mother's suicide. He makes friends with Eva, whose parents died in a place crash. It sounds depressing but it is a story about resilience, coping and survival, written by a master of the craft.",
        "year": 2021
    },
    {
        "id": 13160,
        "title": "The Attic Child",
        "author": " Lola Jaye",
        "description": "The fates of Dikembe, a child taken to England from his family in the Congo in 1906, and Lowra, an orphan mistreated by her stepmother in 1974, are connected by a necklace, some strange writing on an attic wall and a doll. Racism and the mistreatment of children are of all times and can be a depressing read - but this haunting and emotional novel gave hope in the end.",
        "year": 2024
    },
    {
        "id": 12997,
        "title": "Old God's Time",
        "author": " Sebastian Barry",
        "description": "Some books go so deep it is hard to describe them at all. Starting from a policeman’s retirement, this story opens out into the trauma of Ireland, a violence kept secret, its effects explored with such tenderness and empathy it is heartbreaking. The language and landscape are immense and the love of humanity that comes through every page is extraordinary.",
        "year": 2023
    },
    {
        "id": 12952,
        "title": "The Great Passage",
        "author": " Shion Miura",
        "description": "This book is just up my street - great for lovers of language and words. I enjoyed it tremendously and almost forgot the Japanese dictionary Majime worked on for 13 years was a work of fiction. Was almost on my way out to buy it!  Not only does the story tell in detail how dictionaries are made, from the collation of words to the making of special paper, but it has humour and is also a gentle and tender love story.",
        "year": 2022
    },
    {
        "id": 13147,
        "title": "Comrade Papa",
        "author": "GauZ ",
        "description": "In 1880 Dabilly, a young white man, seeks a life of colonial adventure in Cote d'Ivoire, joining the French trying to set up trading routes. A hundred years later, a black boy from Amsterdam is sent to West Africa to visit his grandmother and finds his roots there. Both men tell the story. This is a fresh and witty portrait of colonial and post colonial Africa - well worth reading.",
        "year": 2024
    },
    {
        "id": 12741,
        "title": "The Mystery of Henri Pick",
        "author": "David Foenkinos",
        "description": "An unpublished novel is discovered which goes on to become a French literary sensation. But who is this author Henri Pick? This is the question that, like a gentle breeze, lifts you up and sends you on a playful journey that amuses and teases the reader from start to finish. Quirky and deliciously French, anyone who enjoys a story about the world of books will likely find pleasure in unravelling this charming mystery.",
        "year": 2021
    },
    {
        "id": 12795,
        "title": "An Island",
        "author": " Karen Jennings",
        "description": "Mercifully short, this is the gripping, dark but beautifully written tale of Samuel, an elderly man who is living out his life on an unnamed African island, battling nature, and battling his past.  The post-colonial country setting arouses elements of political commentary, especially around refugees and xenophobia.  In our own post-lockdown world, the paranoia that comes with extended isolation is interesting to consider.",
        "year": 2021
    },
    {
        "id": 13027,
        "title": "Nineteen Claws and a Black Bird",
        "author": " Agustina Bazterrica",
        "description": "Forget your expectations of nice short stories to lull you off to sleep, this experience is about as comfortable as sitting on a wasp nest. Each story will only take you five to ten minutes to read, but you will need a good day to recover from the shock that they deliver.",
        "year": 2023
    },
    {
        "id": 12668,
        "title": "The Octopus Man",
        "author": " Jasper Gibson",
        "description": "Tom hears voices, or specifically the Voice - the god who punishes disobedience, but rewards with transcendental illumination. I reflected on the irony that the mental health system which supposedly cures him, and fails at so many levels in the process, actually creates a worse disorder in his personality; and I loved Tom for his delight in nature, wry detachment and determination to survive the random help of professionals, family and friends.",
        "year": 2021
    },
    {
        "id": 12972,
        "title": "I Am Not Your Eve",
        "author": " Devika Ponnambalam",
        "description": "A chorus of voices combine to reclaim the story of Teha-amana, muse and child-bride of artist Paul Gauguin, and subject of his painting 'Spirit of the Dead Keeps Watch'. Set in Tahiti, the book interweaves exquisite retellings of Polynesian origin myths with troubling colonial power abuses behind the painting. Familiarise yourself with the artwork before reading if you can, as this makes the book's multiple voices resonate even more profoundly.",
        "year": 2022
    },
    {
        "id": 12909,
        "title": "Five Little Indians",
        "author": " Michelle Good",
        "description": "Five Little Indians casts a light on the Canadian Indian Residential Schools system, and on the long-lasting impact it had on five indigenous children as they moved into adulthood and mainstream society. It isn't a comfortable read, detailing abuses these children experienced - but in amongst the tragedy there is hope and a hint of optimism. It's a story of hurt, resilience, and finding a way forward in life.",
        "year": 2022
    },
    {
        "id": 12983,
        "title": "Swimming in the Dark",
        "author": " Tomasz Jedrowski",
        "description": "An lyrical coming of age story set within early 1980's Poland. We follow soon-to-graduate Ludwik and their rapidly blossoming love affair with Janusz, in the temporary idyll of a summer camp. Soon, the grip of the repressive State exerts its ever stronger hold over Ludwik's attempts to live a life true to themselves. Both the freedom and the constraint is powerfully drawn - I found this an evocative and illuminating read of individual resistance.",
        "year": 2023
    },
    {
        "id": 13051,
        "title": "Matrix",
        "author": " Lauren Groff",
        "description": "What a direct, visceral approach to history. The sensual language and clever plotting will sweep you along in a vivid story about nuns and power in the twelfth century. It feels edgy and contemporary – and will give you hope for women and feminism everywhere.",
        "year": 2023
    },
    {
        "id": 13189,
        "title": "Duets",
        "author": "Jon McGregor",
        "description": "These stories are a daringly experimental concept: eight pairs of authors contributing their creative inspirations into the unknown. There’s some delightful discoveries and diversions, but you might feel some are several steps too far ….",
        "year": 2024
    },
    {
        "id": 13037,
        "title": "Yellowface",
        "author": " Rebecca F Kuang",
        "description": "A hapless writer steals the unfinished manuscript of her late popular Asian friend. With its publication under her own name, the discussion about cultural appropriation gets going and everything becomes seriously out of hand. This novel is simultaneously satire, indictment and suspense. A brilliant combination that held my attention until the bitter end.",
        "year": 2023
    },
    {
        "id": 12569,
        "title": "Memoirs of a Polar Bear",
        "author": "Yoko Tawada",
        "description": "This is a book to take your time over and let yourself be consumed by the stories of three generations of polar bears, each of them living side by side with their human counterparts, fully co-existing in civilian life. The tale begins with the grandmother's experiences in the Soviet Union and as it evolves you'll become increasingly beguiled by its strange beauty, enhanced by a wonderful translation.",
        "year": 2016
    },
    {
        "id": 12733,
        "title": "The Employees",
        "author": "Olga Ravn",
        "description": "Concise, but endlessly deep this is a haunting read. Told through a series of statements by the crew - some human, some humanoid - of the Six-Thousand spacecraft, this is off-world poetry. Don’t be put off by the unconventional form: the sense of emotional depth is accessible, relevant, full of devastating longing. An astonishing read that resists classification, both detached yet tactile and intimate enough to invite multiple revisits.",
        "year": 2021
    },
    {
        "id": 12642,
        "title": "Love After Love",
        "author": "Ingrid Persaud",
        "description": "A fresh and tender story centred on an unconventional family, with a man as its linchpin.  We could all do with a Mr Chetan in our lives, his personality radiates warmth and sincerity.  Underlying the air of playfulness are deeper issues: domestic violence, homophobia and self harm - be warned if you are squeamish!  Reading this book is like being wrapped in a cosy blanket, but just be prepared for moments when it will be whisked away.",
        "year": 2020
    },
    {
        "id": 12949,
        "title": "The Book of Goose",
        "author": " Yiyun Li",
        "description": "This is a story of a friendship, told in hindsight as a tribute to her lost childhood friend.  Even though it's written in an almost factual style, it's very moving indeed. Despite the apparent easy way of telling, there is a suspense that makes you wonder how what started out as a game could have such a disruptive life-changing effect.",
        "year": 2022
    },
    {
        "id": 12980,
        "title": "Now She is Witch",
        "author": " Kirsty Logan",
        "description": "This is a deeply atmospheric tale set in an imaginary world but with a medieval feel, where women are powerless and persecuted as witches. It follows the journey of two women trying to take control of their own lives: Lux, who survives through selling potions and poisons, and Else, a mysterious stranger seeking revenge on a man who has wronged her.  Dark and often disturbing, it does however have some moments of hope and beauty.",
        "year": 2023
    },
    {
        "id": 12583,
        "title": "The Left-handed Booksellers of London",
        "author": "Garth Nix",
        "description": "What’s really clever about this fast-paced tale is how the old magic world sits alongside a very believable and detailed England in 1983. The main characters really grow on you as they battle for survival. And the many booksellers – both left and right handed – are a delight. ",
        "year": 2020
    },
    {
        "id": 12981,
        "title": "In Ascension",
        "author": " Martin MacInnes",
        "description": "Jaw-dropping and intellectually daring; profound in both the stellar and oceanic vastness of the backdrop as well as the minutiae of nature and human emotion, this book intrigues and haunts. I'm still tingling with the evocative detail and rich atmosphere, written with poetry and humanity and in-depth science that absorbs and feels so much more than fiction.",
        "year": 2023
    },
    {
        "id": 12849,
        "title": "The Historians",
        "author": "Eavan Boland",
        "description": "A wonderful volume of poetry exploring history - personal, familial and cultural.  Though simple, these are poems which perfectly capture small moments, transcending place and time. This is a collection to be savoured, not rushed; with each reading, there is something new to be discovered.  Winner of the Costa Poetry Award 2020 and sadly, the author's final work.",
        "year": 2021
    },
    {
        "id": 13025,
        "title": "Ada's Realm",
        "author": " Sharon Dodua Otoo",
        "description": "Ada is born and reborn in a 15th century Ghanaian village, a world war 2 concentration camp and modern day London and Berlin. Her lives are linked by a bracelet and a narrator who embodies a door knocker, a hut and a passport - and who has a long running tussle with God to be born a human. Moving yet often funny, I loved the whole concept and originality of this debut novel and its progress through the centuries. God is brilliant!",
        "year": 2023
    },
    {
        "id": 13095,
        "title": "Animals Eat Each Other",
        "author": "Elle Nash",
        "description": "This should be a coming of age story, but our protagonist lives outside of any positive support networks where grief, self harm and substance abuse have left her with detached sense of self loathing. Using sex to seek validation she embarks on an obsessive relationship with a young couple. Scenes are almost exclusively repellent and traumatic as our nameless main character struggles with a lack of self worth, shame and destructive relationships.",
        "year": 2024
    },
    {
        "id": 1719,
        "title": "The Temple of Optimism",
        "author": "James Fleming",
        "description": "A very spritely look at country life in the 18th century. Will young man about town Ned sell his inheritance, the pretty but crumbling Temple of Optimism, or stay and become a gentleman farmer? Will Lady Apreece follow her heart, having fallen for a man ten years younger, or stay in her loveless marriage as society expects?  A very luscious book, full of rich, sensuous images, all about love and money.",
        "year": 2000
    },
    {
        "id": 13010,
        "title": "The Bandit Queens",
        "author": " Parini Shroff",
        "description": "This is a story that will throw you from laughter to tragedy and from tenderness to horror. Geeta finds herself unwittingly leading a group of gritty women in a murderous plot to escape their husbands and the stereotypes and injustices endowed by gender, caste and poverty. Be prepared for scenes of domestic violence and rape.",
        "year": 2023
    },
    {
        "id": 12721,
        "title": "A Long Way From Douala",
        "author": " Max Lobe",
        "description": "I found this book to be a compassionate coming-of-age journey through a richly described Cameroon. I enjoyed reading about a whole host of colourful characters from grief-stricken parents to corrupt police and shady people smugglers. I felt the ever-present threat of Boko Haram but laughed at the developing relationship between two friends as they navigate through a country in turmoil and search for their runaway brother.",
        "year": 2021
    },
    {
        "id": 13001,
        "title": "Enter Ghost",
        "author": " Isabella Hammad",
        "description": "This is passionate, poignant and highly topical story of family tensions and Arab identity - as the personal meets the political head on. Following the failure of her marriage, actress Sonia leaves London to visit her sister in Haifa. She is soon persuaded to appear in a production of Hamlet in the West Bank – a crowded world full of check points, tension and tear gas. Here she finds that learning the lines is the easy part.",
        "year": 2023
    },
    {
        "id": 13057,
        "title": "The Heaven & Earth Grocery Store",
        "author": " James McBride",
        "description": "The Jewish and black residents of a poor neighborhood in Pennsylvania come together to welcome a deaf-mute boy into their community. When he is placed in an inhumane institution, at the hands of a racist, they form a complex plan to free him. I enjoyed the storytelling, the dry wit and the way the author paints the people, but was shocked at the scenes in the psychiatric ward. But in the end, it's the good in ordinary people that delivers hope.",
        "year": 2023
    },
    {
        "id": 13017,
        "title": "Fire Rush",
        "author": " Jacqueline Crooks",
        "description": "This is a pulsing, skanking, swaying novel that reverberates inside you long past its end. Each sentence jerks and twists with the lyrical swing and rhythm of patois and dub. Music and dance is the way to connect with ancestors and survive in a hostile world of racism, police brutality and male violence. Despite this bleak reality, this book fills your heart and you fight, you struggle, you resist and you definitely dance.",
        "year": 2023
    },
    {
        "id": 12947,
        "title": "The Trees",
        "author": "Percival Everett",
        "description": "You wouldn’t think a book about lynching would be funny, but somehow this police procedural story, that addresses both historical and modern day racism, veers from biting humour to horrifying retribution in a setting both familiar and strange.  It's loaded with swearing and racial slurs, but that's all part of the satire. As the deaths pile up, and what began as a revenge crime snowballs into something much bigger, it becomes increasingly unreal.",
        "year": 2022
    },
    {
        "id": 12637,
        "title": "Ghosts",
        "author": "Dolly Alderton",
        "description": "Nina George Dean is a 30-something single female living in London searching for Mr Right.  At the start, I was fooled into thinking she was just another Bridget Jones wannabee with the promise of a happily-ever-after ending. Yet I was pleasantly surprised to find a deeper layer to Nina's story; one which was compelling, touching and very real.",
        "year": 2020
    },
    {
        "id": 12552,
        "title": "Paul Takes the Form of a Mortal Girl",
        "author": "Andrea Lawlor",
        "description": "Set in the 1990s' LGBTQ+ community in America, Paul is a shape-shifter, who can alter their body from male Paul to be female Polly; their gender and sexuality are both fluid. Though I didn't always like Paul/Polly, I was utterly caught up in their life. Encompassing masses of pop culture, plenty of smut, and both tragedy and comedy throughout, this is a wild, fast, addictive read.",
        "year": 2019
    },
    {
        "id": 12746,
        "title": "Where The Wild Ladies Are",
        "author": " Aoko Matsuda",
        "description": "I had to read these stories very attentively in order to detect the subtle connexions in the seemingly unrelated narratives. Inspired by traditional Japanese ghost tales they are written in an observant style, and give us glimpses into the lives of (mostly) ordinary women who mingle with creatures from the world of the dead as if that is the most natural thing to do. Best savoured in small quantities for even better appreciation.",
        "year": 2021
    },
    {
        "id": 12894,
        "title": "Learning to Talk to Plants",
        "author": "Marta Orriols",
        "description": "I wasn’t always sure I liked Paula - and that may be an issue for some readers - but the delicate prose drew me into this poignant portrayal of her double loss of death and betrayal.  Occasional lighter moments mean that whilst this is sad, it isn’t depressing, and its brevity means the plunge into the numbness of her grief doesn’t last too long.  My favourite parts were of Paula at work on the neonatal ward, and I found those very moving.",
        "year": 2022
    },
    {
        "id": 12911,
        "title": "My Name is Yip",
        "author": " Paddy Crewe",
        "description": "This language of this Dickensian tale has a rhythm you can almost hear spoken out loud in the Southern drawl that I imagine it would have. But Yip is mute and cannot speak, so you would never be able to hear that voice for real. This seemingly simple story shows alternately a naïve way of writing and a depth of thought, acquired by Yip over the years. He will survive and that makes this voice-driven story not as harsh as it sometimes seems.",
        "year": 2022
    },
    {
        "id": 12596,
        "title": "Crossing",
        "author": "Pajtim Statovci",
        "description": "Bujar feels he was born in the wrong country and in the wrong body. The Crossing is a powerful and sometimes harrowing search for identity, and sometimes just food and shelter, as he travels across Europe and the USA in search of home and happiness.",
        "year": 2019
    },
    {
        "id": 12619,
        "title": "If I Had Your Face",
        "author": "Frances Cha",
        "description": "For a woman of low status to survive in Seoul, the cultural norms dictate that their face must be their fortune. Like an ironic take on the tale of The Little Mermaid – exploitation and pressure to undergo  painful cosmetic surgery follows. This bold chronicle of four women delivered an insightful and provocative look at the universal obsession with ‘looks’ and the objectification of women the world over. For me - a bleak yet compelling read.",
        "year": 2020
    },
    {
        "id": 12791,
        "title": "Palmares",
        "author": " Gayl Jones",
        "description": "A disturbing, coming of age story of a young slave girl in 17th century Brazil, seeking to find her identity.  As she is moved from plantation to plantation she hears of a place called Palmares where former slaves are said to be free. But is it the paradise it seems? This complex tale is told in a dispassionate way, but is woven with magic realism and mysticism. bringing a sense of hope to an otherwise bleak struggle.",
        "year": 2021
    },
    {
        "id": 12899,
        "title": "Winchelsea",
        "author": " Alex Preston",
        "description": "This novel has all the ingredients of a swashbuckling tale of smuggling and conspiracy with a twist. Diamonds in the rough, flashing swords and smoking muskets, romances and a rather surprising main character. I got a kick from the atmosphere and the action.",
        "year": 2022
    },
    {
        "id": 12946,
        "title": "The White Rock",
        "author": " Anna Hope",
        "description": "The rock off Nayarit, Mexico, is the sacred place of the Wixarika, where their world began. The author, in character as Anna ‘the writer’, is on a pilgrimage to the rock as environment catastrophe seems the inevitable end of our world. Her stories book-end the historic episodes the rock has witnessed, full of betrayals of humanity, but pervaded by a spirit of hope that our crisis will not be final. An intensely emotional and lyrical read.",
        "year": 2022
    },
    {
        "id": 12853,
        "title": "Femlandia",
        "author": " Christina Dalcher",
        "description": "When society dissolves Miranda and her teenage daughter must abandon their previous existence and find a way to survive. As the sanctuary they find at a women’s commune grows increasingly uneasy, I found a dreadful fascination in the sinister atmosphere. This is a tense, provocative read which explores feminism, motherhood, belonging and power.",
        "year": 2021
    },
    {
        "id": 12689,
        "title": "Vernon Subutex 1",
        "author": " Virginie Despentes",
        "description": "Ever wondered what the Parisienne pop music scene was like in the 1980s, but were too afraid to ask? Well – here’s your chance. Graphic descriptions, some verging, IMO, on the pornographic, of the music scene in the 1980s to terrifying descriptions of night life on the Paris streets in the 2000s. Realistic characters, all trying to come to terms with what they haven’t achieved. I’ll definitely be reading more contemporary French novels.",
        "year": 2021
    },
    {
        "id": 12698,
        "title": "Girl",
        "author": " Edna O'Brien",
        "description": "A harrowing tale, based on true accounts of the kidnapping of 276 schoolgirls by jihadist group Boko Haram in 2014.  This book shows one young girl’s courage and determination to survive against all the odds whilst battling with her new identity as a mother. This is a violent, forced coming of age story, told with a shocking detachment and a terrible growing understanding of people and power.",
        "year": 2021
    },
    {
        "id": 12539,
        "title": "Sex and Vanity",
        "author": "Kevin Kwan",
        "description": "A romping homage to E.M. Forster’s ‘A Room with a View’, this book pokes fun at the impossibly wealthy, whilst peeling away the layers of elitism and racism in a world far beyond the imaginings of most readers.  Loaded with ridiculous opulence, and name-drops galore (with footnotes to explain them in some cases), it’s easy beach reading that left me hankering for a re-watch of the old Merchant Ivory film.",
        "year": 2020
    },
    {
        "id": 12829,
        "title": "The Woman in the Purple Skirt",
        "author": " Natsuko Imamura",
        "description": "Immediately unsettling, this is a clever and disturbing farce. We see the lonely protagonist developing an obsession with another woman - and, in a series of mundane scenes of commuting, shopping and the workplace, things become more complex. And as little by little, we glean information about the characters we question their agency and respective power.",
        "year": 2021
    },
    {
        "id": 12589,
        "title": "New Daughters of Africa",
        "author": "Margaret Busby (ed)",
        "description": "Daughters of Africa was published by Margaret Busby in 1992. This is the update, celebrating women of African descent across the world. There are hundreds of contributors, many of whom I have worked with both as a librarian and in the anti-racist movement. The variety in content is huge – I recommend you dip in and out for the best reading experience. A must read for anyone looking to understand the role of black women in our world.",
        "year": 2019
    },
    {
        "id": 12665,
        "title": "Backstories",
        "author": " Simon Van Der Velde",
        "description": "These are vignettes of the lives of people before they became famous, or, in some cases, notorious. There was only one that I could not identify, but the historical circumstances of his life soon became very obvious and it was fun guessing. It is strange meeting these people before they became the people known to history - but that's what makes this reading this book so fascinating.",
        "year": 2021
    },
    {
        "id": 13016,
        "title": "Pod",
        "author": " Laline Paull",
        "description": "You might worry that an adventure tale of dolphins, featuring their intelligence and resourcefulness in overcoming the adversities of natural survival and ecological disaster, would feel anthropomorphically sentimental. Not so. The scientific research that Paull employs in her story raises it far above any such niceness, with a powerful moral message around environmental crisis.",
        "year": 2023
    },
    {
        "id": 12759,
        "title": "Intimacies",
        "author": " Katie Kitamura",
        "description": "Intimate relationships and a search for identity form the core of this captivating story. A young woman works as an interpreter at the Criminal Justice Court in the Hague where she is drawn into simmering personal dramas which impact on both her work and private life: a former African president accused of war crimes; a lover still embroiled in a painful marriage; a friend who witnesses a violent crime. A deep and affecting read.",
        "year": 2021
    },
    {
        "id": 12574,
        "title": "A Cosmology of Monsters",
        "author": "Shaun Hamill",
        "description": "Offbeat horror as an ordinary small town American family are haunted by monsters. Much of this book charts Noah's coming of age but at the edge of everything, just out of sight, is a darker world which gradually draws him in.",
        "year": 2019
    },
    {
        "id": 12826,
        "title": "The Raptures",
        "author": " Jan Carson",
        "description": "When children begin falling sick in a rural community, a multitude of conflicts are scratched wide-open. Told largely through the eyes of 11 year old Hannah, this entertaining and empathetic read pulls you in many directions: from the sadness and horror of illness to the rich humour of early Nineties pop culture. A ghost story, a study of the end of childhood, and an examination of faith in Northern Ireland, this is a vivid and exhilarating read.",
        "year": 2021
    },
    {
        "id": 12885,
        "title": "How High We Go in the Dark",
        "author": " Sequoia Nagamatsu",
        "description": "Spanning thousands of years and numerous and diverse locations, this is the story of a deadly virus and its implications for the future of the human race. Told through a myriad of inter-linked stories which are at times tender, often desperately sad and always dark and probing, this novel explores death and grief and our responsibilities for one another and our planet.",
        "year": 2022
    },
    {
        "id": 12867,
        "title": "The Beauty of Your Face",
        "author": " Sahar Mustafah",
        "description": "The disappearance of a beloved elder sister has a great and devastating impact on the lives of a Palestinian family living in Chicago. The other sister, Afaf, grows up to be a religious woman - seeking solace with the Muslim community. I thought I knew things got bad for Muslim people after 9/11, but this novel showed me the terrible aftermath on ordinary lives more deeply.",
        "year": 2022
    },
    {
        "id": 12858,
        "title": "Betty",
        "author": " Tiffany McDaniel",
        "description": "Heartbreaking, but what a brave girl Betty is. She doesn’t let her life be ruined by her strong, but scarred mother, or her schoolmates who call her names because of her Native American heritage. I found it shocking how in the sixties even teachers treat her abominably. Luckily she has a loving Cherokee father who teaches her all about respect for nature, and she has her siblings - who are firmly on her side. A beautiful coming-of-age story.",
        "year": 2021
    },
    {
        "id": 12958,
        "title": "The Black Maybe",
        "author": " Attila Veres",
        "description": "These short stories are really weird.  To give you a clue, the first story is about the boyfriend of a woman who is addicted to biting dogs, and what happens in their relationship. There are ten stories in this collection and each is more bizarre than the last one. Reading this book feels like meeting the Ancient Mariner who, pinning  you to the wall,  tells you stories that will leave you a wiser yet sadder person.",
        "year": 2022
    },
    {
        "id": 12747,
        "title": "The Queue",
        "author": " Basma Abdel Aziz",
        "description": "This is a dystopian novel set in Egypt (though it is not named) following the failure of the Arab Spring.  After the uprising every aspect of life is controlled by The Gate. People must join the Queue for the Gate to obtain permission for almost everything, but the Queue never seems to move. Phones are hacked, people disappear. A chilling and thought-provoking read in equal measure.",
        "year": 2021
    },
    {
        "id": 13003,
        "title": "One Small Voice",
        "author": " Santanu Bhattacharya",
        "description": "This is the story of the physical and mental damage done to a young Hindu man, following the sacking of the Ayodhya Mosque.  He is haunted by events that he could not have prevented.  We walk alongside him as he learns to live with the rising religious tensions in Mumbai, making friends across the religious divide - but at the same time, coping with the fanatics in his own family.  It is both a riveting and heart-rending read.",
        "year": 2023
    },
    {
        "id": 12802,
        "title": "After Beth",
        "author": " Elizabeth Enfield",
        "description": "This story of ‘a mother’s worst nightmare’ will wrench at the guts of any parent. I was impressed by the author’s skill in writing so movingly about bereavement without the least cloying or maudlin sentiment. It is not a depressing read, despite the subject, and I am sure that reading about how the mother gets through the stages of grief could be a consoling process for someone going through a similar experience.",
        "year": 2021
    },
    {
        "id": 12992,
        "title": "Deep Down",
        "author": " Imogen West-Knights",
        "description": "This debut novel explores the simmering tensions of a family where certain questions daren't be asked, let alone answered. A brother and sister, brought together by their father's death, explore the catacombs beneath Paris. You will laugh at the fraternal arguments, recognise the shared pain of a death in the family, and flinch at the flashbacks as hidden memories force them to face their past.",
        "year": 2023
    },
    {
        "id": 13161,
        "title": "All Fours",
        "author": " Miranda July",
        "description": "A brutally honest rollercoaster of a read.  Relationship tensions, fuelled by peri-menopausal symptoms and a troubled past, initiate the road trip meant to bring emotional calm to a troubled woman in this uncompromising and sexually explicit book.  A dry, witty and sometimes slightly comic curiosity drives the pace as she veers off track and into the unchartered waters of self-discovery. This is a bold search for self and sexual fulfillment.",
        "year": 2024
    },
    {
        "id": 12905,
        "title": "Of Saints and Miracles",
        "author": "Manuel Astur",
        "description": "Although very loosely taking its lead from crime fiction, this book is more a pastoral hymn to the interconnectedness of things. As outcast villager Marcelino goes into hiding, we move through a fully realised Spanish countryside, created through myth, fable and rural rhythms, and the intermingling of past and present. This is a mindful reading experience, poetic and lyrical: each word combination is to be savoured.",
        "year": 2022
    },
    {
        "id": 13030,
        "title": "Titanium Noir",
        "author": " Nick Harkaway",
        "description": "It took me a while to find my feet with the style, but once I did this was a pacey, intriguing and pleasingly short read with what felt like the option of a sequel.  The imaginary future-city, Chersenesos, feels like New York and it’s a slightly odd but fun mix of gumshoe detective and speculative fiction, with a wild fight scene or two.",
        "year": 2023
    },
    {
        "id": 13180,
        "title": "The Safekeep",
        "author": " Yael van der Wouden",
        "description": "A symphony in three parts: understated, very passionate and held-back prose. I witnessed restraint, tension, non-communication, loneliness, sexuality, the search for identity, recognition, remorse, and more. The story captures a time in which the aftermath of WWII is still very present. A very cleverly written tale which made me realise how ignorance and reticence can distort reality and, sadly, destroy trust.",
        "year": 2024
    },
    {
        "id": 12564,
        "title": "Canal Dreams",
        "author": "Iain Banks",
        "description": "The Panama Canal, one of the world's greatest feats of engineering, is an unusual setting for a thriller; and Hisako Onoda, an unlikely heroine. This slowly unfolding story lulled me into a false sense of security so that the ensuing bloodbath came as a shock. When the narrative slips into Hisako's past, it goes some way towards explaining the complexity and resilience of her character. Definitely one to recommend.",
        "year": 1989
    },
    {
        "id": 12727,
        "title": "How Beautiful We Were",
        "author": " Imbolo Mbue",
        "description": "What impressed me in this book were the different perspectives. They clarify the impact of an environmental disaster on ordinary African people: powerless children, wise elders and the generation of the girl Thula, that intends to take action. I didn’t feel uplifted after reading this, but moved, frustrated and angry at the American oil company that preys on the land and the villagers' homes, like a swarm of locusts  on a wheatfield.",
        "year": 2021
    },
    {
        "id": 12732,
        "title": "How to Kidnap the Rich",
        "author": " Rahul Raina",
        "description": "A cynical, satirical view of how to get rich quick in India, while trying to avoid prison. Think of Dashiell Hammett or Raymond Chandler on speed. Or that master of Tartan Noir, Christopher Brookmyre. There are villainous villains, devious plotters and Ramesh in the middle trying to work out what is going on and how to get out of it.  Don't expect 'happily ever after' but the ending is believable.",
        "year": 2021
    },
    {
        "id": 12866,
        "title": "Chronicles from the Land of the Happiest People on Earth",
        "author": " Wole Soyinka",
        "description": "A novel for readers who like a challenge. It certainly asked a lot of me. The witty intervals reminded me of the stand up comedy of ‘Live at the Apollo’ and made this fat brick of a satire of modern Nigeria more than worth the effort. Like the discussion about a new name for the Minister. Or the fantastic abbreviations for everything. But it’s a complex story which also criticizes political corruption, child abuse and self interest.",
        "year": 2022
    },
    {
        "id": 12770,
        "title": "How the One-Armed Sister Sweeps Her House",
        "author": " Cherie Jones",
        "description": "This island in the West Indies - a paradise for some, mainly white tourists. An opportunity for the residents who try to make a living - and a hell for Wilma and her granddaughter Lala who suffer at the hands of their criminal, violent men. There also is love - but heartbreak and danger too. Beautifully written, but an emotionally draining read. I had to have a break from it before finishing.",
        "year": 2021
    },
    {
        "id": 12830,
        "title": "Afterparties",
        "author": " Anthony Veasna So",
        "description": "These short stories, although published separately, form a background continuum of So’s extraordinary and tragically short life. All the emotional turmoil and identity crisis of growing up with Cambodian refugee inheritance is here, along with all the perils of gay experiences in Silicon Valley society, forming a lighthearted, tragicomic shooting star of a read.",
        "year": 2021
    },
    {
        "id": 12645,
        "title": "The Air Year",
        "author": "Caroline Bird",
        "description": "I loved these poems. Each one is sad, funny, easily accessible and totally female in empathy, relationships and outlook.  A great place to start if you are new to modern poetry. I will certainly be reading her two other collections and look forward to her future work.",
        "year": 2020
    },
    {
        "id": 12680,
        "title": "The Pear Field",
        "author": " Nana Ekvtimishvili",
        "description": "An atmosphere of foreboding permeates a residential school for abandoned children where they are prey to brutal institutional cruelty, sexual abuse and neglect. The detached narrative in present tense imparts a documentary effect, but the details are harrowing and distressing to read. This is the second in the ‘Closed Universe’ series on the theme of isolation and can be viewed as representative of moral decay in post Soviet Georgian society.",
        "year": 2021
    },
    {
        "id": 12679,
        "title": "The Empress of Salt and Fortune",
        "author": " Nghi Vo",
        "description": "A story with a talking Hoopoe, I had my reservations. But this charming Chinese-flavoured fantasy with stories inside stories about the empress In-Yo, her servant Rabbit and visiting cleric Chih, grabbed my attention after the first chapter. I find it so worthwhile to immerse myself in a totally different world from mine.",
        "year": 2021
    },
    {
        "id": 13115,
        "title": "Children of Paradise",
        "author": " Camilla Grudova",
        "description": "Be drawn in by the dilapidated charm and nostalgia of The Paradise cinema, just like Holly who, desperate to fit in, becomes part of the chaotic group of misfits who work there. Drug use, lust and fear cloud the hallucinatory gory episodes that haunt her as both the cinema and relationships crumble. Strange, gothic and surreal yet with a sting of harsh reality, this book threaded with film references is a cinematic and visual read.",
        "year": 2024
    },
    {
        "id": 12979,
        "title": "The World and All That It Holds",
        "author": " Aleksandar Hemon",
        "description": "A globe-trotting, century-spanning novel in which Rafael Pinto is a spectator at almost every major conflict of the last 100 years. This is a complex mixture of fact and fiction - a novel about love, language and the importance of family.",
        "year": 2023
    },
    {
        "id": 12756,
        "title": "Cwen",
        "author": " Alice Albinia",
        "description": "This earthy magical and cleverly woven tale is interspersed with historical facts and mythologies.  It is a gutsy read laced with literary references to environmental and feminist concerns. Radical and bold it tells with intensity of a disappearance and uses court transcripts from the investigation to reveal a cast of diverse women who are driven to develop a new and more meaningful community.  It's a unique reimagining of how our world could be.",
        "year": 2021
    },
    {
        "id": 13067,
        "title": "Beasts of England",
        "author": "Adam Biles",
        "description": "This updated version of 'Animal Farm' sees Orwell's famous novel remade for our modern era, replete with fake news and pandemics, and retaining the razor-sharp satire and political commentary of the original. You will wince as you spot the real-life allegories, groan at the all-too-familiar politicians of the farmyard, but laugh at the dark humour that runs throughout the novel.",
        "year": 2024
    },
    {
        "id": 12491,
        "title": "Of Strangers and Bees",
        "author": "Hamid Ismailov",
        "description": "The three-stranded narrative is told from the perspective of three different characters: an exiled Uzbek writer, an ancient magical dervish, and a honey bee. I found the complexity of the structure challenging at times, as the connection between the separate stories wasn't immediately obvious. Yet as the tales began to overlap, I willingly accompanied the Uzbek writer on his quest for answers; as eager to discover the truth as he.",
        "year": 2019
    },
    {
        "id": 12703,
        "title": "The Disaster Tourist",
        "author": "Yun Ko-Eun",
        "description": "A surreal thriller combined with a satirical commentary on modern capitalism, environmental exploitation and the nature of tourism.  Yona works for a travel company organising trips to disaster zones, but when she ends up on one of their holidays to an island off Vietnam, she finds that things are not quite as they seem.  An original and intriguing story that holds you in its grip as ever increasing danger draws it towards a climax.",
        "year": 2021
    },
    {
        "id": 13100,
        "title": "Wandering Stars",
        "author": " Tommy Orange",
        "description": "The blended family of Cheyenne grandmothers, Opal and Jacquie, search for their identity and place in modern society. The brutal history of their people takes its toll on their grandsons – especially Orvil,  who was shot after attending a Powwow and is consequently addicted to pills. This is not an easy read – but it is powerful and affecting and all the people this story were of flesh and blood to me.",
        "year": 2024
    },
    {
        "id": 13114,
        "title": "Not A River",
        "author": "Selva Almada",
        "description": "Sensory and fluid, this poetic read is brief but as deep as the waters that run through it. What begins as a group fishing trip soon expands into tributaries where the past and present flow alongside each other, one haunting the other. You'll be immersed in the evocation of rural Argentinian life - the smoke of barbecued chorizo will sting your eyes, the thick web of woodland spiders will cling to your skin, dreamlike in the haze of heat.",
        "year": 2024
    },
    {
        "id": 12844,
        "title": "The Dangers of Smoking in Bed",
        "author": "Mariana Enriquez",
        "description": "A short story collection that may seduce or repel you, but is impossible to ignore. The stories reach extreme places of terror and horror, but are always grounded in a tangible reality and recognisable social divisions of class, adolescence and generational trauma. Although an intense reading experience, most of the stories are brief stabs, allowing you chance to gasp and reach for daylight in-between tales.",
        "year": 2021
    },
    {
        "id": 12635,
        "title": "The Mermaid of Black Conch",
        "author": "Monique Roffey",
        "description": "Told through multiple voices, this is a story of human emotion, intertwined with indigenous myth and more recent, very real, history, where the arrival of mermaid Aycayia to the island of Black Conch is the catalyst for some monumental changes. For all the pain and loneliness of the book, I found it was the sense of connection and potential for positive change that Aycayia sets in motion that stayed with me. A sensual, hypnotic and riveting read.",
        "year": 2020
    },
    {
        "id": 13080,
        "title": "Perilous Times",
        "author": " Thomas D. Lee",
        "description": "Sir Kay and his fellow knights awake from their mythical slumber whenever Britain has need of them; they fought at Agincourt and at the Somme. This time they are fighting climate change and a dragon. This enteraining read is a bit of a one-off  - think Monty Python and the Holy Grail meets the eco-warriors in this mash-up of Arthurian legend and contemporary fantasy.",
        "year": 2024
    },
    {
        "id": 12801,
        "title": "The Reading List",
        "author": " Sara Nisha Adams",
        "description": "A book after my own heart! Mukesh, a lonely, older man, and Aleisha, a young girl, meet in a small local library in Wembley. They share their reading experiences after finding a note with book recommendations left by a mysterious visitor and draw strength from the stories. A lovely and optimistic novel.",
        "year": 2021
    },
    {
        "id": 13172,
        "title": "The Fertile Earth",
        "author": " Ruthvika Rao",
        "description": "I listened to the audiobook, and you might like to also, to get an authentic Indian voice telling an epic story which spans from 1955 to 1990. The deep themes of childhood innocence, impossible relationships across the class divide, Communist idealism and violence, and the beauty of the landscape of Telangana will definitely hold you. But these are  transcended by the characters - whom you will love.",
        "year": 2024
    },
    {
        "id": 12874,
        "title": "Co-wives, co-widows",
        "author": " Adrienne Yabouza",
        "description": "Two African women, Ndongo Passy and Grekpoubou, married to the same man, Lidou, have to confront his family when he dies unexpectedly, in order to secure the future of their children.  The title is the spoiler as it tells you the fulcrum of the plot. They are co-wives and then co-widows. The story is about how they survive the crisis, and as the reader you will be rooting for them - and really want them to pull through.",
        "year": 2022
    },
    {
        "id": 13008,
        "title": "A House for Alice",
        "author": " Diana Evans",
        "description": "An ageing and now widowed grandmother, not just dreaming of returning home to Nigeria but making her family plan it, is a sure recipe for misunderstandings, tensions, rivalries and suspicions among her daughters and their children. What lifts the tale into real-life resonance is the bold background of the Grenfell Tower tragedy in contemporary London. This family will live in your mind as they struggle with their life issues and loyalty to Alice.",
        "year": 2023
    },
    {
        "id": 13192,
        "title": "My Hummingbird Father",
        "author": "Pascale Petit",
        "description": "What I heard in this very moving book is that abused children will never forget those experiences, however hard they try. Told in a symbolic and magical way, we journey with Dominque from the Angel Falls’ Lost World through her early years in the centre of Paris and the demise of her parents. Despite the underlying pain and violence, more suggested than factual, this book is a very special and enriching reading experience.",
        "year": 2025
    },
    {
        "id": 13077,
        "title": "The Bleeding",
        "author": " Johana Gustawsson",
        "description": "Atmospheric from the outset, this mystery will grip you immediately. What begins in the tone of a police procedural becomes more gothic at the turn of every page. Tangled stories of three women living and suffering in eras spanning over a century gradually weave together and something much darker and supernatural in nature is revealed. Prepare for a tense and shocking read.",
        "year": 2024
    },
    {
        "id": 12815,
        "title": "The Night Watchman",
        "author": " Louise Erdrich",
        "description": "Based on Louise’s grandfather’s life, this is a novel that stayed with me long after reading. Pixy, a Native American girl lives on the Chippewa reservation. She is the one supporting her family because her father is a drunk. Thomas is a watchman in a factory on the Rez and worried about the Termination Bill hanging above the tribe’s heads. The language is poetic, the story moving, funny - and breaking stereotypes.",
        "year": 2021
    },
    {
        "id": 12553,
        "title": "I Wish You All the Best",
        "author": "Mason Deaver",
        "description": "This book starts with a bang when Ben comes out to their parents and it all goes much, much worse than they imagined. The anxiety and pain of working out who you are and how you fit in - if you’ve forgotten how intense getting through adolescence is, this book will bring it all back. The gentle romance and the warmth of more enby-accepting adults offset the tough start.",
        "year": 2019
    },
    {
        "id": 13079,
        "title": "City of O",
        "author": " CM Taylor",
        "description": "This surreal satire will have you laughing at the relationships of a band of harlequins and cringing at the decadence of the City of O, where citizens routinely buy extreme body modifications or even order mountain ranges to be placed in view of their penthouse suites! Anyone seeking a witty, fantastical read with razor-sharp social commentary should grab a copy today.",
        "year": 2024
    },
    {
        "id": 12887,
        "title": "The School for Good Mothers",
        "author": " Jessamine Chan",
        "description": "This is a raw and provocative read set in a near future where the state punishes mothers deemed to be unsuitable. To win their children back, mothers must be retrained in a harsh and dehumanising institution. Both emotional and disturbing, the thrilling and involving plot is set against the prejudices of society and the pressures of parenting. Parents, you may lose sleep over this book.",
        "year": 2022
    },
    {
        "id": 13076,
        "title": "The Starling House",
        "author": " Alix E. Harrow",
        "description": "Wonderfully entertaining gothic horror. I enjoyed all the usual elements: Opal’s tragic family history, the creepy house with the beasts in the cellar and the attraction between two loners. Don’t expect fast paced action - the plot builds slowly which is perfect for the story.",
        "year": 2024
    },
    {
        "id": 12580,
        "title": "River of Teeth",
        "author": "Sarah Gailey",
        "description": "Bar stand-offs, cons, explosions, chases, flirtations – all the tricks of a western are here but like you’ve never seen them before. It takes a moment at the start to sort out the outrageous characters and the costumes but then you’re off, and the ride gets faster and faster as the tension builds. And what are they riding – hippos! It’s hilarious and magical at the same time.",
        "year": 2017
    },
    {
        "id": 13150,
        "title": "The Edge of Solitude",
        "author": " Katie Hale",
        "description": "An unsettling near-future exploration of the climate crisis and a clash of ambition and principle. The grief and guilt of unsympathetic, ice-cold characters is palpable and their choices stand as a harsh ecological and societal warning. This is a light-touch eco-tale written in beautifully descriptive prose, yet still unflinching and thought-provoking.",
        "year": 2024
    },
    {
        "id": 12833,
        "title": "Variations",
        "author": "Juliet Jacques",
        "description": "An affecting collection of stories, in a variety of literary styles; acerbic yet lyrical snippets depicting the reality of transgender life. Drily humorous, inventive writing invigorates the complexities of identity and social experience in a voice that inspires empathy. This is an insight into a struggle for a different world away from the marginalisation of the non-binary community. Bold and moving stories that make you think.",
        "year": 2021
    },
    {
        "id": 12800,
        "title": "Midnight at Malabar House",
        "author": " Vaseem Khan",
        "description": "Persis Wadia, India's first woman police officer in 1950 (a little advance of reality) is a strong, warm and funny character, determined to prove her professionalism. I really enjoyed this classic murder mystery. As well as a great plot, it has real depth in the setting - the politics of independence, the last of the Brits still in India and the trauma of Partition.",
        "year": 2021
    },
    {
        "id": 13056,
        "title": "The Blue, Beautiful World",
        "author": " Karen Lord",
        "description": "A visionary novel with complex characters and a thought-provoking plot. With aliens already embedded in society, we witness a wildly original insight into the tipping point between the salvation of humanity and its destruction. This is galactic politics with the human touch, written with peaks and troughs in the narrative tension - simple prose with wry humour.",
        "year": 2023
    },
    {
        "id": 12754,
        "title": "Permafrost",
        "author": "Eva Baltasar",
        "description": "A brisk novel that perfectly captures the essence and mood of a woman adrift, as she seeks solace in sexual encounters and thoughts of suicide.  Moving between Barcelona, Belgium and Scotland, there is no real sense of place or plot, but a narrative - of family, love and societal expectations - that is intense, dark and acerbic.  This is a short book with short chapters, yet at no point is the reader made to feel short-changed.",
        "year": 2021
    },
    {
        "id": 13128,
        "title": "Brotherless Night",
        "author": " V. V. Ganeshananthan",
        "description": "The ethnic clashes of 1980s Sri Lanka are violent and totally divisive. Medical student Sashi's family loyalties are challenged in a heartbreaking way as she loses two brothers and a dear friend. I felt shock but also a deep empathy with these characters whose suffering is unimaginable. This is terrific writing and powerful storytelling.",
        "year": 2024
    },
    {
        "id": 12611,
        "title": "What's Left of Me is Yours",
        "author": "Stephanie Scott",
        "description": "This book is an heartwrenching account of a passionate love between a man, Kaitarō and a woman, Rina, which ends in a tragic murder. I slowly got seduced by the narrative, told by the daughter, Sumiko. Beautiful impressions of Japanese landscape and culture are a delight that add something special to this debut inspired by a true crime story.",
        "year": 2020
    },
    {
        "id": 12737,
        "title": "Animal",
        "author": " Lisa Taddeo",
        "description": "Visceral, the scent of blood a constant in the air, this is a high-impact experience. Told through compelling anti-heroine narrator, Joan, the sexual trauma of her past accumulates as her rage takes action in the present. The propulsion and lurid pleasure of a revenge thriller are here in excess. Even more resonant is the heart-breaking emotional depth, including unflinching scenes of child abuse, rape and miscarriage. It left me reeling.",
        "year": 2021
    },
    {
        "id": 12545,
        "title": "Don't Call Us Dead",
        "author": "Danez Smith",
        "description": "A powerful collection shaping raw emotions into fierce and jagged poetry which deals with being both gay and black in the USA. Though there is much about HIV/AIDS, prejudice and police brutality here there is also a lot of love and tenderness.",
        "year": 2018
    },
    {
        "id": 12944,
        "title": "A Certain Hunger",
        "author": " Chelsea G. Summers",
        "description": "Smart, macabre, witty and decadent this book is a darkly sensual read. Dorothy is a successful food critic with an appetite for sex and violence. This is her memoir written from prison which recounts the murders of her lovers with unsettling precision. Be warned you may find yourself compelled to sympathise with a psychopath or even taking a distasteful enjoyment in her crimes.",
        "year": 2022
    },
    {
        "id": 13029,
        "title": "Mister, Mister",
        "author": " Guy Gunaratne",
        "description": "This is an engrossing and thought-provoking novel about identity and belonging. You are drawn into a world where cultures collide, secrets unravel while an undercurrent of dread creeps along, but also where the power of friendship shines through. This book is a must-read for anyone seeking a deeply satisfying and enlightening story.",
        "year": 2023
    },
    {
        "id": 13210,
        "title": "The Premonition",
        "author": "Banana Yoshimoto",
        "description": "This novel is short and sweet. I loved the language, the description of nature and the sympathetic characters. It’s about young Yayoi who has prophetic dreams and the feeling something is missing in her life. After the disappearance of her beloved, slightly eccentric aunt Yukino she discovers family secrets, a long lost sister and her true love.",
        "year": 2025
    },
    {
        "id": 13041,
        "title": "Your Love Is Not Good",
        "author": " Johanna Hedva",
        "description": "A challenging read, in which the nameless main character reflects on youth, heritage, race, art and sexuality. Sometimes dreamlike, even hallucinating, sometimes harsh or brutal. Every detail seems to count, while the artist painter questions motivations and goals in life, and tries to come to terms with it. A haunting tale that keeps on lingering.",
        "year": 2023
    },
    {
        "id": 12683,
        "title": "A Net for Small Fishes",
        "author": " Lucy Jago",
        "description": "Set during a time when women had little or no agency, this story of an infamous scandal comes from the perspective of a woman who was involved.  Jacobean London is vividly evoked in all its glitter and grime and Anne Turner, a compelling narrator, is portrayed without judgement.  There's nothing like immersing yourself into another person's life, I was riveted from page one right to the bitter end.",
        "year": 2021
    },
    {
        "id": 12578,
        "title": "Seven Devils",
        "author": "Elizabeth May and Laura Lam",
        "description": "This first part of a feminist space opera duology creates, almost literally, an enhancement of our own world. With life on numerous planets within the galaxy - violence, politics, extremism, food shortages, pandemics -  everything seems even bigger than what we have known so far.  The short chapters, jumping from present to past, made me want to read on and on, giving slowly more insight into the characters. Sci-fi  that creeps under your skin …",
        "year": 2020
    },
    {
        "id": 12720,
        "title": "The Beasts They Turned Away",
        "author": " Ryan Dennis",
        "description": "Chillingly distant yet gruesomely suffocating, this novel uses a series of loosely connected episodes to describe a harsh rural community in Ireland. I found myself developing an uneasy sympathy for ‘the old man’ and the mute child who the rest of the village hold in violent suspicion. The stifling and troubling atmosphere of the writing drew me in and stayed with me.",
        "year": 2021
    },
    {
        "id": 13119,
        "title": "Bad Habit",
        "author": " Alana S. Portero",
        "description": "Set in a working-class district of Madrid, this is a bruised and raw tale of Alex, a young trans woman navigating her identity, and the community who both damage and save her. Although harrowingly violent in places, there are many moments of breath-taking tenderness. Wryly funny, with astonishing depths of humanity and a neighbourhood of vividly drawn characters, this read is both a hugely entertaining and deeply authentic emotional experience.",
        "year": 2024
    },
    {
        "id": 12787,
        "title": "Washington Black",
        "author": " Esi Edugyan",
        "description": "Starting in the terrible plantation society of Barbados, this epic ride takes in the Arctic, London, Amsterdam and Morocco. It's an amazing journey at a great pace in great company and I loved every minute. A tour de force.",
        "year": 2021
    },
    {
        "id": 12748,
        "title": "When We Cease to Understand the World",
        "author": "Benjamín Labatut",
        "description": "Defying categorisation - is it a scientific novel, or a fictionalisation of wonder and terror at the nature of the universe? You’ll get a better grasp of quantum mechanics, and maybe an even greater understanding of the mind-bending power of nature’s secrets to provoke both genius and madness. Have someone close by to force you to put this book down - it will take over your life.",
        "year": 2021
    },
    {
        "id": 13009,
        "title": "The Five Sorrowful Mysteries of Andy Africa",
        "author": " Stephen Buoro",
        "description": "Andy Africa, a 15 year old altar boy, is going through puberty and is obsessed with blonde hair and white skin. Added to this – his mother will not tell him who his father is. Then the blonde Eileen, the priest’s niece, walks into his life. With a background of corruption, intercommunal strife, bloody violence and the need to flee the country to safety in Europe, this is a smart, sometimes funny, often uncomfortable tale for our times",
        "year": 2023
    },
    {
        "id": 12868,
        "title": "Address Book",
        "author": "Neil Bartlett",
        "description": "This book is one of the most tender and warm I have read in ages. Seven different people in different periods from 1891 to 2021 - it’s life-affirming, accepting and erotic even when dealing with grief. Quietly brilliant – and you’ll never take a mattress for granted again.",
        "year": 2022
    },
    {
        "id": 12584,
        "title": "Boy Parts",
        "author": "Eliza Clark",
        "description": "Being a professional society photographer should be a 'nice' occupation. But that’s not how Irina sees it. She has to make artful creations which become ever more violent. Vivid descriptions of the drug scene and night life of Newcastle make this a tough read, but hang on in there for the enduring friendship between Irina and her friend Flo. However it is compulsively readable even as you may hate what you read.",
        "year": 2020
    },
    {
        "id": 13146,
        "title": "Eyes Guts Throat Bones",
        "author": " Moïra Fowley",
        "description": "This collection of stories is a ghastly, beautiful tour through a series of apocalypses.  However the world ends; with flowers falling from the sky, with families turning to gingerbread or with bands of survivors patrolling safe zones, these are stories of queer female relationships, sex, bodies, intimacy and motherhood. This collection will elicit tears, laughter, shock, hope and despair. Monstrous, beautiful and consuming.",
        "year": 2024
    },
    {
        "id": 12590,
        "title": "The Beatrix Gates",
        "author": "Rachel Pollack",
        "description": "A book which uses an analogous non-human scenario to explore attitudes and differences. Kara believes she has been born into the wrong body. She is a Red but believes and feels she is a Green. Kara is very unhappy and hates the life she is forced to live as a Red. To resolve the issue, she must make the perilous journey to the Beatrix Gates and pass through. Beautifully and sympathetically written. Not an easy read but very enlightening.",
        "year": 2018
    },
    {
        "id": 13000,
        "title": "Paris Requiem",
        "author": " Chris Lloyd",
        "description": "Eddie Giral, a gritty DI working in occupied Paris during the war, investigates the grisly murder of a criminal in a seedy jazz club. I was immediately transported to the underbelly of the city - Eddie’s sarcasm gave the story a much needed lighter tone. And his hunger for food I found almost tangible.",
        "year": 2023
    },
    {
        "id": 11404,
        "title": "Family Life",
        "author": "Akhil Sharma",
        "description": "Direct and intimate, this writer keeps saying the unsayable in such a plain style with such humour and tenderness, you switch from shock to recognition, from laughter to sadness in an instant. It starts as a classic – and hilarious - story of immigration from India to America then takes a turn into dealing with terrible chance and grief. Painful, funny, and very perceptive, this is quietly brilliant.  ",
        "year": 2014
    },
    {
        "id": 12699,
        "title": "Two Tribes",
        "author": "Chris Beckett",
        "description": "Two Tribes is almost certainly a book to get you thinking and questioning your own ideas. Using the 2016 Brexit referendum as the pivot, the story challenges the opinions of the characters and points at a divided society in the future. Whilst the referendum is the key event, this thought-provoking book has more to say about the tribal nature of beliefs and how these become entrenched.",
        "year": 2021
    },
    {
        "id": 12676,
        "title": "The Family Tree",
        "author": " Sairish Hussain",
        "description": "In just a moment life can change.  In this inter-generational muslim family, fraught relationships and costly life choices eventually take their toll.  Heartfelt and intense from the start, this story, un-flinching in the telling, balances the ordinariness of everyday life with the extraordinary and consequential effects of sudden loss. Snippets of humour blend with the  backdrop of struggle in the hope of bringing love and truthful connection.",
        "year": 2021
    },
    {
        "id": 12819,
        "title": "The Book of Form and Emptiness",
        "author": " Ruth Ozeki",
        "description": "An immense and generous reading experience, centred on Benny and his mum Annabelle as they navigate life following the death of dad Kenji. Whilst the title and the length of the book may seem intimidating, don't be put off. Multi-layered, and bringing together the art of decluttering, climate change activism, Zen philosophy and talking objects (most significantly books), this is a deeply emotional, magical, funny and always accessible read.",
        "year": 2021
    },
    {
        "id": 12810,
        "title": "Henna House",
        "author": " Nomi Eve",
        "description": "Spanning decades, this sensual adventure is told through the ornate patterns and hidden language of henna body art. We follow Adela through her childhood, as she explores her identity as a Yemeni Jew growing up in the midst of Muslim culture, through the horror of the Holocaust, to settlement in Israel. There is much to savour in the intricate detail of family and ritual, the blend of history and fiction, the tangible sun and delectable spice.",
        "year": 2021
    },
    {
        "id": 12587,
        "title": "The Mother Code",
        "author": "Carole Stivers",
        "description": "This two-sided story, with on the one hand biotechnical details of an apocalyptic pandemic, and on the other the psychological aspects of bonding between robotic mothers and human children, evokes horror and compassion. It makes you wonder about and doubtful of what our future will look like, but displays also faith in human interaction.",
        "year": 2020
    },
    {
        "id": 12731,
        "title": "No One Is Talking About This",
        "author": " Patricia Lockwood",
        "description": "A life lived online, swept up in the flippancy of social media, collides with a devastating family event and an ensuing human connection. Told in snippets and a stream of consciousness that echoes the online scrolling experience, this is at once a profound, irreverent and poignant read.",
        "year": 2021
    },
    {
        "id": 12567,
        "title": "Get in Trouble",
        "author": "Kelly Link",
        "description": "Imagine if you can a Catherine Wheel loaded up with stories instead of fireworks. As the wheel spins the stories fly off in different directions, each lighting up the sky in its own unique way. This is Kelly Link's Get in Trouble: nine very different stories where the boundaries between the real and fantasy are frequently crossed, leaving you questioning what actually happened. Mind-blowing stuff.",
        "year": 2016
    },
    {
        "id": 13167,
        "title": "Replay",
        "author": " Ken Grimwood",
        "description": "This mesmerising novel explores life, love, regret, and second chances and follows one man who keeps replaying his life from age 18. At times uplifting then harrowing, funny then heartfelt, this rollercoaster of a novel is a must-read for fans of speculative fiction and anyone who wants a thought-provoking and philosophical take on consequences and morality.",
        "year": 2024
    },
    {
        "id": 13070,
        "title": "My Friends",
        "author": " Hisham Matar",
        "description": "Three men - Khalid, Mustafa and Hosam attend a demonstration outside the Libyan Embassy in London. Men inside the embassy open fire, killing WPC Yvonne Fletcher. Khalid and Mustafa are both injured; Hosam escapes. This is their story following this violent event – one of trauma and grief – but also friendship. Any book by Hisham Matar simply has to be read. His prose is extraordinary - and he enthralls you in his narrative.",
        "year": 2024
    },
    {
        "id": 12796,
        "title": "A Passage North",
        "author": "Anuk Arudpragasam",
        "description": "Full of rhetorical flourishes and meticulous detail, this philosophical meditation on violence and memory encapsulates the traumatic aftermath of civil war. Focusing on sophomoric musings, we experience a war-scarred disquisition of love and life. Poetic and eloquent with rich, rewarding sentences; slow-moving yet exhilarating.",
        "year": 2021
    },
    {
        "id": 12577,
        "title": "The Space Between Worlds",
        "author": "Micaiah Johnson",
        "description": "Quantum theory posts the existence of a multiverse, and this pacy SF adventure story is set in one. There are 100s of alternatives worlds and 100s of versions of yourself – but  you can only travel to a world where your doppleganger is dead. Cara is dead in most of them which makes her both valuable and dangerous because she can identify versions of others from her world intent on evil in their new one. A mind-blowing and twisty read.",
        "year": 2020
    },
    {
        "id": 12691,
        "title": "Crocodile Tears",
        "author": "Mercedes Rosende",
        "description": "Diego is in prison accused of kidnapping and meeting his corrupt lawyer.  What follows is a case of mistaken identity, a prison escape by a homicidal maniac, and an armed car robbery which goes badly wrong.  Police Captain Leonilda Lima has the job of sorting the whole thing out . Expect an exciting rollercoaster of a read.",
        "year": 2021
    },
    {
        "id": 13096,
        "title": "Julia",
        "author": " Sandra Newman",
        "description": "In this gripping reimagining of Orwell’s 1984 Julia, not Winston, is our protagonist. Through precisely told scenes, many of which will be known to readers of Orwell, we are given a female viewpoint on Big Brother’s cruel, claustrophobic world. This novel is packed with risk and thrill, chilling violence and visceral encounters. It will shock readers and stay with them: raising a magnifying lens to our own society and our agency or lack of it.",
        "year": 2024
    },
    {
        "id": 12664,
        "title": "This Is Happiness",
        "author": " Niall Williams",
        "description": "Noel drops out of the seminary and returns to sleepy Faha. The coming of 'the electricity' brings lodger Christy. Whilst Noel looks for his first love Christy seeks out an old love to make amends. An enchanting picture of village life where nothing happens quickly and every person, however odd, is accepted. Warm and wonderful.",
        "year": 2021
    },
    {
        "id": 12573,
        "title": "The Long Way to a Small Angry Planet",
        "author": "Becky Chambers",
        "description": "A mixed group of humans and aliens crew a ramshackle spaceship on a dangerous job. Sounds predictable? Not at all. It's a story of how very different individuals bind together to overcome conflict, loss and violence. It's sexy and funny and brisk - and a joy to read. A humane tale to stay with you well after the last page. And if you suspect the small angry planet might be Earth - well, you are in the right frame of mind to give this book a try.",
        "year": 2015
    },
    {
        "id": 13059,
        "title": "You’d Look Better as a Ghost",
        "author": " Joanna Wallace",
        "description": "Delight in the shocking combination of a light-hearted tone and vicious humour in this serial killer romp. Told with deadpan humour, you'll find yourself siding with the damaged main character as she leads an increasingly twisty killing spree, uncovering other people's secrets and narrowly escaping discovery along the way. While told with a light touch this book does include themes of abuse of children and the elderly as well as grief and loss.",
        "year": 2023
    },
    {
        "id": 12811,
        "title": "Bitterhall",
        "author": "Helen McClory",
        "description": "In this intellectually challenging story I was drawn into the lives of three complicated characters in search of love. Confronted with three versions of the same story I was constantly alert: who is telling what, and why? Is one of them possessed by an ancient diary writer? Who is responsible for whom? A crisis in the harsh Scottish countryside seems to give an answer, but is that really so?",
        "year": 2021
    },
    {
        "id": 12842,
        "title": "The Absolute Book",
        "author": " Elizabeth Knox",
        "description": "Truth be told, I didn’t always know what was happening in this hefty book!  But I found myself lured in with what feels like a typical mystery plot, that suddenly slips into fantasy, then swings wildly back and forth from faerie land to ‘real life’ thriller chases.  No wonder then my head whirled, from moments of suspense to explanations of faerie lore and the fate of the Taken.  I wasn’t sure about the ending, but it was a wild ride!",
        "year": 2021
    },
    {
        "id": 12805,
        "title": "Breasts and Eggs",
        "author": " Mieko Kawakami",
        "description": "At last, a book about women and their bodies that's not afraid to tell it how it is. First published as a novella, this extended edition reads as two distinct volumes, differing in length, pace and tone.  There's little in the way of action, but rather an eclectic mix of journal entries, dream sequences, conversations and reflections, offering a fresh perspective on what it means to be a woman.  Fascinating and thought provoking in the extreme.",
        "year": 2021
    },
    {
        "id": 11431,
        "title": "The People in the Photo",
        "author": "Hélène Gestern",
        "description": "If you've ever been moved by old family photographs where you recognise a parent but don't know who anyone else is, you'll love this elegant exploration of a past which is also personal. Two characters with no connection find out about themselves as much as their families as they exchange letters and emails in a flowing story.",
        "year": 2014
    },
    {
        "id": 12942,
        "title": "The Ardent Swarm",
        "author": " Yamen Manai",
        "description": "A beautiful and poetic novel in which the invasion of a hostile swarm of hornets is compared to the political situation in an Arabic country. Sidi, the main protagonist, is a gentle, nature-loving beekeeper who is living in a remote village. On the discovery of the threat to his beloved bees, he takes action, together with his friends. Superbly written it grabbed my attention from the outset and kept it all the way through.",
        "year": 2022
    },
    {
        "id": 12726,
        "title": "Kim Jiyoung, Born 1982",
        "author": " Cho Nam-Joo",
        "description": "Infuriating at times, this life story is written in a sort of mix of non-fiction and fiction. It made me realise how lucky I am to live in a country where in this time and age, circumstances for being a working, independent woman are a lot better than those in Korea, only ten or twenty years ago. An eye-opener, and I really felt for Jiyoung and her peers.",
        "year": 2021
    },
    {
        "id": 12918,
        "title": "The Orphanage",
        "author": " Serhiy Zhadan",
        "description": "The backdrop is a generic warscape in which the sides and locations are never named, but it's so clearly Zhadan's home city of Kharkiv. With the streets, fields and hospital under attack – and filled with immediate dangers, we share in the nightmare experience of negotiating a way through to the orphanage, but also the random encounters with human compassion. A terrifying feeling of what may be now or very soon on Ukraine's front line 2024.",
        "year": 2022
    },
    {
        "id": 13203,
        "title": "Hum",
        "author": "Helen Phillips",
        "description": "Set in an unnamed city at the moment where AI has become the main support structure for society, this near-future vision feels all-too relatable. We see this world through the eyes of May, the mother of a young family unit struggling to make ends meet, and her efforts to create the best life for her children. A study of parental pressure and anxiety in the face of continually intrusive technology, this is a chilling, darkly humorous read.",
        "year": 2025
    },
    {
        "id": 10411,
        "title": "The Father of Locks",
        "author": "Andrew Killeen",
        "description": "Set in the legendary Golden Age of Baghdad, these interconnecting tales are woven into a plot as intricate and labyrinthine as a Persian carpet. An Islamic classical poet/detective and his storyteller/thief accomplice engage in a bawdy romp in the company of a cast of corrupt and decadent characters. But be warned, this is no children's Arabian Nights adventure, but an exuberant and sexually-explicit version of historical detective fiction.",
        "year": 2009
    },
    {
        "id": 12845,
        "title": "A Master of Djinn",
        "author": " P. Djèlí Clark",
        "description": "Meticulous detail brings this alternate Cairo alive, with genres of fantasy, magic and mystery combining with postcolonial history in a compelling narrative. With a quirky yet critical eye towards gender, class and race, the sharply-drawn characters reconfigure history in a fantastical feat of imagination. Sarcasm and wit shroud the prejudicial themes in a novel that is a lot of fun.",
        "year": 2021
    },
    {
        "id": 13038,
        "title": "Bellies",
        "author": " Nicola Dinan",
        "description": "This isn’t a long novel but I came away feeling that I had been on a journey with the characters. Sometimes I loved them, sometimes I thought they were awful, but I was completely absorbed in their story. Transitioning is only a part - because the book is also about friendship, family and love, delivered through a story that exudes snark, exuberant youthfulness, and dances around everyone’s longing to be seen for who they really are.",
        "year": 2023
    },
    {
        "id": 12917,
        "title": "What You Can See From Here",
        "author": " Mariana Leky",
        "description": "This charming and heart-warming story celebrates everyday life in a small village for a group of family and friends whose traditions and habits are both unique and universal. Viewed through the eyes of Luisa, a young girl growing up, it shows how a caring community can help deal with loss and support a better understanding of one’s self. The characters were my friends who I came to love and when the book ended I felt bereft.",
        "year": 2022
    },
    {
        "id": 12600,
        "title": "To Calais, In Ordinary Time",
        "author": "James Meek",
        "description": "This book is a time machine. It's like stepping into the pages if an illustrated medieval Book of Hours. A peasant, a serf, a highborn lady and a knight embark on a journey with a group of archers, a captive and a notary. Each carries their own guilt, passion and ambition. Each sheds their role in a feudal society along the way. But the Black Death is coming to meet them. A compelling tale - and I found the language quickly became familiar.",
        "year": 2020
    },
    {
        "id": 12555,
        "title": "Love in Colour",
        "author": "Bolu Babalola",
        "description": "What a treat this book is - firecrackers of girl power across the ages! Inventive reworkings of myths from around the world, suffused with the power of female wisdom, along with a handful of the author’s own. Together with her notes on the origins and her inspirations, the hallmark is Babalola’s personal inheritance of indominatable love. Great bedtime stuff but your light won’t go out till you’ve finished that last tale!",
        "year": 2020
    },
    {
        "id": 13094,
        "title": "Piglet",
        "author": " Lottie Hazell",
        "description": "Piglet, a name that has stuck since childhood, has panic attacks in the days prior to marrying Kai. She tries to be the perfect bride, especially for Kai’s demanding mother. Then Kai drops a bombshell. What follows is a scene like one from a Fellini film: sharply humorous but poignant too. And, like the food descriptions  - addictive.",
        "year": 2024
    },
    {
        "id": 12765,
        "title": "The Rabbit Factor",
        "author": " Antti Tuomainen",
        "description": "This book sets off at pace and doesn't let up throughout as our reluctant hero desperately tries to stay one step ahead of some very nasty people. A clever and surprising tale told with warmth and humour even while an ever-present threat of violence clings to the main characters - and you won't be able to put it down!",
        "year": 2021
    },
    {
        "id": 12613,
        "title": "Unmasked",
        "author": "Jenifer Kanin",
        "description": "Gary is a raccoon.  Jenny a rabbit and the brains of the outfit.  They work out ways of using disguises to sneak onto human property and raid the larders for treats. Meanwhile Max, a fox and Jonathan, his chipmunk sidekick, are investigating the disappearance of an opossum family. This is a wonderful romp - think Hound of the Baskervilles, but with a touch of animal lunacy. Sit back and enjoy.",
        "year": 2020
    },
    {
        "id": 12821,
        "title": "Captain Jesus",
        "author": " Colette Snowden",
        "description": "Marie the teenager and Marie the wife and mother links the two strands of this story of how ordinary people cope with great loss. The more recent strand is narrated by one of the children as he tries to understand what is going on in the adult world. This book gains in intensity as the two stories are pulled closer together. A powerful mix of the everyday and the tragic, you will be drawn into this family making small steps towards recovery.",
        "year": 2021
    },
    {
        "id": 12919,
        "title": "Teen Couple Have Fun Outdoors",
        "author": " Aravind Jayan",
        "description": "A secretly filmed video of Sreenath and his girlfriend Anita has been posted to a porn site. They don't see what the fuss is about but their parents think they have brought shame on both families. Caught in the middle is our narrator, Sreenath's younger brother, who sides with Sreenath but would also like everything to go back to normal. Heartwarming and uplifting, this is truly a tale of our time and you will sympathise with both old and young.",
        "year": 2022
    },
    {
        "id": 12563,
        "title": "Crumbs",
        "author": "Miha Mazzini",
        "description": "Set in Slovenia region before the break up of Yugoslavia. Egon and his friends, fellow writers, factory workers, prostitutes, and hermits, eke out a precarious and, for them, normal daily existence in a dreary factory town. Funny, violent, cruel and depressing but still the friends support each other and pursue their obsessions (like Cartier aftershave). Egon is an interesting, serious, slightly mad character. Loved the staccato writing style.<br />",
        "year": 2019
    },
    {
        "id": 12753,
        "title": "Nordic Fauna",
        "author": " Andrea Lundgren",
        "description": "Expect the unexpected in a collection of six stories which explore the intrinsic connection between man and nature.  The overriding tone is dark and unsettling, carrying a feeling of mild dread, though ends on a note of optimism.  These are characters who have reached a pivotal point along life's path; anything might happen and nothing is quite as it seems, giving the reader much to reflect on, both on and off the page.",
        "year": 2021
    },
    {
        "id": 12711,
        "title": "The Liar's Dictionary",
        "author": " Eley Williams",
        "description": "If you're a gobbler of words - a synonym lexiphile (I made that up), you'll relish this book. A lot of Eley's delight in words comes through in her bubbling inventiveness, and I just loved the twists and turns of the back story as well.",
        "year": 2021
    },
    {
        "id": 13173,
        "title": "Split Tooth",
        "author": " Tanya Tagaq",
        "description": "This is a brutal and beautiful read so give it time as it’s quite short and quickly over. It’s a mix of teenage boredom and frustration in a small town that everyone will recognise and quite extraordinary lyricism about nature and how humans can connect to the landscape. You will never look at images of the Northern Lights in the same way again.",
        "year": 2024
    },
    {
        "id": 12835,
        "title": "Assembly",
        "author": " Natasha Brown",
        "description": "Prepare yourself for a powerful and philosophical read with a fusion of narrative styles.  Addressing identity, gender, race and class, it explores too how the ghost of Empire still haunts Britain and the impact this has on the life of a high-achieving black woman.  Despite its brevity, this is a book which speaks volumes, easily read in one sitting and perhaps the better for it.",
        "year": 2021
    },
    {
        "id": 12975,
        "title": "Cleopatra and Frankenstein",
        "author": " Coco Mellors",
        "description": "At times laugh out loud funny, often poignant and always engrossing, the reader inhabits the intense turmoil of Cleo and Frank’s relationship and the lives of those closest to them: lives lived flippantly and always on the verge of disaster. This novel has a hard honesty to it and contains scenes of sexual violence and self harm.",
        "year": 2023
    },
    {
        "id": 12631,
        "title": "The Animals in That Country",
        "author": "Laura Jean McKay",
        "description": "This book is a wild and strange ride through a hot and broken land. Hard-drinking wildlife park guide Jean prefers the company of animals and, when a pandemic sweeps the country and people can understand the language of animals, Jean and her wayward son Lee are  infected. When Lee kidnaps granddaughter Kimberly, Jean pursues him guided  by favourite  dingo, Sue.  If we could talk to the animals, we may not like what we hear!",
        "year": 2020
    },
    {
        "id": 12913,
        "title": "We Move",
        "author": " Gurnaik Johal",
        "description": "We Move is a collection of seventeen short stories, many with overlapping threads that portray the experiences of immigrants, particularly Indian, living in West London. Even though there are links between many of the stories they all stand up on their own, each taking the reader into another character's life. There's a simplicity to the storytelling - not flashy at all - that draws you in, makes you care.",
        "year": 2022
    },
    {
        "id": 12685,
        "title": "Mother for Dinner",
        "author": " Shalom Auslander",
        "description": "To find comedy in cannibalism is something I never would have thought possible until I read this book. Seventh, the seventh child born to his dominant mother, tells the story of his Cam-Am (Cannibal-American) heritage. When their mother dies, the modern-day siblings must honour the customs of their ancestors by eating their own mother for dinner. This stomach-turning black comedy is uniquely compelling.",
        "year": 2021
    },
    {
        "id": 12714,
        "title": "Afterlives",
        "author": " Abdulrazak Gurnah",
        "description": "In a largely forgotten theatre of war, this powerful and epic account of brutal oppression during the German Colonial campaigns in East Africa weaves history and fictional characters in an intricate tapestry. The deeply personal stories of the resilience of the uprooted and exploited African people balance the more journalistic style used to describe the disturbing scenes of atrocities and reprisals. Beautiful, sad and unforgettable.",
        "year": 2021
    },
    {
        "id": 13065,
        "title": "The Men",
        "author": " Sandra Newman",
        "description": "There's a meaty speculative sci-fi hook at the heart of this read: suddenly, everyone with a Y chromosome disappears. What follows is a rush of ideas - political, social, scientific - as society is reformed by women, in the absence of men. Fragments of weirdly otherworldly material are intercut throughout, while at its core are grounded and grim stories of sexual and racial abuse and ongoing trauma. The effect is disorientating and compelling.",
        "year": 2024
    },
    {
        "id": 13188,
        "title": "Evenings and Weekends",
        "author": " Oisín McKenna",
        "description": "This book had a real impact on me. It invited into the worlds, and indeed the heads, of people I may never meet and allowed me to squat in their lives for the duration of the book. For other readers, I'm sure there will be recognition and even identication with the daily reality of this group of London millennials. This is real state of the nation stuff and a searing yet humane account of city-life in all is beauty and ugliness, hope and despair.",
        "year": 2024
    },
    {
        "id": 12945,
        "title": "Briefly, A Delicious Life",
        "author": " Nell Stevens",
        "description": "This story is based on a winter George Sands and Frederick Chopin spent in Majorca. Funny, desperate and sensory, it is narrated by a ghostly voyeur seeking revenge for the suffering she endured in her own life. She indulges in both experience and emotion by occupying the bodies and memories of the living. This offers an unexpected tale in the ghost story genre and a different view of Majorca.  It will make you laugh, seethe and wonder.",
        "year": 2022
    },
    {
        "id": 13111,
        "title": "England is Mine",
        "author": " Nicolas Padamsee",
        "description": "David and Hassan are second generation immigrants living in London. They both struggle for a sense of identity and belonging. Islamaphobia, life lived largely online, the rise of the far right, and trying to please your parents are all themes in this timely novel. A bleak read - but still a compelling page turner.",
        "year": 2024
    },
    {
        "id": 12526,
        "title": "The Illness Lesson",
        "author": "Clare Beams",
        "description": "An atmospheric novel involving an experimental girls' school. A stress related skin condition, an unscrupulous doctor, flocks of mysterious red birds and a fraught father/daughter relationship add to the mix.  At times, this is difficult to read with a disturbing subplot of possible abuse.  But recommended for an unusual and thought-provoking experience.",
        "year": 2020
    },
    {
        "id": 12966,
        "title": "Is This Love?",
        "author": " C. E. Riley",
        "description": "Manifestly not love, and yet… the soul in love turns a blind eye to the abuse, and the abuser lives in denial of their failure. You are soon deep in sympathy with J’s plight, but then you only hear their side, and J's wife's legal statements are pathologically narcissistic, unless… Even as J ends on the moral high ground, you will be left with a delicious morsel of nagging doubt.",
        "year": 2022
    },
    {
        "id": 12692,
        "title": "Leave the World Behind",
        "author": " Rumaan Alam",
        "description": "A compelling read, fuelled by uncertainty and a multiplying sense of dread, this is end of the world via Airbnb. A family from Brooklyn hope to spend a week getting away from it all in a remote Long Island holiday home when an unnamed, unknown, cataclysmic event occurs. Smartphones remain dead, and in the resulting void of information, unease shifts to terror. A seductive nightmare of a book, both surreal and disturbingly plausible.",
        "year": 2021
    },
    {
        "id": 12897,
        "title": "Small Pleasures",
        "author": " Clare Chambers",
        "description": "This starts off so you think it’s going to be magical realism with a virgin birth but it’s much more down to earth than that. Brilliant fifties’ setting, strongly realised characters and a detective-style plot that slowly reveals. It’s witty and subtle as the pain of duty and repressed emotion do battle with unexpected love. A real pleasure to read.",
        "year": 2022
    },
    {
        "id": 12538,
        "title": "The Vanishing Half",
        "author": "Brit Bennett",
        "description": "Jude's skin is 'blue black' yet her mother is so pale. When she meets a messed up white girl at a party she begins to unravel a connection and discovers her aunt living as a white woman. Jude and Reese have hidden secrets of their own. I loved this book and all the complex characters who are irresistible. I felt totally engaged with them from start to finish. The tension increases as the pages turn and makes this unputdownable!",
        "year": 2020
    },
    {
        "id": 12957,
        "title": "The Green Man of Eshwood Hall",
        "author": " Jacob Kerr",
        "description": "This evocative book is full of myth & folklore and is truly scary. Izzy, a lonely, neglected child on the cusp of adolescence, has moved with her parents to the remote Eshwood Hall, to work for Miss Claiborne, the elderly owner.  There is tragedy in Miss Claiborne’s past – dead siblings revealed in seven little graves, discovered by Izzy close to a hidden chapel. And cranking up the unease is the presence of a Green Man living in the woods ...",
        "year": 2022
    },
    {
        "id": 12974,
        "title": "Age of Vice",
        "author": " Deepti Kapoor",
        "description": "This tale of love, friendship, violence, corruption and hardship shook me. The lives of Ajay, a poor boy sold into service by his father, Sunny, born into a criminal family and Neda, a journalist who falls in love with the wrong man, paint a colourful picture of the complex, hard society that is India.",
        "year": 2023
    },
    {
        "id": 12777,
        "title": "Our Lady of the Nile",
        "author": "Scholastique Mukasonga",
        "description": "Set in a young ladies' finishing school in the remote hills of Rwanda, increasing racial tensions reflect national attitudes.\nDespite the seriousness of the subject matter, there are many moments of humour. Girls will be girls, and I was charmed by them and by this remarkable novel.",
        "year": 2021
    },
    {
        "id": 13007,
        "title": "Light Perpetual",
        "author": " Francis Spufford",
        "description": "Creating the lives that might have happened for five London schoolchildren killed by a V-2 in November 1944, turns into a detailed and convincing resurrection of working-class life over six decades. It’s not a long book but the span of time and emotion makes it feel huge. The story opens out into an expanse of warm and thoughtful empathy which I found powerfully emotional.",
        "year": 2023
    },
    {
        "id": 13158,
        "title": "The Mere Wife",
        "author": " Maria Dahvana Headley",
        "description": "Set in contemporary suburban America, this retelling of Beowulf holds a cracked and questioning mirror up to the original, shifting its focus to a study of motherhood, otherness, PTSD and what makes us monsters. A knowledge of the Old English original isn't necessary to be immersed in this propulsively engaging read, but may add additional layers of meaning. Rampaging with bloodlust fury and maternal protection, this read is as tender as a blade.",
        "year": 2024
    },
    {
        "id": 12976,
        "title": "For Thy Great Pain Have Mercy On My Little Pain",
        "author": " Victoria MacKenzie",
        "description": "Emerged in the lives of two late 14th century women my mind was torn in two: on the one hand, I admire their courage and determination to live a life dedicated to their Lord and Saviour in a world so different from ours. On the other hand I feel that, maybe, they suffered from conditions that would be treatable today. It made me reflect on the need for spirituality and the benefits of a life full of caring and love. A very special book.",
        "year": 2023
    },
    {
        "id": 12718,
        "title": "Vanishing Monuments",
        "author": " John Elizabeth Stintzi",
        "description": "Alana returns to her home town to see her dying mother for the first time in almost 30 years. As she revisits her childhood home, memories flood back and she takes us through a journey of events leading up to her night-time flight with her girlfriend all those years ago. Poetic and eloquent, and a touching reminder of the complexities of family relationships and what it means to belong, I needed to keep turning the pages to discover more.",
        "year": 2021
    },
    {
        "id": 13085,
        "title": "Aednan",
        "author": " Linnea Axelsson",
        "description": "Fluidly ranging across the times and spaces of northern Scandinavia, this majestic, elegiac prose-poem will leave you haunted by its natural beauty and generational trauma. This is an epic of loss - of indigenous language, land, loved ones - caused by Swedish industrial expansion northward. A polyphonic array of voices from two Sami families, across the span of a century, will lodge their fragments of landscape and poetry deep within you.",
        "year": 2024
    },
    {
        "id": 13187,
        "title": "Orbital",
        "author": " Samantha Harvey",
        "description": "You’d think six people on a space station would be a novel of claustrophobia and tension but this is quite unexpectedly different. The focus goes in and out from the personal to the universal in a way that you don’t notice the difference. I found it miraculous that something so short could deliver such a mind-opening and ultimately calming experience.  A rare treat.",
        "year": 2024
    },
    {
        "id": 12705,
        "title": "August",
        "author": "Callan Wink",
        "description": "This is The Catcher in the Rye set in cowboy country. It's a tale about growing up and the decisions that have to be made whether by deliberate choice or through circumstance.  As his parents’ marriage falls apart,, August has to make those choices. Shuttling between a farm in Michigan and a ranch in Montana,  he meets all kinds of people who affect his life. Expect a beautifully-written coming of age story set against an epic landscape.",
        "year": 2021
    },
    {
        "id": 12700,
        "title": "Wretchedness",
        "author": "Andrzej Tichy",
        "description": "A heart-stopping and head-scratching dizzying array of voices and timelines, submerged in pain, addiction and desperation. In dense, chapter-length paragraphs the language clashes and trembles with unremitting bleakness. An uncomfortable howl of defiance from the neglected, abused and voiceless, but despite the gritty storyline, the language is almost musical and the story mesmerising.",
        "year": 2021
    },
    {
        "id": 12971,
        "title": "The Swimmers",
        "author": " Julie Otsuka",
        "description": "Imagine a situation in which you are observing life from far above, then gradually you zoom in and see more details. That’s what this book felt like to me. And the closer I got, the more I got involved emotionally. And so the language also changes. From a laconic, elaborate style with irony and even sarcasm the writing evolves to a more poignant repetitive wording and a loving, honest image of a woman’s failing mind.",
        "year": 2022
    },
    {
        "id": 13149,
        "title": "Determination",
        "author": " Tawseef Khan",
        "description": "My worry was that the immigrants who are Jamila’s clients would form a catalogue of anguished suffering, typical of the cases treated by the UK Home Office with such heartless indifference. But it’s Jamila’s own story, dominated by her father - both proud of her professional achievement and interfering in the law firm - which gives perspective to the individuals in her professional care. Khan’s real passion for their rights shines brightly.",
        "year": 2024
    },
    {
        "id": 12906,
        "title": "Bad Eminence",
        "author": " James Greer",
        "description": "This is a rabbit-hole of a read, full of playful digressions that question the fabric of reality. The experience is one of artful disorientation, as we are led by the blackly humorous, misanthropic narration of self-aware narcissist Vanessa, a literary translator, through corridors of an abduction mystery intercut with philosophical meditation, product placement and holiday snapshots. A surreal trickster of a book that defies categorisation.",
        "year": 2022
    },
    {
        "id": 12766,
        "title": "Elena Knows",
        "author": "Claudia Piñeiro",
        "description": "Set across a single day in Buenos Aires, this unflinching book uses the beats of crime fiction to explore Catholic dogma, motherhood and disability. The combination is breath-taking, as we follow Elena, her body wracked by severe Parkinson's, her movement reliant on medication, attempting to cross the city to investigate her daughter's death. Never pitying, this is a read full of grim defiance, where glimpses of kindness show only a cruel world.",
        "year": 2021
    },
    {
        "id": 12999,
        "title": "An Unlasting Home",
        "author": " Mai Al-Nakib",
        "description": "As philosophy lecturer Sara faces a possible death sentence in modern Kuwait, she takes strength from the generations of courageous women who came before her. This is such a powerful story with memorable characters which made this book totally gripping. I loved it and lived through Sara's tension right to the end.",
        "year": 2023
    },
    {
        "id": 12675,
        "title": "The Company Daughters",
        "author": " Samantha Rajaram",
        "description": "Set in the early 16th century, Jana, a poor servant, follows her former mistress and love of her life Sontje, on a perilous journey overseas to Batavia. I really enjoyed the vivid, colorful description of their surroundings and the passionate Jana’s strength of mind.",
        "year": 2021
    },
    {
        "id": 13075,
        "title": "Restless Dolly Maunder",
        "author": " Kate Grenville",
        "description": "A small farm in Australia, late 19th century – a bad time and place to be born a clever woman. Dolly, based on Grenville’s grandmother, wants to be a teacher but her father forbids it which frustrates Dolly her whole life. Her bitterness is understandable but sadly it becomes a burden for her children. Nevertheless I admired her resilience. She died disillusioned but her sacrifice made it easier for her daughter to follow her ambition.",
        "year": 2024
    },
    {
        "id": 12780,
        "title": "Silence is a Sense",
        "author": " Layla AlAmmar",
        "description": "This is a devastating yet beautiful story of a Syrian refugee who watches the world from her window. Her elective mutism is a defence against the traumas of the destruction of her life in her home country and her dangerous journey to the UK. In between flashbacks, the fragile stability of her life in the UK is revealed as racist violence invades her supposedly ‘safe’ space. A powerful and moving read – and much food for thought.",
        "year": 2021
    },
    {
        "id": 12528,
        "title": "Come Again",
        "author": "Robert Webb",
        "description": "What if you had known as an 18 year old what you now know as a middle-aged adult? This emotionally charged romantic comedy is a mad-cap romp across time and different fictional genres. It is a great antidote to the stress of these current fraught times, inducing in me an unexpected nostalgia for the Nineties! <br /><br />",
        "year": 2020
    },
    {
        "id": 12832,
        "title": "Confessions of the Fox",
        "author": " Jordy Rosenberg",
        "description": "Sassy, cant, anti-establishment, anti-capitalist, and most definitely the TQ in LGB...\nLet the reader decide if the recreated period diction and grammar works alongside modern American action-style non-sentences, and if the borderline sex for shock’s sake sits with the sometimes torturous academic footnotes - that’s if Jack’s meteoric star allows you pause for thought.",
        "year": 2021
    },
    {
        "id": 12769,
        "title": "Paul",
        "author": "Daisy Lafarge",
        "description": "Taking inspiration from Gauguin's travel journal, Noa Noa, this dreamlike and unsettling novel puts a modern spin on an old story - a vulnerable young woman places her trust in a more worldly, controlling man.  Frances's passive acceptance may test some readers, but this is an affecting book, full of powerful imagery and worth staying with all the way.  One for the top of the TBR list!",
        "year": 2021
    },
    {
        "id": 12970,
        "title": "Marigold and Rose",
        "author": " Louise Glück",
        "description": "With the simplicity of a fable, we share the thoughts of twin sisters in the first year of their life. They are contrasting personalities: Rose the social butterfly living in the now; Marigold the introverted overthinker who already feels intense nostalgia for the passing of time. Warmly and with a wry grin, the book allows us to reflect too, on ourselves and on time. In these slim 52 pages, I found a vast sense of empathy, sadness and wonder.",
        "year": 2022
    },
    {
        "id": 12736,
        "title": "Panenka",
        "author": " Rónán Hession",
        "description": "As Joseph receives some devastating personal news, his life is opening up with possibilities.  Beautifully written and very moving, I learned at least two things from this book: what a panenka is, and what a great writer Ronan Hession is.",
        "year": 2021
    }
]